
var metaphor_dat = [
{id:"25680329_RN3153_02_metaphor_fb_01", number:"<small>ข้อสอบเสมือนจริง กพ  มี.ค. 2568 </small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> กระดาษ : แผ่น   ::  ?  : ?<hr>1) ตะขอ :  อัน<br>2) ปิ่นโต :  เถา<br>3) ไพ่   :  ใบ <br>4) ฟิล์ม   :  กล้อง<br>",
answer:  " ปิ่นโต :  เถา<br><br>ลักษณะนามของปิ่นโต คือ เถา<br>ลักษณะนามของตะขอ คือ ตัว<br>ลักษณะนามของตะไพ่ คือ สำรับ<br><br>"},

{id:"25680329_RN3153_02_metaphor_fb_02", number:"<small>ข้อสอบเสมือนจริง กพ  มี.ค. 2568 </small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> เบาหวาน : น้ำตาล   ::  ?  : ?<hr>1) กีฬา :  สุขภาพ<br>2) สร้าง :  ออกแบบ<br>3) อาฆาต  :  พยาบาท <br>4) สังคม   :  กลุ่มคน<br>",
answer:  " สังคม เกิดจาก การมีกลุ่มคนจำนวนมาก <br>เช่นเดียวกับ โรคเบาหวาน เกิดจากการมีน้ำตาลมากในกระแสเลือด<br><br>"},

{id:"25670329_RN3153_02_metaphor_fb_01", number:"<small>ข้อสอบเสมือนจริง กพ 31 มี.ค. 2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> คอมพิวเตอร์ : เครื่องพิมพ์ดีด   ::  ?  : ?<hr>1) เทียนไข :  หลอดไฟ<br>2) หนังสือพิมพ์ :  วารสาร<br>3) รถกระบะ   :  เกวียน <br>4) หอคอย   :  บอลลูน<br>",
 answer:  "รถกระบะ   :  เกวียน<br><br>คอมพิวเตอร์ ทำได้เหมือน เครื่องพิมพ์ดีด แต่ทำได้มากกว่า และทันสมัยกว่า<br><br>รถกระบะ ทำได้เหมือน เกวียน แต่ทำได้มากกว่า และทันสมัยกว่า<br><br>"},

{id:"25670329_RN1742_02_metaphor_tewa_02", number:"<br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> เทียนไข : ขี้ผึ้ง   ::  ?  : ?<hr>1) วุ้นเส้น :  ถั่วเขียว<br>2) แกรไฟต์ :  ดินสอ<br>3) มันสำปะหลัง   :  สาคู <br>4) แกลบ   :  ธูป<br>",
 answer:  "วุ้นเส้น :  ถั่วเขียว <br><br>เทียนไข ทำมาจาก ขี้ผึ้ง <br>วุ้นเส้น ทำมาจาก ถั่วเขียว<br><br><br>"},

{id:"25670329_RN3153_02_metaphor_tewa_01", number:"<br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> รัฐบาล : ภาษี   ::  ?  : ?<hr>1) สรรพสามิต :  สุรา<br>2) พ่อค้า :  ค้าขาย<br>3) ข้าราชการ   :  เงินเดือน <br>4) สรรพากร   :  เงินได้<br>",
 answer:  "ข้าราชการ   :  เงินเดือน <br><br>ภาษี คือ เงิน ซึ่งเป็นรายได้ของ รัฐบาล <br>เงินเดือน คือ เงิน ซึ่งเป็นรายได้ของ ข้าราชการ<br><br>เงินได้ ไม่ใช่เงินซึ่งเป็นรายได้ของ สรรพากร ทั้งนี้เพราะ เงินได้ ถ้าไม่ถึงเกณฑ์ก็ไม่ต้องเสียภาษี จึงไม่ถูกทั้งหมด<br><br>สุรา ไม่ใช่เงิน<br>ค้าขาย ก็ไม่ใช่เงิน และก็อาจจะไม่ใช่แหล่งรายได้ของพ่อค้า เพราะ ถ้าขายขาดทุน ก็มีให้เห็นเยอะแยะไป<br><br>"},
{id:"25670329_RN1901_02_metaphor_sakchai_05", number:"<small>ข้อสอบเสมือนจริง กพ 29 มี.ค. 2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ลายแทง : สมบัติ   ::  ?  : ?<hr>1) ลายสือไทย :  ศิลาจารึก<br>2) ลายคราม :  เครื่องปั้นดินเผา<br>3) ลายมือ   :  โชคชะตา <br>4) ลายน้ำ   :  ศิลปะ<br>",
 answer:  "ลายมือ   :  โชคชะตา<br><br>ลายแทง บ่งบอก สมบัติ<br>ลายมือ บ่งบอก โชคชะตา ราศี <br>"},

{id:"25670329_RN5941_02_metaphor_sakchai_04", number:"<small>ข้อสอบเสมือนจริง กพ 29 มี.ค. 2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> กันสาด : น้ำฝน   ::  ?  : ?<hr>1) หน้าต่าง :  ลม<br>2) มุ้งลวด :  ยุง<br>3) รั้ว   :  ข้าม<br>4) ระเบียง   :  นั่งเล่น<br>",
 answer:  "กลม   :  แบน <br><br>กันสาด กัน น้ำฝน(สาด)<br>มุ้งลวด กัน  ยุง(เข้ามากัด)<br>"},

{id:"25670329_RN8219_02_metaphor_sakchai_03", number:"<small>ข้อสอบเสมือนจริง กพ 29 มี.ค.2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ขม : หวาน   ::  ?  : ?<hr>1) แหลม :  คม<br>2) ดำ :  เทา<br>3) กลม   :  แบน<br>4) ยาว   :  ยืด<br>",
 answer:  "กลม   :  แบน <br><br>ขม   ตรงข้ามกับ  หวาน<br>กลม   ตรงข้ามกับ  แบน<br>"},

{id:"25670329_RN2785_02_metaphor_sakchai_02", number:"<small>ข้อสอบเสมือนจริง กพ 29 มี.ค.2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> คณิตศาสตร์ : สถิติ   ::  ?  : ?<hr>1) ดาราศาสตร์ :  โหราศาสตร์ <br>2) นิวเคลียร์  :  ฟิสิกส์<br>3) แสงสว่าง   :  ความร้อน<br>4) เคมี   :  ชีวเคมี<br>",
 answer:  "เคมี   :  ชีวเคมี <br><br>ส่วนใหญ่  :  ส่วนย่อย (sub set)<br><br><br>"},

{id:"25670329_RN7969_02_metaphor_sakchai_01", number:"<small>ข้อสอบเสมือนจริง กพ 29 มี.ค.2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ฝอยทอง : มะนาว   ::  ?  : ?<hr>1) ทองหยอด :  แตงโม <br>2) เค้ก  :  มะดัน<br>3) วุ้น   :  มะพร้าว<br>4) มะยม   :  หม้อแกง<br>",
 answer:  "เค้ก  :  มะดัน <br><br>รสหวาน  :  รสเปรี้ยว<br><br><br>"},
{id:"25670201_RN8460_00_metaphor_sakchai_01", number:"<small>ข้อสอบเสมือนจริง กพ มี.ค.2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> อากาศ : ปรอท   ::  ?  : ?<hr>1) น้ำ :  อุณหภูมิ <br>2) เย็น  :  ร้อน<br>3) พายุ   :  ฝน<br>4) ผ้า   :  สายวัด<br>",
 answer:  "ผ้า  :  สายวัด <br><br>วัดอุณหภูมิของอากาศ ด้วย ปรอท<br><br>วัดความกว้าง-ยาวของผ้า ด้วย สายวัด<br>"},

{id:"25670201_RN9925_00_metaphor_sakchai_01", number:"<small>ข้อสอบเสมือนจริง กพ มี.ค.2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> สุนัข : บางแก้ว   ::  ?  : ?<hr>1) ช้าง :  ม้า <br>2) เสือ  :  สิงห์<br>3) แมว   :  สีสวาด<br>4) เป็ด   :  ย่าง<br>",
 answer:  "แมว   :  สีสวาด <br><br>ชื่อสายพันธุ์<br><br>สุนัข พันธุ์ บางแก้ว<br><br>แมว พันธุ์ สีสวาด<br>"},

{id:"25670201_RN3003_00_metaphor_sakchai_01", number:"<small>ข้อสอบเสมือนจริง กพ มี.ค.2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ตื้น : ลึก   ::  ?  : ?<hr>1) เบี้ยว :  บิด <br>2) เย็น  :  ร้อน<br>3) ลด   :  หด<br>4) ใหญ่   :  โต<br>",
 answer:  "เย็น  :  ร้อน <br><br>คำตรงข้าม<br><br>ตื้น คือ ลึกน้อย<br><br>เย็น คือ ร้อนน้อย<br><br>"},

{id:"25670201_RN6038_00_metaphor_sakchai_01", number:"<small>ข้อสอบเสมือนจริง กพ มี.ค.2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> นาฬิกา : ข้อมือ   ::  ?  : ?<hr>1) กำไล  :  สร้อยคอ <br>2) แหวน  :  นิ้ว<br>3) ศรีษะ   :  หมวก<br>4) รองเท้า   :  ถุงเท้า<br>",
 answer:  "แหวน  :  นิ้ว <br><br>นาฬิกา ใส่ ข้อมือ<br><br>แหวน ใส่ นิ้ว<br>"},

{id:"25670201_RN6613_00_metaphor_sakchai_01", number:"<small>ข้อสอบเสมือนจริง กพ มี.ค.2567</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> แข็ง : อ่อน   ::  ?  : ?<hr>1) เหลว  :  ไหล <br>2) ลื่น  :  ฝืด<br>3) สูง   :  ชะลูด<br>4) นุ่ม   :  นิ่ม<br>",
 answer:  "ลื่น  :  ฝืด <br><br>ตรงข้ามกัน<br><br><br>"},

{id:"25650807_RN9997_00_metaphor_tiktok_01", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ดอกมะลิ : ดอกแก้ว  ::  ?  : ?<hr>1) ดอกทานตะวัน  :   ดอกดาวเรือง <br>2) ดอกกุหลาบ  :   ดอกอัญชัน<br>3) ดอกอินทนิล   :   ดอกจำปี<br>4) ดอกฟ้า   :  ดอกดิน<br>",
 answer:  "ดอกทานตะวัน  :   ดอกดาวเรือง <br><br>เป็นดอกไม้มีกลิ่น และมีสีเดียวกัน<br><br>ดอกมะลิ - กลิ่นหอม มีสีขาว<br>ดอกแก้ว - กลิ่นหอม มีสีขาว<br><br>ดอกทานตะวัน -  มีกลิ่นหอมอ่อนๆ คล้ายกลิ่นใบไม้  แต่กลิ่นจะไม่หอมแรงเท่าดอกไม้อื่น ๆ ดอกมีสีเหลือง<br>ดอกดาวเรือง - มีกลิ่นหอมอ่อนๆ คล้ายกลิ่นใบไม้  แต่กลิ่นหอมของดาวเรืองนั้นไม่แรงมาก  บางคนอาจจะไม่ได้กลิ่น  ขึ้นอยู่กับสายพันธุ์  สภาพอากาศ ดอกมีสีเหลือง<br><br>ดอกกุหลาบ  มีหลากสี เช่น แดง เหลือง<br>   ดอกอัญชัน  มีหลายสี ขึ้นอยู่กับสายพันธุ์  เช่น สีน้ำเงิน สีม่วง<br>ดอกอินทนิล - มีหลายสี เช่น ม่วง ชมพู ขึ้นอยู่กับสายพันธุ์ ดอกจำปี - สีขาวครีม<br>ดอกฟ้า - มีหลากหลายสี ขึ้นอยู่กับสายพันธุ์ โดยสีที่พบบ่อย ได้แก่ ฟ้า ม่วง<br>ดอกดิน - มีหลากหลายสี ขึ้นอยู่กับสายพันธุ์ เช่น สีม่วง สีขาว สีเหลือง เป็นต้น<br>"},

{id:"25650807_RN9678_00_metaphor_DrYing_01", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> มด : แมลงปอ  ::  เพนกวิน  : ?<hr>1) ปลา <br>2) แมวน้ำ<br>3) ยุง<br>4) อินทรีย์<br>",
 answer:  "แมวน้ำ<br><br>ไม่สามารถจับคู่แบบ 'บินได้กับบินไม่ได้' เพราะ นางพญามด เป็นมดที่บินได้<br><br>มด เป็น แมลง<br>แมลงปอ เป็นแมลง<br>จับคู่แบบ สัตว์ประเภทเดียวกัน<br><br>เพนกวิน เป็น สัตว์อยู่บนบกได้ ว่ายน้ำได้ ผิวออกสีดำ ๆ<br>แมวน้ำ  เป็น สัตว์อยู่บนบกได้ ว่ายน้ำได้ ผิวออกสีดำ ๆ<br>อินทรี เป็นนก เหมือน แพนกวิน แต่ ว่ายน้ำไม่ได้ มีขน <br>ข้อนี้ แมวน้ำ ถูกที่สุด<br><br>"},

{id:"25650706_RN8211_00_metaphor_Max_17", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> หงส์ : มังกร  ::  ?  : ?<hr>1) ครุฑ : พญานาค <br>2) พญานาค : กินรี<br>3) กินรี : กิเลน<br>4) กิเลน : พญานาค<br>",
 answer:  "กินรี : กิเลน<br><br>เป็นสัตว์ในเทพนิยาย<br>รูปร่างคล้ายกัน<br><img style='display: block;  margin-left: auto;  margin-right: auto;  width:100%; max-width:400px;' src='images/swan_dragon.png'><br>"},

{id:"25650706_RN9678_00_metaphor_Max_16", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ครู : สอน  ::  ?  : ?<hr>1) นกพิราบ : บิน <br>2) หมอ : รักษา<br>3) แม่ค้า : ลูกค้า<br>4) แมว : สัตวแพทย์<br>",
 answer:  "หมอ : รักษา<br><br>ครู ทำหน้าที่ สอน เพื่อขจัดความเขลา<br>หมอ ทำหน้าที่ รักษา เพื่อขจัดความเจ็บไข้<br>"},

{id:"25650706_RN1138_00_metaphor_Max_15", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> น้ำตาล : เบาหวาน  ::  ?  : ?<hr>1) คอเลสเตอรอล : ไขมัน <br>2) แอลกอฮอล์ : ตับ<br>3) โรคกระเพาะ : ผลิตภัณฑ์จากนม<br>4) LDL : HDL<br>",
 answer:  "แอลกอฮอล์ : ตับ<br><br>น้ำตาล เป็นสาเหตุหนึ่งที่ทำให้เกิดโรค เบาหวาน<br>แอลกอฮอล์(เช่น เหล้า เบียร์) เป็นสาเหตุหนึ่งที่ทำให้เกิดโรค ตับ (เช่น โรคพิษสุราเรื้อรัง ทำให้เกิดโรคตับแข็ง)<br><br>"},

{id:"25650706_RN2391_00_metaphor_Max_14", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ดวงอาทิตย์ขึ้น : ดวงอาทิตย์ตก  ::  ?  : ?<hr>1) น้ำขึ้น : น้ำลง <br>2) มืด : สว่าง<br>3) เช้า : ค่ำ<br>4) พระอาทิตย์ : พระจันทร์<br>",
 answer:  "เช้า : ค่ำ<br><br>ดวงอาทิตย์ ขึ้นตอนเช้า ดวงอาทิตย์ตก ตอนค่ำ<br>มีความสัมพันธ์มากกกว่า น้ำขึ้นน้ำลง<br><br>น้ำขึ้น น้ำลง มีความหมายตรงข้ามกัน เหมือนดวงอาทิตย์ขึ้นและตก แต่เมื่อเปรียบเทียบกับ เช้ากับค่ำแล้ว จะเห็นว่า เช้ากับค่ำมีความสัมพันธ์กับดวงอาทิตย์ขึ้นและตกมากกว่า คือ นอกจากจะตรงข้ามกันแล้ว ยังมีความสัมพันธ์ด้านความสว่าง ความมืดด้วย<br><br>น้ำขึ้น  น้ำลง เกี่ยวข้องกับแรงดึงดูดของดวงจันทร์และดวงอาทิตย์ โดยปกติ ในเวลาประมาณ 1 วัน (หรือ 24 ชั่วโมง 50 นาที) จะมีน้ำขึ้น น้ำลง 2 ครั้ง (https://www.nectec.or.th/schoolnet/library/create-web/10000/science/10000-2656.html#:~:text=น้ำจะขึ้นสูง%20เต็มที่,50%20นาที%20น้ำจะสูง)"},

{id:"25650706_RN8949_00_metaphor_Max_12", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> กระดูกสันหลังของชาติ : ชาวนา  ::  ?  : ?<hr>1) กระต่ายกับดวงจันทร์ : คนรัก <br>2) ดวงใจของแม่ : ลูก<br>3) ตาสีตาสา : ข้าเก่าเต่าเลี้ยง<br>4) ชาวนา : งูเห่า <br>",
 answer:  "ดวงใจของแม่ : ลูก<br><br>ชาวนา เป็น กระดูกสันหลังของชาติ<br>ลูก เป็น ดวงใจของแม่<br>"},

{id:"25650704_RN9223_00_metaphor_Max_11", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> นายกรัฐมนตรี : บริหาร  ::  ?  : ?<hr>1) นักเรียน : เรียน <br>2) หมอ : คนไข้<br>3) กองทัพบก : นายพล<br>4) ช้อน : ส้อม <br>",
 answer:  "นักเรียน : เรียน <br><br>นายกรัฐมนตรี มีหน้าที่ บริหาร<br>นักเรียน  มีหน้าที่ เรียน<br>"},

{id:"25650706_RN4176_00_metaphor_Max_8", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ปากหวานก้นเปรี้ยว : ปากปราศัยน้ำใจเชือดคอ  ::  ?  : ?<hr>1) หมาเห่าใบตองแห้ง : หมาเห่า ไม่กัด <br>2) ปากหอยปากปู : ปากเปียกปากแฉะ<br>3) ปากว่าตาขยิบ : มือถือสากปากถือศีล<br>4) ปากเป็นเอกเลขเป็นโท : ปากไม่สิ้นกลิ่นน้ำนม<br>",
 answer:  "ปากว่าตาขยิบ : มือถือสากปากถือศีล<br><br>มีความหมายไปในทำนองเดียวกัน<br><br>ปากหวานก้นเปรี้ยว = พูดจาอ่อนหวานแต่ไม่จริงใจ<br>ปากปราศัยน้ำใจเชือดคอ  = คนพูดดีด้วยแต่ในใจไม่บริสุทธิ มุ่งคิดร้ายอาฆาตผู้อื่นตลอดเวลา<br><br>ปากว่าตาขยิบ  = พูดอย่างหนึ่งแต่ทําอีกอย่างหนึ่ง ปากกับใจไม่ตรงกัน<br>มือถือสากปากถือศีล = มักแสดงตัวว่าเป็นคนมีศีลมีธรรม แต่กลับประพฤติชั่ว<br><br>ปากเป็นเอก เลขเป็นโท = มาจาก ปากเป็นเอก เลขเป็นโท หนังสือเป็นตรี ชั่วดีเป็นตรา<br>หมายถึง สมัยก่อนการศึกษาเล่าเรียนเขียนอ่านยังไม่แพร่หลาย คนที่รู้หนังสือมีน้อย บางคนก็ได้ดีเพราะปาก การคิดเลขหรือการคำนวณนั้นมีความสำคัญน้อยลงมาอีก แม้เดี๋ยวนี้คนที่มีความรู้ดีแต่พูดไม่เก่ง ก็เอาดีได้ยาก ส่วนความชั่วความดีนี้ ทำลงไปแล้วย่อมเป็นเสมือนตราที่ประทับลงไปให้รู้ว่าคนนั้นเป็นคนดี หรือคนชั่ว<br>"},

{id:"25650706_RN8949_00_metaphor_Max_9", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ชายแดน : ประเทศ  ::  ?  : ?<hr>1) บ้าน : รั้ว <br>2) กรอบรูป : รูป<br>3) ชายฝั่ง : ทะเล<br>4) รองเท้า : ถุงเท้า <br>",
 answer:  "กรอบรูป : รูป<br><br>ชายแดน เป็นกรอบล้อมรอบ ประเทศ<br>กรอบรูป เป็นกรอบล้อมรอบ รูป<br>"},

{id:"25650706_RN9419_00_metaphor_Max_10", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ไฟฟ้า : เตารีด  ::  ?  : ?<hr>1) ความร้อน : แสงแดด <br>2) แม่น้ำ : เรือ<br>3) น้ำมัน : รถยนต์<br>4) นักเรียน : โดดร่ม <br>",
 answer:  "รถยนต์ : น้ำมัน<br><br>เตารีด ต้องใช้ ไฟฟ้า เพื่อให้ทำงานได้<br>รถยนต์ ต้องใช้ น้ำมัน เพื่อให้ทำงานได้<br>"},

{id:"25650706_RN4724_00_metaphor_Max_7", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> รถไฟ : ราง  ::  ?  : ?<hr>1) จักรยาน : ล้อ <br>2) เครื่องบิน : สนามบิน<br>3) รถยนต์ : ถนน<br>4) ท่าเรือ : เรือ <br>",
 answer:  "รถยนต์ : ถนน<br><br>รถไฟ วิ่งบน ราง<br>รถยนต์ วิ่งบน ถนน<br>"},

{id:"25650702_RN1327_00_metaphor_Max_6", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> น้ำพุ : น้ำตก  ::  ?  : ?<hr>1) น้ำร้อน : กาต้มน้ำ <br>2) น้ำผึ้ง : รวงข้าว<br>3) ดวงอาทิตย์ : ดวงจันทร์<br>4) ทะเล : สระว่ายน้ำ <br>",
 answer:  "ดวงอาทิตย์ : ดวงจันทร์<br><br>สิ่งที่ตรงกันข้าม<br>น้ำพุ พุ่งขึ้น  :  น้ำตก ตกลง<br>ดวงอาทิตย์ กลางวัน  : ดวงจันทร์ กลางคืน<br>"},

{id:"25650702_RN7939_00_metaphor_Max_5", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> พะยูน : เงือก  ::  ?  : ?<hr>1) คฤหาสน์ : เรือน <br>2) ปลา : อรรณพ<br>3) โต้ง : ไก่อู<br>4) กะลาสี : กัปตัน <br>",
 answer:  "โต้ง : ไก่อู <br><br>หมายถึงสิ่งเดียวกัน<br><br>พะยูน กับ เงือก คนมักจะหมายถึงสิ่งเดียวกัน คือ เงือก<br>โต้ง คือ ไก่อูตัวผู้ขนาดใหญ่<br><br>โต้ง = ใช้เรียกไก่อูตัวผู้ขนาดใหญ่<br>อรรณพ = ห้วงนํ้า, ทะเล, มหาสมุทร.<br><span style='font-size: 0.7em;'>(พจนานุกรม ฉบับราชบัณฑิตยสถาน)</span><br>"},

{id:"25650702_RN8119_00_metaphor_Max_3", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ส้ม : เงาะ  ::  ?  : ?<hr>1) มะปราง : มะม่วง <br>2) ลำไย : ละมุด<br>3) มะละกอ : ลูกสาลี่<br>4) ลองกอง : ลิ้นจี่ <br>",
 answer:  "ลองกอง : ลิ้นจี่  <br><br>เปรียบเทียบลักษณะเปลือก สีเนื้อ และเมล็ด<br><br>ส้ม คล้าย ลองกอง คือ ผลดิบมีสีเขียว สุกสีออกเหลือง เหมือนกัน มีเปลือกหุ้มจะกินต้องปอก เนื้อในเป็นกลีบเหมือนกัน สีเนื้อสีขาวเหมือนกัน เมล็ดมีหลายเมล็ดเหมือนกัน<br><br>เงาะ คล้าย ลิ้นจี่ คือ สีผลออกสีแดงเหมือนกัน เนื้อในสีขาวเหมือนกัน เมล็ดใหญ่เหมือนกัน<br><img style='display: block;  margin-left: auto;  margin-right: auto;  width:100%; max-width:400px;' src='images/fruits_pear_litchee.png'><br>"},

{id:"25650702_RN8119_00_metaphor_Max_2", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> บานชื่น : ทองกวาว  ::  ?  : ?<hr>1) กุหลาบ : ศรีตรัง <br>2) ดาวเรือง : ดาวกระจาย<<br>3) ประดู่ : มะลิ <br>4) ชัยพฤกษ์ : ทรงบาดาล <br>",
 answer:  "กุหลาบ : ศรีตรัง <br><br>พืชล้มลุก  : ไม้ยืนต้น<br>บานชื่น และ กุหลาบ เป็นพืชล้มลุก<br>ทองกวาว และ ศรีตรัง เป็นไม้ยืนต้น<br><img style='display: block;  margin-left: auto;  margin-right: auto;  width:100%; max-width:400px;' src='images/annual-perennial_plant.png'><br>"},

{id:"25650702_RN8049_00_metaphor_Max_1", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> เข็นครกขึ้นภูเขา : ฝนทั่งให้เป็นเข็ม  ::  ?  : ?<hr>1) ขมิ้นกับปูน : ขนมพอสมน้ำยา <br>2) เกลือจิ้มเกลือ : น้ำท่วมปาก<br>3) ตำน้ำพริกละลายแม่น้ำ : ขี่ช้างจับตั๊กแตน <br>4) จับปลาสองมือ : งมเข็มในมหาสมุทร <br>",
 answer:  "ตำน้ำพริกละลายแม่น้ำ : ขี่ช้างจับตั๊กแตน<br><br>ความหมายไปในทำนองเดียวกัน<br>เข็นครกขึ้นภูเขา มึความหมายทำนองเดียวกับ ฝนทั่งให้เป็นเข็ม<br>ตำน้ำพริกละลายแม่น้ำ  มึความหมายทำนองเดียวกับ  ขี่ช้างจับตั๊กแตน"},

{id:"25660201_RN7795_00_metaphor_Facebook_1", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ปู : เสื่อ  ::  ?  : ?<hr>1) ยิง : ปืน <br>2) ระบาย : สี<<br>3) กาง : เต้นท์ <br>4) เขียน : ปากกา <br>",
 answer:  "กาง : เต้นท์ <br><br>ในบรรดาตัวเลือกทั้งหมด จะเห็นว่า เต้นท์ มีลักษณะเหมือน เสื่อ มากที่สุด<br>"},

{id:"25660201_RN7795_00_metaphor_Facebook_1", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> นักเรียน : เกรด  ::  ?  : ?<hr>1) ห้องเรียน : โรงเรียน <br>2) ตำรวจ : ผู้ร้าย<<br>3) พนักงาน : เงินเดือน <br>4) พืช : สังเคราะห์แสง <br>",
 answer:  "พนักงาน : เงินเดือน<br><br>นักเรียน หวัง เกรด<br>พนักงาน หวัง เงินเดือน<br>"},

{id:"25620101_RN9629_00_metaphor_Max_20", number:"<small>ข้อสอบเสมือนจริง กพ 2562</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> โพล้เพล้ : พลบค่ำ  ::  ?  : ?<hr>1) ทิวา : กลางวัน <br>2) สายัณห์ : กลางคืน<<br>3) ราตรี : เที่ยงคืน <br>4) อรุณ : เช้าตรู่ <br>",
 answer:  "อรุณ: เช้าตรู่ <br><br>วิเคราะห์แบบ ข้ามคู่ <br><br>โพล้เพล้ ตรงข้ามกับ อรุณ<br>พลบค่ำ ตรงข้ามกับ เช้าตรู่   <br><br>ความหมาย<br>โพล้เพล้ - เวลาพลบคํ่า, เวลาจวนคํ่า, เวลาเข้าไต้เข้าไฟ<br>พลบค่ำ - เวลาย่ำค่ำ, เวลาโพล้เพล้, เวลาเข้าไต้เข้าไฟ<br>อรุณ - เวลาใกล้พระอาทิตย์จะขึ้น, เวลายํ่ารุ่ง<br>สายัณห์ - เวลาเย็น <br>เช้าตรู่ - เวลาสาง ๆ, เวลาที่แสงเงินแสงทองขึ้น, รุ่งอรุณ.<br>ทิวา - วัน กลางวัน <br><br>ข้อ 4 ถูกมากกว่า ข้อ 1 เพราะ ข้อ 1 มีความหมายเหมือนกันเหมือนข้อความที่กำหนด แต่ ข้อ 4 นอกจากจะมีความหมายเหมือนกันเหมือนข้อความที่กำหนดแล้ว ยังเป็นช่วงเวลาสั้น ๆ เหมือนกัน และยังมีความหมายในเชิงตรงข้ามกันอีกด้วย<br>"},

{id:"25620101_RN9629_00_metaphor_Max_20", number:"<small>ข้อสอบเสมือนจริง กพ 2562</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> คาน : ตาชั่งจีน ::  ?  : ?<hr>1) สกรู : บันไดเวียน <br>2) ชะแลง : เพลา<<br>3) กระดาษ : ปากกา<br>4) ตะปู : ไม้ <br>",
 answer:  "สกรู: บันไดเวียน<br><br>ลักษณะการทำงานเหมือนกัน  <br>ไม้คาน : ตาชั่งจีน มีลักษณะเป็นคาน เหมือนกัน<br>สกรู : บันไดเวียน มีลักษณะวน ๆ หมุน ๆ เหมือนกัน<br><img style='display: block;  margin-left: auto;  margin-right: auto;  width:100%; max-width:400px;' src='images/chinese_scale.png'><br>"},

{id:"25620101_RN7953_00_metaphor_Max_20", number:"<small>ข้อสอบเสมือนจริง กพ 2562</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ปล่อย : รวบ ::  ?  : ?<hr>1) สะดุด : ล้ม <br>2) นิ่ง : ขยับ<<br>3) ท้าย : ปลาย<br>4) แบก : หาม<br>",
 answer:  "นิ่ง : ขยับ<br><br>ความหมายตรงกันข้าม  <br><br>"},

{id:"25660101_RN7953_00_metaphor_Max_20", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ขมิ้น : ไพล ::  ?  : ?<hr>1) ส้ม  : พลับ <br>2) ฟักทอง :  ทุเรียน<<br>3) มันสำปะหลัง :  หัวไชเท้า<br>4) พริก : กระชาย<br>",
 answer:  "มันสำปะหลัง :  หัวไชเท้า<br><br>เป็นหัวเหมือนกัน  <br><br>"},

{id:"25660101_RN9778_00_metaphor_Max_20", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> มะนาว : มะม่วง ::    : ?<hr>1) ส้ม : มะปราง <br>2) แก้วมังกร : เมล่อน<br>3) องุ่น : แอบเปิ้ล<br>4) ฟักทอง : แตงโม<br>",
 answer:  "ส้ม : มะปราง<br><br>รสเปรี้ยวเหมือนกัน  <br><br>"},

{id:"25640501_RN4739_00_metaphor_Max_19", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>มีด : หั่น ::    : ?<hr>1) ตัด :  กรรไกร <br>2) ขวาน : จาม<br>3) ทุบ : ค้อน<br>4) คีม : เจาะ<br>",
 answer:  "ขวาน : จาม<br><br> สิ่งของ : หน้าที่ <br><br>มีด ใช้ หั่น<br>ขวาน ใช้ จาม<br><br>จาม - ฟันลงไปเต็มที่ เช่น เอาขวานจามหัว."},

{id:"25640501_RN4739_00_metaphor_Max_18", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ป้องกัน : เกราะ ::    : ?<hr>1) เผา :  ไฟ <br>2) ตัก : พลั่ว<br>3) ประเทศ : ทหาร<br>4) ตำรวจ : อาวุธ<br>",
 answer:  "ตัก : พลั่ว<br><br>หน้าที่  :  สิ่งของ<br><br>ป้องกัน ใช้ เกราะ<br>ตัก ใช้ พลั่ว<br>"},

{id:"25640501_RN4739_00_metaphor_Max_17", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ปริญญา : ศึกษา ::    : ?<hr>1) ใบ รบ. : นักเรียน <br>2) ทะเบียนสมรส : สมรส<br>3) ตั๋วโดยสาร : เดินทาง<br>4) ตำรวจ : อาวุธ<br>",
 answer:  "ทะเบียนสมรส : สมรส<br><br>รูปแบบ คือ คำนาม : คำกริยา<br>ปริญญา ได้มาจากการ ศึกษา<br>ทะเบียนสมรส ได้มาจากการ สมรส<br><br>ใบ รบ. ก็ได้มาจากการเป็น นักเรียน แต่ คำว่า 'นักเรียน' เป็นคำนาม อีกทั้ง ถ้าเรียนไม่จบ ก็ไม่ได้ใบ รบ.<br>ตัวเลือกข้อ 2 จึงมีความสัมพันธ์มากกว่า ข้อ 1<br>"},

{id:"25640501_RN4739_00_metaphor_Max_16", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>แชมพู : สบู่ ::    : ?<hr>1) ครีมนวดผม :  แปรงผม <br>2) ยาสีฟัน : ครีมทาผิว<br>3) น้ำยาดัดผม : น้ำยาทาเล็บ<br>4) น้ำยาบ้วนปาก : แปรงสีฟัน<br>",
 answer:  "ยาสีฟัน : ครีมทาผิว<br><br>ตำแหน่งที่ใช้ผลิตภัณฑ์<br>ใช้กับใบหน้าและศีรษะ : สิ่งที่ใช้กับลำตัว<br>"},

{id:"25640501_RN1202_00_metaphor_Max_15", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ขิม : ตัว ::    : ?<hr>1) เปียนโน :  อัน <br>2) ระนาด : ราง<br>3) ไวโอลิน : ตัว<br>4) โปงลาง : ตัว<br>",
 answer:  "ระนาด : ราง<br><br>เปียนโน - หลัง<br>ระนาด - ราง<br>ไวโอลิน - คัน<br>โปงลาง - ผืน<br><br>เพิ่มเติม<br>1. ขลุ่ย, ปี่ ลักษณนามคือ เลา<br>2. กีตาร์, ทรัมเป็ต, ทรอมโบน ลักษณนามคือ ตัว<br>3. กระจับปี่, ซอ, ซึง, พิณ ลักษณนามคือ คัน<br>4. แคน ลักษณนามคือ เต้า<br>5. กรับ, ฉิ่ง, ฉาบ ลักษณนามคือ คู่6. เปียโน ลักษณนามคือ หลัง<br>7. หีบเพลงปาก ลักษณนามคือ อัน<br>8. กรับพวง ลักษณนามคือ พวง<br>9. กลอง, ฆ้อง, ตะโพน ลักษณนามคือ ใบ, ลูก<br>10. โปงลาง ลักษณนามคือ ผืน<br> "},

{id:"25640501_RN1202_00_metaphor_Max_14", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>น้ำตาล : อ้อย ::    : ?<hr>1) ถั่วเขียว :  ถั่วงอก <br>2) กะปิ : เคย<br>3) ถั่วเหลือง : ซีอิ๊ว<br>4) เกลือ : น้ำปลา <br>",
 answer:  "กะปิ : เคย<br><br>น้ำตาล ทำจาก อ้อย<br>กะปิ ทำจาก เคย<br><br>ถั่วเขียว ไม่ได้ทำจาก ถั่วงอก<br>ถั่วเหลือง ไม่ได้ทำจาก ซีอิ๊ว<br>เกลือ ไม่ได้ทำจาก น้ำปลา<br><br>ความสัมพันธ์ต้องเรียงลำดับกันให้ถูกต้องด้วย<br>"},

{id:"25640501_RN8137_00_metaphor_Max_12", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ฝนตก : ฟ้าร้อง ::    : ?<hr>1) ขยัน :  ซื่อสัตย์ <br>2) รวย : ขี้เกียจ<br>3) เสียใจ : ร้องไห้<br>4) เข้มแข็ง : อ่อนแอ <br>",
 answer:  "เสียใจ : ร้องไห้ <br><br>สิ่งที่มักจะเกิดขึ้นด้วยกัน<br>ฝนตก กับ ฟ้าร้อง มักจะเกิดขึ้นด้วยกัน (แต่ไม่จำเป็นเสมอไป)<br>เสียใจ กับ ร้องไห้ มักจะเกิดขึ้นด้วยกัน (แต่ไม่จำเป็นเสมอไป)"},

{id:"25640101_RN8167_00_metaphor_Max_11", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>สุริยา : ตะวัน ::    : ?<hr>1) นภา :  ท้องฟ้า <br>2)  ทินกร : อัศดง<br>3) พันแสง : จันทรา<br>4) ดารา : นักร้อง <br>",
 answer:  "สงสาร : อุปการะ <br><br>ความรู้สึก  :  การกระทำ<br>อาสา เพราะมีความเต็มใจ<br>อุปการะ เพราะมีความสงสาร"},

{id:"25640101_RN4183_00_metaphor_Max_10", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เต็มใจ : อาสา ::    : ?<hr>1) เลว :  เจ้าเล่ห์  <br>2)  สงสาร : อุปการะ<br>3) ผิด : ลบ<br>4) สำนึก : ลงโทษ <br>",
 answer:  "สงสาร : อุปการะ <br><br>ความรู้สึก  :  การกระทำ<br>อาสา เพราะมีความเต็มใจ<br>อุปการะ เพราะมีความสงสาร"},

{id:"25640101_RN8860_00_metaphor_Max_09", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ศีรษะ : หมวก :: บ้าน    : ?<hr>1) ประตู  <br>2) หน้าจั่ว <br>3) หลังคา<br>4) ตึก <br>",
 answer:  "หลังคา <br><br>หมวก ปกป้อง ศีรษะ จากแดด<br>หลังคา ปกป้อง บ้าน จากแดด"},

{id:"25640101_RN3144_00_metaphor_Max_08", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ปลา : เรือดำน้ำ :: นก    : ?<hr>1) รถยนต์   <br>2) เครื่องบิน <br>3) ท้องฟ้า<br>4) ก้อนเมฆ <br>",
 answer:  "เครื่องบิน <br><br>สัตว์ : ยานพาหนะ<br>"},

{id:"25640101_RN3263_00_metaphor_Max_07", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>วัด : สงบ :: ห้างสรรพสินค้า    : ?<hr>1) เย็น   <br>2) พลุกพล่าน <br>3) มั่วสุม<br>4) บันเทิง <br>",
 answer:  "พลุกพล่าน <br><br>วัด มีบรรยากาศที่ สงบ<br>ห้างสรรพสินค้า มีบรรยากาศที่ พลุกพล่าน "},

{id:"25650508_RN1589_00_metaphor_SakChai_1", number:"<small>ข้อสอบเสมือนจริง กพ 2564 (สอบ 8  พ.ค. 65)</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้าวต้มมัด : ข้าวหลาม ::     : ?<hr>1) เชือก : กระบอก   <br>2) ไส้กรอก  :  กุนเชียง <br>3) ข้าวเกรียบปากหม้อ  :  ข้าวเหนียวดำ<br>4) ห่อหมก : เยื่อไผ่ <br>",
 answer:  "ไส้กรอก  :  กุนเชียง <br><br>ข้าวต้มมัด มีรูปร่างเหมือน ไส้กรอก คือ มีการห่อ และมีการมัด<br>ข้าวหลาม มีรูปเหมือน กุนเชียง คือ มีลักษณะยาว ๆ<br><br>หรือดูอีกอย่างคือ<br><br>วัตถุดิบที่ใช้เหมือนกัน<br>ข้าวต้มมัด-ข้าวหลาม ใช้ข้าวเหนียว<br>ไส้กรอก-กุนเชียง ใช้เนื้อสัตว์"},

{id:"25640101_RN3343_00_metaphor_Max_06", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ที่ดิน : ตารางวา ::     : ?<hr>1) ไม้บรรทัด : เซ็นติเมตร   <br>2) กิโลเมตรต่อชั่วโมง  :  ความเร็ว <br>3) ของเหลว  :  ซี.ซี. <br>4) ของแข็ง : ก๊าซ <br>",
 answer:  "ของเหลว  :  ซี.ซี. <br><br>ที่ดิน มีหน่วยวัดเป็น ตารางวา<br>ของเหลว  มีหน่วยวัดเป็น  ซี.ซี."},

{id:"25640101_RN7885_00_metaphor_Max_05", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ไฟ : ควัน ::     : ?<hr>1) ฝน : เมฆ   <br>2) เถ้า  :  ถ่าน <br>3) แสง  :  เงา <br>4) รูป : นาม <br>",
 answer:  "แสง  :  เงา <br><br>ไฟ ทำให้เกิด ควัน<br>แสง  ทำให้เกิด  เงา"},

{id:"25640101_RN6617_00_metaphor_Max_04", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>กระทะ : ล้าง ::     : ?<hr>1) แหวน : ขัด   <br>2) ซัก  :  กางเกง <br>3) ตะหลิว  :  ทัพพี <br>4) ช้อน : ส้อม <br>",
 answer:  "แหวน : ขัด <br><br>กระทะ ทำความสะอาดโดยการ ล้าง<br>แหวน ทำความสะอาดโดยการ ขัด"},

{id:"25640101_RN7656_00_metaphor_Max_03", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เศร้า : อารมณ์ :: แหวน : ?<hr>1) เครื่องประดับ    <br>2) เงิน   <br>3) ทอง   <br>4) นิ้ว<br>",
 answer:  "เครื่องประดับ  <br><br>เศร้า เป็น อารมณ์ อย่างหนึ่ง<br>แหวน เป็น เครื่องประดับ อย่างหนึ่ง"},

{id:"25640101_RN6496_00_metaphor_Max_02", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ยาว : สั้น :: ? : ?<hr>1) ดำ : ขาว    <br>2) เดือน : ปี   <br>3) แมว : เสือ   <br>4) งู : ปลาไหล<br>",
 answer:  "ดำ : ขาว  <br><br>ความหมายตรงกันข้าม<br>"},

{id:"25640101_RN6496_00_metaphor_Max_01", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>อิสรภาพ : นกพิราบ :: ? : ?<hr>1) เสือโคร่ง : กล้าหาญ    <br>2) น่ารัก : หมา   <br>3) ความรุ่งเรือง : มังกร   <br>4) น่ากลัว : ขนลุก<br>",
 answer:  "ความรุ่งเรือง : มังกร  <br><br>นกพิราบ เป็นสัญลักษณ์ของ อิสรภาพ<br>มังกร เป็นสัญลักษณ์ของ ความรุ่งเรือง<br><img style='display: block;  margin-left: auto;  margin-right: auto;  width:100%; max-width:400px;' src='images/dragon.png'><br>富贵兴隆 (Fùguì xīnglóng - ฮู้ก้วยชิงหลง) แปลว่า ความมั่งคั่งและความเจริญรุ่งเรือง"},

{id:"25650101_RN6496_00_metaphor_Note_6", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ประณาม : สรรเสริญ :: ? : ?<hr>1) ท้อแท้ : กล้าหาญ    <br>2) วิตก : กังวล   <br>3) อคติ : คุณธรรม   <br>4) เฉื่อย : กระตือรือร้น<br>",
 answer:  "เฉื่อย : กระตือรือร้น  <br><br>ความหมายตรงข้ามกัน<br>อคติ - มีอคติ แสดงว่าไม่เป็นกลาง<br>คำตรงข้าม ของ อคติ คือ ยุติธรรม"},

{id:"25650101_RN6496_00_metaphor_Note_5", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>สติ : สัมปชัญญะ :: ? : ?<hr>1) โศกเสศร้า : เสียใจ    <br>2) วิตก : วิจารณ์   <br>3) สมัคร : สมาน   <br>4) สนุก : สนาน<br>",
 answer:  "โศกเสศร้า : เสียใจ  <br><br>ความหมายเหมือนกัน หรือ ใกล้เคียงกัน<br>"},

{id:"25620101_RN649_00_metaphor_Note_4", number:"<small>ข้อสอบเสมือนจริง กพ 2562</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พัง : พลาย :: ? : ?<hr>1) กวาง : เนื้อสมัน    <br>2) ฤษี : โยคี   <br>3) แจ้ : โต้ง   <br>4) ภรรยา : สามี<br>",
 answer:  "ภรรยา : สามี  <br><br>เพศเมีย (หญิง)  : เพศผู้ (ชาย)<br>"},

{id:"25610101_RN1282_00_metaphor_Note_3", number:"<small>ข้อสอบเสมือนจริง กพ 2561</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พลังงาน : สันดาป :: ? : ?<hr>1) หนี้สิน : กู้ยืม    <br>2) ประติมากรรม : ภาพวาด   <br>3) รถยนต์ : รถจักรยาน   <br>4) เสียง : เดซิเบล<br>",
 answer:  "หนี้สิน : กู้ยืม   <br><br>พลังงาน เกิดจาก สันดาป<br>หนี้สิน เกิดจาก กู้ยืม"},

{id:"25650101_RN6718_00_metaphor_Note_2", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ธงชาติ : ผืน :: ? : ?<hr>1) ดวง : ตะเกียง    <br>2) รถไฟ : คัน   <br>3) ผ้าไตร: ผืน   <br>4) ขลุ่ย : เลา <br>",
 answer:  "ขลุ่ย : เลา   <br><br>ลักษณะนาม<br>รถไฟ - ขบวน<br>ผ้าไตร - ไตร"},

{id:"25610101_RN6767_00_metaphor_Note_1", number:"<small>ข้อสอบเสมือนจริง กพ 2561</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ช้อน : ส้อม :: ? : ?<hr>1) หนังสือ : บรรทัด    <br>2) โต๊ะ : เก้าอี้    <br>3) แก้วน้ำ : แจกัน   <br>4) มีด : ทัพพี  <br>",
 answer:  "โต๊ะ : เก้าอี้   <br><br>ของใช้ คู่กัน<br>"},

{id:"25660430_RN2242_00_metaphor_Note_6", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>รก : รังหนู :: ? : ?<hr>1) ใจเสาะ : ปลาสร้อย    <br>2) ดำ : มืด    <br>3) กว้าง : มหาสมุทร   <br>4) เบา : ปุยน่น  <br>",
 answer:  "เบา : ปุยน่น   <br><br>เป็นคำอุปมาอุปไมย<br>รก เป็น รังหนู<br>คำที่ถูก<br>ใจเสาะ เป็น ปลาซิว<br>ดำ เป็น ตอตะโก<br>ใจกว้าง เป็น มหาสมุทร<br>ดู เมนูความสามารถทั่วไป เรื่อง คำอุปมาอุปไมย ที่ควรรู้"},

{id:"25660430_RN4976_00_metaphor_Note_6", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พี่ : น้อง :: ? : ?<hr>1) พ่อ : แม่    <br>2) ฉัน : เธอ    <br>3) น้าสะใภ้ : อาเขย   <br>4) ลุง : ป้า  <br>",
 answer:  "ฉัน : เธอ  <br><br>เพศ อาจเป็นได้ทั้งชายและหญิง<br>พี่-น้อง อาจเป็นได้ทั้งชายและหญิง<br>ฉัน-เธอ อาจเป็นได้ทั้งชายและหญิง<br>"},

{id:"25660430_RN2943_00_metaphor_Note_5", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พี่ : น้อง :: ? : ?<hr>1) พ่อ : แม่    <br>2) แม่ : ฉัน    <br>3) น้าสะใภ้ : อาเขย   <br>4) ลุง : น้า  <br>",
 answer:  "ลุง : น้า  <br><br>อายุ มากกว่า  :  น้อยกว่า<br>พี่ อายุมากกว่า น้อง<br>ลุง อายุมากกว่า น้า<br>"},

{id:"25660430_RN7697_00_metaphor_Note_4", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เตียง : มุ้ง :: ? : ?<hr>1) หมอน : ผ้าปูที่นอน    <br>2) กระท่อม : แคร่    <br>3) ตู้ : กระจก   <br>4) บ้าน : ตึก  <br>",
 answer:  "บ้าน : ตึก <br><br>ลักษณะนาม เหมือนกัน<br>เตียง-มุ้ง -- หลัง<br>บ้าน-ตึก -- หลัง<br>"},

{id:"25660429_RN3023_00_metaphor_Note_3", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ยาบ้า : ยาเสพติด :: ? : ?<hr>1) พี่น้อง : ญาติ    <br>2) วาด : เขียน    <br>3) หนังสือ : คำนำ   <br>4) ย่อความ : เรียงความ  <br>",
 answer:  "พี่น้อง : ญาติ  <br><br>ยาบ้า จัดเป็น ยาเสพติด<br>พี่น้อง จัดเป็น (เครือ)ญาติ<br>"},

{id:"25660430_RN8837_00_metaphor_Note_2", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เหนือ : ใต้ :: ? : ?<hr>1) ภูเขา : ถ้ำ    <br>2) แม่น้ำ : ลำธาร    <br>3) กลางวัน : กลางคืน   <br>4) หิมาลัย : หิมพานต์   <br>",
 answer:  "กลางวัน : กลางคืน <br><br>เหนือ ตรงข้ามกับ ใต้<br>กลางวัน ตรงข้ามกับ กลางคืน<br>"},

{id:"25660404_RN5449_00_metaphor_Note_1", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ครู : นักเรียน :: ? : ?<hr>1) พระ : แม่ชี    <br>2) หมอ : คนไข้    <br>3) ดารา : นักร้อง   <br>4) ตำรวจ : อัยการ   <br>",
 answer:  "หมอ : คนไข้  <br><br>ครู ให้ความรู้ นักเรียน<br>หมด ให้การรักษา คนไข้<br>"},

{id:"25650101_RN9603_00_metaphor_Pang_02", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>กระดาษ : แผ่น :: ? : ?<hr>1) ดินสอ : ด้าม    <br>2) ไข่ : ใบ    <br>3) เกวียน : เล่ม   <br>4) ช้าง : ตัว   <br>",
 answer:  "3) เกวียน : เล่ม   <br><br>ลักษณะนาม<br>ดินสอ - แท่ง<br>ไข่ - ฟอง<br>ช้าง - เชือก<br><br>มารยาร้อยเล่มเกวียน แปลว่ามีมารยาเยอะมากกกกกก<br>"},

{id:"25650101_RN6792_00_metaphor_Pang_03", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>หิมะ : ลาวา :: ? : ?<hr>1) โต๊ะ : เก้าอี้      <br>2) นุ่น : ขนนก     <br>3) หวาน : ขม<br>4) ถ่าน : ไฟ<br>",
 answer:  "3) หวาน : ขม <br><br>ตรงกันข้าม<br>"},

{id:"25650101_RN4074_00_metaphor_Sheet2565_04", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ระนาด : ฆ้อง :: โทน : ?<hr>1)  จะเข้    <br>2)  พิณนํ้าเต้า     <br>3)  รํามะนา   <br>4) สะล้อ   <br>",
 answer:  "3)  รํามะนา   <br><br>เครื่องดนตรีไทยเดิม เครื่องตีเหมือนกัน<br><br>จะเข้และพิณนํ้าเต้า เป็นเครื่องดีด<br>สะล้อ เป็นเครื่องสี <br>ปี่ ขลุ่ย เป็นเครื่องเป่า<br>"},

{id:"25650101_RN7339_00_metaphor_Sheet2565_05", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ทหาร : กอง :: โลมา : ?<hr>1) ตัว    <br>2) ชนิด    <br>3) เหล่า   <br>4) ฝูง   <br>",
 answer:  "4) ฝูง    <br><br>ทหาร อยู่รวมกันหลายคนเป็น กอง - กองทหาร<br>(ปลา)โลมา อยู่รวมกันหลายตัวเป็น ฝูง - ฝูง(ปลา)โลมา<br><br>"},

{id:"25650101_RN5147_00_metaphor_Sheet2565_06", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เต้าหู้ : นิ่ม  :: ? : ?.<hr>1) แป้ง : เปียก    <br>2) ทราย : ป่น    <br>3) สําลี : นุ่ม   <br>4) แข็ง : หิน   <br>",
 answer:  "3) สําลี : นุ่ม   <br><br>สิ่งของ : ลักษณะทางกายภาพ<br><br>แป้ง - ผง<br>ทราย - หยาบ/ละเอียด<br>หิน - แข็ง (ไม่ใช่ แข็ง - หิน)<br>"},

{id:"25650101_RN1806_00_metaphor_Sheet2565_07", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>มีน : ปลา   :: ? : ?<hr>1) มังกร : ปู     <br>2) พฤษภ : วัว    <br>3) เมถุน : หญิงสาว   <br>4) ตุล : แมงป่อง   <br>",
 answer:  "พฤษภ : วัว   <br><br>ราศี : สัตว์ประจำราศี<img style='display: block;  margin-left: auto;  margin-right: auto;  width:100%; max-width:400px;' src='images/sodiac.png'><br>ราศีมังกร - แพะมีเขา<br>ราศีกุมภ์ - ชายแบกหม้อน้ำ <br>ราศีมีน - ปลาคู่ <br>ราศีเมษ - แกะตัวผู้ <br><strong>ราศีพฤษภ - วัว</strong><br>ราศีเมถุน - คนคู่<br>ราศีกรกฎ - ปู <br>ราศีสิงห์ - สิงโตตัวผู้ <br>ราศีกันย์ - หญิงสาวพรหมจรรย์<br>ราศีตุล - คันชั่งหรือตราชู<br>ราศีพิจิก - แมงป่อง<br>ราศีธนู - เซนทอร์ยิงธนู<br><br>"},

{id:"25650101 _RN7360_00_metaphor_Sheet2565_08", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>นํ้าปลา : เกลือ   :: ? : ?<hr>1) พริกไทย : พริกป่น    <br>2) ไข่ต้ม : ไข่เจียว    <br>3) แกงจืด : แกงเผ็ด   <br>4) น้ำตาล : ขนม   <br>",
 answer:  "1) พริกไทย : พริกป่น  <br>รสเหมือนกัน คือ เผ็ดร้อน<br><br>น้ำตาล : ขนม ยังไม่ถูกเพราะ น้ำตาลมีรสหวาน แต่ขนมไม่หวานเสมอไป  เช่น ขนมกรุบกรอบ เมล็ดทานตะวันอบเกลือ เป็นต้น<br>"},

{id:"25650101_RN9971_00_metaphor_Sheet2565_09", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ทายาท : มรดก   :: ? : ?<hr>1) ศิษย์ : วิชา    <br>2) เจ้าหนี้ : เงินกู้     <br>3) นายหน้า : ที่ดิน   <br>4) ผู้รับ : ผู้ให้    <br>",
 answer:  "1) ศิษย์ : วิชา   <br><br>ทายาท ได้รับ มรดก (จากผู้ให้)<br>ศิษย์  ได้รับ วิชา (จากผู้ให้)<br>"},

{id:"25650101_RN1908_00_metaphor_Sheet2565_10", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>โศกเศร้า : เบิกบาน :: คดโกง  : ?<hr>1)  ฉ้อโกง   <br>2) ซื่อสัตย์     <br>3) คนดี    <br>4)  หักหลัง   <br>",
 answer:  "2) ซื่อสัตย์   <br><br>คำตรงข้าม<br>"},

{id:"25650101_RN4476_00_metaphor_Sheet2565_11", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ดอกไม้ : หอม  :: ? : ?<hr>1) หิน : แข็ง    <br>2) อร่อย : อาหาร    <br>3) ส่อง : กระจก   <br>4) ขวด : แจกัน   <br>",
 answer:  "1) หิน : แข็ง   <br><br> คำนาม : คำคุณศัพท์ บอกลักษณะ<br>"},

{id:"25650101_RN9269_00_metaphor_Sheet2565_12", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ตารางเมตร : เซนติเมตร  :: ? : ?<hr>1) งาน : วา    <br>2) กิโลกรัม : กิโลเมตร    <br>3) เซนติเมตร : นิ้ว   <br>4) ศอก : หลา   <br>",
 answer:  "1) งาน : วา   <br><br>หน่วยพื้นที่ : หน่วยการวัด<br>"},

{id:"25650101_RN7470_00_metaphor_Sheet2565_13", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ครู : โรงเรียน :: พยาบาล :  ?<hr>1) ห้องฉุกเฉิน    <br>2) โรงพยาบาล    <br>3) หมอ   <br>4) รถพยาบาล   <br>",
 answer:  "2) โรงพยาบาล  <br><br>ครู ทำงานที่ โรงเรียน<br>พยาบาล ทำงานที่ โรงพยาบาล<br>"},

{id:"25650101_RN9484_00_metaphor_Sheet2565_14", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>แม่น้ำ : คันนา  :: ? : ?<br><hr>1)  ภูเขา : บ้าน    <br>2)   ท้องฟ้า : ก้อนเมฆ   <br>3)  เขื่อน : ทะเล   <br>4) ถนน : รถยนต์    <br>",
 answer:  "1)  ภูเขา : บ้าน   <br><br>ธรรมชาติสร้าง : มนุษย์สร้าง <br>"},

{id:"25650101_RN5907_00_metaphor_Sheet2565_15", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>แมลงวัน : อหิวาตกโรค :: ยุงก้นปล่อง : ?<hr>1) มาลาเรีย    <br>2) ไข้้เลือดออก    <br>3) โรคเท้าช้าง   <br>4) กาฬโรค   <br>",
 answer:  "1) มาลาเรีย<br><br>แมลงวัน เป็นพาหะนำโรค อหิวาตกโรค<br>ยุงก้นปล่อง เป็นพาหะนำโรค มาลาเรีย<br>"},

{id:"25650101_RN9714_00_metaphor_Sheet2565_16", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เรือนจํา : ห้องขัง  :: ? : ?<hr>1)  ตํารวจ : ผู้ร้าย   <br>2)  ชานชาลา : รถไฟ   <br>3)  โรงแรม : ห้องพัก  <br>4)  บ้าน : ที่นอน  <br>",
 answer:  "3)  โรงแรม : ห้องพัก  <br><br>เรือนจํา เป็นอาคาร ภายในมีห้อง ห้องขัง<br>โรงแรม เป็นอาคาร ภายในมีห้อง ห้องพัก<br>"},

{id:"25650101_RN7601_00_metaphor_Sheet2565_17", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>แหวน : นิ้ว  :: ? : ?<hr>1) เสื้อ : สวม    <br>2) เท้า : ถุงเท้า    <br>3) ผ้ากันเปื้อน : เด็ก   <br>4) เข็มขัด : เอว   <br>",
 answer:  "4) เข็มขัด : เอว    <br><br>แหวน รอบ นิ้ว<br>เข็มขัด รอบ เอว<br>"},

{id:"25660430_RN9076_00_metaphor_web_18", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้าวเกรียบ : ปาท่องโก๋ :: ??? : ???<hr>1) เค้ก : สปาเก็ตตี้    <br>2) หมูปิ้ง : ขนมจีบ    <br>3) ซาลาเปา : โดนัท   <br>4) น้ำเต้าหู้ : กล้วยบวชชี   <br>",
 answer:  "4) น้ำเต้าหู้ : กล้วยบวชชี    <br><br>วิธีการปรุง<br>ข้าวเกรียบ และ ปาท่องโก๋ ใช้การทอด<br>น้ำเต้าหู้ และ กล้วยบวชชี ใช้การต้ม<br>"},

{id:"25660430_RN6793_00_metaphor_web_19", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พี่ : น้อง :: ??? : ???<hr>1) พ่อ : แม่    <br>2) ลุง : อา    <br>3) น้าเขย : น้ำสะใภ้   <br>4) ฉัน: เธอ   <br>",
 answer:  "ลุง : อา   <br><br>อายุ มากกว่า - น้อยกว่า<br>พี่ อายุมากกว่า น้อง<br>ลุง อายุมากกว่า อา<br>"},

{id:"25660430_RN2360_00_metaphor_web_20", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>บ้าน : คน :: ??? : ???<hr>1) ตู้ : ปลา    <br>2) รัง : ผึ้ง    <br>3) ท่อน้ำ : หนู   <br>4) ต้นไม้: นก   <br>",
 answer:  "รัง : ผึ้ง   <br><br>คน สร้างบ้าน เป็นที่อยู่อาศัย<br>ผึ้ง สร้างรัง เป็นที่อยู่อาศัย<br>"},

{id:"25660430_RN2468_00_metaphor_web_22", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ขย่อน : กระชั้น :: ??? : ???<hr>1) เร็ว : วิ่ง    <br>2) ยิ่งใหญ่ : โอ่โถง    <br>3) แข็ง : ยาก   <br>4) เขมือบ : กิน   <br>",
 answer:  "เขมือบ : กิน   <br><br>ความหมายคล้าย/เหมือนกัน<br><br>ขย่อน = [ขะหฺย่อน] ว. กระชั้น เช่น ครั้นไก่ขันขย่อนค่อนคืน (มณีพิชัย).<br>เขมือบ กิน = กินอย่างตะกละ<br>"},

{id:"25660501_RN4413_00_metaphor_web_21", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้าวโพด : ปาล์ม :: ??? : ???<hr>1) น้ำตาล : เกลือ    <br>2) หมาก : พลู    <br>3) ยางพารา : น้ำมัน   <br>4) งา : มะพร้าว   <br>",
 answer:  "งา : มะพร้าว   <br><br>ลักษณะคล้ายกัน คือ เป็นฝัก - เป็นต้นไม้<br><br><img style='display: block;  margin-left: auto;  margin-right: auto;  width:100%; max-width:400px;' src='images/sesame-corn.png'>"},

{id:"25660430_RN5299_00_metaphor_web_23", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ท่าเรือ : เรือ :: ??? : ???<hr>1) เครื่องบิน : สนามบิน    <br>2) ชานชาลา : รถไฟ    <br>3) โรงแรม : นักท่องเที่ยว   <br>4) ทางเท้า : คนเดิน   <br>",
 answer:  "ชานชาลา : รถไฟ   <br><br>สถานที่จอด : ยานพาหนะ<br><br>"},

{id:"25650702_RN8489_00_metaphor_web_25", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เกาเหลา : เส้น :: ??? : ???<hr>1) ข้าวสาร : ข้าวเปลือก    <br>2) น้ำพริก : ผักต้ม    <br>3) ปลาดุก : เกล็ด  <br>4) ข้าวเหนียว : มะม่วง   <br>",
 answer:  "ปลาดุก : เกล็ด  <br><br>เกาเหลา ไม่มี เส้น<br>ปลาดุก ไม่มี เกล็ด<br>"},

{id:"25650702_RN9107_00_metaphor_web_24", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ซื่อสัตย์ : สุจริต :: ??? : ???<hr>1) เชือก : ด้าย    <br>2) ขี้เกียจ : ขยัน    <br>3) สุริยา : พระอาทิตย์  <br>4) ฤดูหนาว : คิมหันต์   <br>",
 answer:  "สุริยา : พระอาทิตย์   <br><br>ความหมายเหมือนกัน<br>คิมหันต์ คือ ฤดูร้อน<br>"},

{id:"25650702_RN6446_00_metaphor_web_25", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เข็นครกขึ้นภูเขา : ฝนทั่งให้เป็นเข็ม :: ??? : ???<hr>1) ขมิ้นกับปูน : ขนมผสมน้ำยา    <br>2) เกลือจิ้มเกลือ : มัดมือชก    <br>3) ตำน้ำพริกละลายแม่น้ำ : ขี่ช้างจับตั๊กแตน  <br>4) งมเข็มในมหาสมุทร : จับปลาสองมือ  <br>",
 answer:  "ตำน้ำพริกละลายแม่น้ำ : ขี่ช้างจับตั๊กแตน  <br><br>เข็นครกขึ้นภูเขา : ฝนทั่งให้เป็นเข็ม <br>งานยาก : งานยาก<br><br>ตำน้ำพริกละลายแม่น้ำ : ขี่ช้างจับตั๊กแตน<br>ลงทุนมากเกินความจำเป็น แต่ได้ผลน้อย<br>"},

{id:"25650702_RN3621_00_metaphor_web_26", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>อุทาน : ตกใจ :: ??? : ???<hr>1) เบื่อ : บ่น    <br>2) ใจลอย : เพ้อ    <br>3) ตะลึง : ตื่นเต้น  <br>4) โกรธ : ร้องไห้  <br>",
 answer:  " ตะลึง : ตื่นเต้น   <br><br>อุทาน เกิดจาก ตกใจ<br>ตะลึง เกิดจาก ตื่นเต้น<br><br>"},

{id:"25650703_RN2565_00_metaphor_web_27", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ส้ม : เงาะ :: ??? : ???<hr>1) ลำไย : ละมุด    <br>2) มะปราง : มะม่วง    <br>3) ลองกอง : ลิ้นจี่  <br>4) มะละกอ : น้อยหน่า <br>",
 answer:  "ลองกอง : ลิ้นจี่   <br><br>ผลไม้ มีเปลือก ลักษณะเมล็ด เหมือนกัน<br>"},

 ]


var numOfQuestions = metaphor_dat.length;

