//var isPremiumVersion = "false";    // ถ้าใช้บน PC เพราะเรียกจาก Android  ไม่ได้ ค่าที่ส่งเข้ามา คือ  true  หรือ  false
 //var isPremiumVersion = Android.getIsFullVersion(); // เรียก method จาก android class ชื่อ JavaScriptInterface    ค่าที่ส่งเข้ามา คือ  true  หรือ  false

// วันนี้เรียนรู้อีกอย่าง เรื่องการรับส่งข้อมูลระหว่าง flutter - javascript
// ประเด็นคือ ต้องอยู่ใน JavascriptChannel เดียวกัน เช่น ไฟล์นี้ full_exam.js
// ส่งข้อมูลไปทาง MessageHandler ก็ต้องสร้างฟังก์ชัน isBuyAndMode เพื่อรับข้อมูล
// จะไปสร้าง is_IsNewClicked เพื่อรับข้อมูลไม่ได้ เพราะอยู่คนละ Channel กัน
// หาอยู่ตั้งนานว่า ผิดตรงไหน เพราะ flutter ไม่บอกว่ามี error เพียงแต่ไม่มีค่าตัวแปรที่ส่งมาให้

var isPremiumVersion;
var correct_qstns = [];
var not_correct = [];
var skipped_qstns = [];
var message;
var count;
var hour=0;
var min=0;
var sec=0;
var myVar = 0;  // for timer setInterval
var is_Bought;
var current_page = 1;
var records_per_page = 1;
var thisJson = [];
var alreadyShuffled = false;
var myJason_shuffled = [];
var firstQuestion ="";






document.addEventListener('swiped', function(e) {
    console.log(e.target); // the element that was swiped
    console.log(e.detail.dir); // swiped direction
});

document.addEventListener('swiped-left', function(e) {
  //  console.log(e.target); // the element that was swiped
	//alert('swiped left!')
	if (current_page < numPages()) {
	nextPage();
	}
});

document.addEventListener('swiped-right', function(e) {
   // console.log(e.target); // the element that was swiped
	//alert('swiped right!')
	if(current_page > 1){
	prevPage();
	}
});
//
//var clicks = 0;
//var timer, timeout = 350; // time between each click
//
var doubleClick = function(e) {
  console.log('doubleClick!!');
  console.log('doubleClick!!' + e.target);
  goToPage('start', thisJson);
}

var tripleClick = function(e) {
  console.log('tripleClick!!');
  goToPage('end', thisJson);
}

TOUCH_TIMEOUT_MILLISECONDS = 500;
touch_count = 0;

window.document.querySelector('body').addEventListener('touchstart', function(evt){
    touch_count += 1;

    setTimeout(function(){
    touch_count=0
    }, TOUCH_TIMEOUT_MILLISECONDS);
    if(touch_count==2) doubleClick(evt);
    if(touch_count==3) tripleClick(evt);
evt.preventDefault();
});

// on page load





//// click timer
//document.querySelector('body').addEventListener('touchend', function(e) {
//  clearTimeout(timer);
//  clicks++;
//  var evt = e;
//  timer = setTimeout(function() {
//    if(clicks==2) doubleClick(evt);
//    if(clicks==3) tripleClick(evt);
//    clicks = 0;
//  }, timeout);
//});

// swiped-up down มันยุ่งกับ เลื่อนหน้าจอ ขึ้นลง เลยคิดว่า เอาออกดีกว่า

//
//document.addEventListener('swiped-up', function(e) {
//   // console.log(e.target); // the element that was swiped
//	//alert('swiped right!')
//	//if(current_page > 1){
//	//prevPage();
//	//}
//		goToPage('end', thisJson);
//});
//
//document.addEventListener('swiped-down', function(e) {
//   // console.log(e.target); // the element that was swiped
//	//alert('swiped right!')
////	if(current_page > 1){
//	//prevPage();
//	//}
//		goToPage('start', thisJson);
//});

var objJsonSimplexx = [
{number:"111_simple", answer: "111xx"},
{number:"222", answer: "222xx"},
{number:"333", answer: "333xx"},
{number:"444", answer: "xxx"},
]


var principles_of_good_govt = [
{"id" : "1", "question" : "การปฏิบัติตาม พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ให้เป็นไปตามที่คณะรัฐมนตรีกําหนดตามข้อเสนอแนะของ หน่วยงานใด", "answer" : "ก.พ.ร. (มาตรา ๓)"},
{"id" : "2", "question" : "ส่วนราชการ ตาม พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ไม่ให้หมายความรวมถึงหน่วยงานใด", "answer" : "องค์กรปกครองส่วนท้องถิ่น (มาตรา ๔)"},
{"id" : "3", "question" : "พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี  ได้บัญญัติให้การบริหารราชการและแนวทางปฏิบัติราชการจะต้องมีเป้าหมาย กี่ประการ อะไรบ้าง", "answer" : "มีเป้าหมาย 7 ประการ คือ<br>1) เกิดประโยชน์สุขของประชาชน<br>2) เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ<br>3) มีประสิทธิภาพและเกิดความคุ้มค่าในเชิงภารกิจของรัฐ<br>4) ไม่มีขั้นตอนการปฏิบัติงานเกินความจำเป็น<br>5) มีการปรับปรุงภารกิจของส่วนราชการให้ทันต่อเหตุการณ์<br>6) ประชาชนได้รับการอำนวยความสะดวก และได้รับการตอบสนองความ<br>7) มีการประเมินผลการปฏิบัติงานอย่างสม่ำเสมอ (มาตรา ๖) "},
{"id" : "11", "question" : "พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี กำหนดให้มีการประเมินผลการปฏิบัติราชการอย่างไร", "answer" : "อย่างสม่ำเสมอ (มาตรา ๖)"},
{"id" : "12", "question" : "ผู้ใด เป็นผู้รักษาการ พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ", "answer" : "นายกรัฐมนตรี (มาตรา ๕)"},
{"id" : "13", "question" : "การบริหารราชการ เพื่อให้เกิดประโยชน์สูงสุดของประเทศ เป็นเป้าหมายในด้านใด ของ พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ", "answer" : " เกิดประโยชน์สุขของประชาชน (มาตรา ๗)"},
{"id" : "14", "question" : "หลักยึดในการบริหารราชการเพื่อประโยชน์สุขของประชาชน คืออะไร", "answer" : "ถือว่าประชาชนเป็นศูนย์กลางที่จะได้รับการบริการจากรัฐ (มาตรา ๘)"},
{"id" : "15", "question" : "การกำหนดภารกิจของรัฐ และส่วนราชการมีหลักเกณฑ์อย่างไร", "answer" : "ต้องเป็นไปเพื่อวัตถุประสงค์ทั้ง ๗ ประการ ตลอดจนสอดคล้องกับแนวนโยบายแห่งรัฐ และนโยบายของคณะรัฐมนตรี ที่แถลงต่อรัฐสภา (มาตรา ๘)"},
{"id" : "16", "question" : "การปฏิบัติภารกิจของส่วนราชการ มีขั้นตอนและแนวปฏิบัติอย่างไร", "answer" : "<ol><li>ก่อนดำเนินภารกิจ ต้องวิเคราะห์ผลดีและผลเสียให้ครบถ้วน ทุกด้าน</li><li>กำหนดขั้นตอนการดำเนินการที่โปร่งใส มีกลไกตรวจสอบการดำเนินการ ในแต่ละขั้นตอน </li><li>ถ้าภารกิจใดจะมีผลกระทบต่อประชาชน  ต้องดำเนินการรับฟังความคิดเห็นของ ประชาชน หรือชี้แจงทำความเข้าใจ เพื่อให้ประชาชนได้ตระหนักถึงประโยชน์ ที่ส่วนรวมจะได้รับจากภารกิจนั้น </li></ol> (มาตรา ๘)"},
{"id" : "17", "question" : "ก่อนจะดำเนินการตามภารกิจของส่วนราชการ ส่วนราชการต้องทำอย่างไร", "answer" : "ส่วนราชการจัดทำแผนปฏิบัติราชการ ไว้เป็นการล่วงหน้า  (มาตรา๙)"},
{"id" : "18", "question" : "แผนปฏิบัติราชการ ของส่วนราชการ ประกอบด้วยส่วนต่าง ๆ อะไรบ้าง", "answer" : "<ol><li>รายละเอียดของขั้นตอน </li><li>ระยะเวลา </li><li>งบประมาณ  </li><li>เป้าหมายของภารกิจ </li><li>ผลสัมฤทธิ์ ของภารกิจ และ</li><li>ตัวชี้วัดความสำเร็จของภารกิจ</li></ol> (มาตรา๙)"},
{"id" : "19", "question" : "การติดตาม และประเมินผลการปฏิบัติตามแผนปฏิบัติราชการ ต้องสอดคล้องกับมาตรฐานซึ่งกำหนดโดยหน่วยงานใด", "answer" : "ก.พ.ร.  (มาตรา๙)"},
{"id" : "20", "question" : "ในกรณีที่การปฏิบัติตามแผนปฏิบัติราชการ เกิดผลกระทบต่อ ประชาชน ส่วนราชการต้องทำอะไรบ้าง", "answer" : "ส่วนราชการต้องดำเนินการแก้ไข หรือบรรเทาผลกระทบนั้น หรือเปลี่ยนแผนปฏิบัติราชการ ให้เหมาะสม  (มาตรา๙)"},
{"id" : "21", "question" : "เป้าหมายของการบริหารราชการแบบบูรณาการ คืออะไร", "answer" : "มุ่งให้เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ (มาตรา ๑๐)"},
{"id" : "22", "question" : "ส่วนราชการที่มีลักษณะเป็นองค์การแห่งการเรียนรู้ คือส่วนราชการที่มีลักษณะเช่นใด", "answer" : "เป็นส่วนราชการที่รับรู้ข้อมูลข่าวสาร และประมวลผลความรู้ เพื่อนำมาใช้ในการปฏิบัติราชการ ได้อย่างถูกต้อง รวดเร็ว และเหมาะสมกับสถานการณ์ รวมทั้ง ส่งเสริม และพัฒนาความรู้ความสามารถ สร้างวิสัยทัศน์ และปรับเปลี่ยนทัศนคติ ของข้าราชการในสังกัด ให้เป็นบุคลากรที่มีประสิทธิภาพ และมีการเรียนรู้ร่วมกัน (มาตรา ๑๑)"},
{"id" : "23", "question" : "แผนปฏิบัติราชการของส่วนราช เป็นแผนกี่ปี", "answer" : "5 ปี (มาตรา ๑๖)"},
{"id" : "24", "question" : "แผนปฏิบัติราชการของส่วนราชการ ต้องมีความสอดคล้องกับสิ่งใด", "answer" : "<ol><li>ยุทธศาสตร์ชาติ </li><li>แผนแม่บท </li><li>แผนการปฏิรูปประเทศ </li><li>แผนพัฒนาเศรษฐกิจและ สังคมแห่งชาติ </li><li>นโยบายของคณะรัฐมนตรีที่แถลงต่อรัฐสภา และ</li><li>แผนอื่นที่เกี่ยวข้อง</li></ol>(มาตรา ๑๖)"},
{"id" : "25", "question" : "หน่วยงานใด เป็นผู้พัฒนา แพลตฟอร์มดิจิทัลกลาง", "answer" : "สำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน) (มาตรา ๑๖)"},
{"id" : "26", "question" : "แพลตฟอร์มดิจิทัลกลาง มีจุดประสงค์เพื่ออะไร", "answer" : "เพื่อให้ส่วนราชการใช้ในการบริการประชาชน และการติดต่อประสานงานระหว่างส่วนราชการด้วยกันเอง  (มาตรา ๑๖)"},
{"id" : "27", "question" : "สาระสำคัญของแผนปฏิบัติราชการประจำปี ประกอบด้วยอะไรบ้าง", "answer" : "นโยบายการปฏิบัติราชการของส่วนราชการ เป้าหมาย และผลสัมฤทธิ์ของงาน รวมทั้งประมาณการ รายได้และรายจ่าย และทรัพยากรอื่นที่จะต้องใช้ "},
{"id" : "28", "question" : "แผนปฏิบัติราชการประจำปี ต้องได้รับความเห็นชอบจากผู้ใด", "answer" : "รัฐมนตรี  (มาตรา ๑๖)"},
{"id" : "29", "question" : "ถ้าแผนปฏิบัติราชการประจำปี ไม่ได้รับความเห็นชอบจากรัฐมนตรี หรือไม่ได้นำเสนอต่อรัฐมนตรี จะเกิดผลเช่นใด", "answer" : "ไม่ได้รับการจัดสรรงบประมาณเพื่อดำเนินการภารกิจนั้น จากสำนักงบประมาณ (มาตรา ๑๖)"},
{"id" : "30", "question" : "เมื่อสิ้นปีงบประมาณ ให้ส่วนราชการจัดทำรายงาน แสดงผลสัมฤทธิ์ของแผนปฏิบัติราชการประจำปี เสนอต่อผู้ใด", "answer" : "คณะรัฐมนตรี (มาตรา ๑๖)"},
{"id" : "31", "question" : "เมื่อมีการกำหนดงบประมาณรายจ่ายประจำปี ตามแผนปฏิบัติราชการของ ส่วนราชการใดแล้ว ส่วนราชการสามารถ โอนงบประมาณจากภารกิจหนึ่งตาม ที่กำหนดในแผนปฏิบัติราชการ ไปดำเนินการอย่างอื่น ซึ่งมีผลทำให้ภารกิจเดิมไม่บรรลุเป้าหมาย หรือนำไปใช้ในภารกิจใหม่ ที่มิได้กำหนดในแผนปฏิบัติราชการ ได้หรือไม่", "answer" : "ไม่ได้ นอกจากจะได้รับอนุมัติ จากคณะรัฐมนตรี ให้ปรับแผนปฏิบัติราชการ ให้สอดคล้องกันแล้ว <br>การปรับแผนปฏิบัติราชการ จะกระทำได้เฉพาะในกรณีที่ งานหรือภารกิจใด ไม่อาจ ดำเนินการตามวัตถุประสงค์ต่อไปได้ หรือหมดความจำเป็น หรือไม่เป็นประโยชน์ หรือหากดำเนินการ ต่อไปจะต้องเสียค่าใช้จ่าย เกินความจำเป็น หรือมีความจำเป็นอย่างอื่น อันไม่อาจหลีกเลี่ยงได้ ที่จะต้อง เปลี่ยนแปลงสาระสำคัญของแผนปฏิบัติราชการ (มาตรา ๑๘)"},
{"id" : "33", "question" : "เมื่อนายกรัฐมนตรี พ้นจากดำแหน่ง หัวหน้าส่วนราชการจะต้องทำภารกิจใด", "answer" : "สรุปผลการปฏิบัติราชการ และให้ข้อมูลต่อนายกรัฐมนตรีคนใหม่ เพื่อใช้เป็นข้อมูล ในการพิจารณากำหนดนโยบาย การบริหารราชการแผ่นดินต่อไป <br>(มาตรา ๑๙ )"},
{"id" : "34", "question" : "\"การกำหนดเป้าหมาย แผนการทำงาน ระยะเวลาแล้วเสร็จของงานหรือโครงการ และงบประมาณ ที่จะต้องใช้ในแต่ละงาน พร้อมทั้งเผยแพร่ ให้ข้าราชการและประชาชนทราบทั่วกัน\" เป็นการกระทำเพื่อบรรลุเป้าหมายใด ตาม พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ", "answer" : "การบริหารราชการอย่างมีประสิทธิภาพ และเกิดความคุ้มค่าในเชิงภารกิจของรัฐ (มาตรา ๒๐)"},
{"id" : "35", "question" : "\"การจัดทำบัญชีต้นทุน\" เป็นการกระทำเพื่อบรรลุเป้าหมายใด ตาม พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ", "answer" : "การบริหารราชการอย่างมีประสิทธิภาพ และเกิดความคุ้มค่าในเชิงภารกิจของรัฐ (มาตรา ๒๑)"},
{"id" : "36", "question" : "หน่วยงานใดเป็นผู้หลักเกณฑ์ และวิธีการการจัดทำบัญชีต้นทุน", "answer" : "กรมบัญชีกลางกำหนด  (มาตรา ๒๑)"},
{"id" : "37", "question" : "ส่วนราชการต้องคำนวณรายจ่ายต่อหน่วย ของงานบริการสาธารณะ ที่อยู่ในความรับผิดชอบของ และรายงานให้หน่วยงานใด กี่หน่วยงาน หน่วยงานใดบ้าง", "answer" : "3 หน่วยงาน ได้แก่ สำนักงบประมาณ กรมบัญชีกลาง และ ก.พ.ร. (มาตรา ๒๑)"},
{"id" : "38", "question" : "หน่วยราชการ ต้องจัดทำ \"แผนการลดรายจ่าย\" ในกรณีใด", "answer" : "ในกรณีที่ รายจ่ายต่อหน่วยของงานบริการสาธารณะใด ของส่วนราชการนั้น สูงกว่ารายจ่ายต่อหน่วย ของงานบริการสาธารณะ ประเภทและคุณภาพเดียวกัน หรือคล้ายคลึงกันของส่วนราชการอื่น (มาตรา ๒๑)"},
{"id" : "39", "question" : "ในกรณีที่หน่วยราชการ จัดทำแผนการลดรายจ่าย เสนอสำนักงบประมาณ กรมบัญชีกลาง และ ก.พ.ร. แล้ว ถ้ามิได้มีข้อทักท้วงประการใด ภายในกี่วัน ส่วนราชการดังกล่าว จึงจะถือปฏิบัติ ตามแผนการลดรายจ่ายนั้นได้", "answer" : "15 วัน  (มาตรา ๒๑)<br>ข้อสังเกต<br>ใน พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ถ้าถามจำนวนวัน ให้ตอบว่า 15 วัน<br>ยกเว้นเพียงเรื่องเดียวคือ การกำหนดให้สำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน) จัดให้มี แพลตฟอร์มดิจิทัลกลาง ซึ่งกำหนดไว้ว่า ต้องจัดให้มีภายใน 90 วัน "},
{"id" : "40", "question" : "หน่วยงานใด มีหน้าที่จัดให้มีการประเมินความคุ้มค่า ในการปฏิบัติภารกิจของรัฐ ของส่วนราชการต่าง ๆ", "answer" : "เป็นการจัดร่วมกัน ของสำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ และสำนักงบประมาณ (มาตรา ๒๒) "},
{"id" : "41", "question" : "การประเมินความคุ้มค่า ซึ่งร่วมจัดโดย สำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ และสำนักงบประมาณ คำนึงถึงเรื่องใดบ้าง", "answer" : "<ul><li>ประเภท และสภาพของแต่ละภารกิจ </li><li>ความเป็นไปได้ของภารกิจ หรือโครงการที่ดำเนินการ</li><li>ประโยชน์ที่รัฐและประชาชนจะพึงได้ และรายจ่ายที่ต้อง เสียไปก่อนและหลังที่ส่วนราชการ ดำเนินการ</li></ul> (มาตรา ๒๒) "},
{"id" : "42", "question" : "ความคุ้มค่าตามมาตรา 22 ของ พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี หมายความถึงอะไร", "answer" : "ประโยชน์หรือผลเสียทางสังคม และประโยชน์ หรือผลเสียอื่น ซึ่งไม่อาจคำนวณเป็นตัวเงินได้ด้วย  (มาตรา ๒๒) "},
{"id" : "43", "question" : "ในการจัดซื้อ-จัดจ้าง ส่วนราชการต้องดำเนินการอย่างไร", "answer" : "ต้องดำเนินการโดยเปิดเผยและเที่ยงธรรม โดยพิจารณาถึง<ul><li>ประโยชน์ และผลเสียทางสังคม </li><li>ภาระต่อประชาชน </li><li>คุณภาพ </li><li>วัตถุประสงค์ที่จะใช้ </li><li>ราคา และประโยชน์ระยะยาว</li></ol> (มาตรา ๒๓) "},
{"id" : "44", "question" : " ในการจัดซื้อหรือจัดจ้าง ส่วนราชการจำเป็นต้องถือราคาตํ่าสุดในการเสนอซื้อ หรือจ้าง เสมอไปหรือไม่ เพราะเหตุใด", "answer" : " ไม่จำเป็น ในกรณีที่วัตถุประสงค์ในการใช้ เป็นเหตุให้ต้องคำนึงถึงคุณภาพ และการดูแลรักษาเป็นสำคัญ ให้สามารถกระทำได้ โดยไม่ต้องถือราคาตํ่าสุดในการเสนอซื้อ หรือจ้างเสมอไป (มาตรา ๒๓)"},
{"id" : "45", "question" : "ในกรณีที่ส่วนราชการ จำเป็นต้องได้รับอนุญาต อนุมัติ หรือ ความเห็นชอบจากส่วนราชการอื่น ในการปฏิบัติภารกิจอย่างใดอย่างหนึ่ง ส่วนราชการที่มีอำนาจ อนุญาต อนุมัติ หรือให้ความเห็นชอบดังกล่าว ต้องแจ้งผล การพิจารณาให้ส่วนราชการ ที่ยื่นคำขอทราบภายในกี่วัน ", "answer" : "15 วัน (มาตรา ๒๔)"},
{"id" : "46", "question" : "ในกรณีที่เรื่องใดมีกฎหมาย กฎ ระเบียบ ข้อบังคับ ประกาศ หรือมติคณะรัฐมนตรี กำหนดขั้นตอนการปฏิบัติไว้ และขั้นตอนการปฏิบัตินั้น ต้องใช้ระยะเวลาเกินสิบห้าวัน ส่วนราชการที่มีอำนาจ อนุญาต อนุมัติ หรือให้ความเห็นชอบ ต้องดำเนินการอย่างไร", "answer" : "ประกาศกำหนดระยะเวลาการพิจารณา ไว้ให้ส่วนราชการอื่นทราบ (มาตรา ๒๔)"},
{"id" : "47", "question" : "ส่วนราชการใด ที่มีอำนาจ อนุญาต อนุมัติ หรือให้ความเห็นชอบ มิได้ดำเนินการให้แล้วเสร็จ ภายใน 15 หรือตามกำหนดที่ประกาศไว้ หากเกิดความเสียหายใดขึ้น จะเกิดผลประการใด", "answer" : "ให้ถือว่าข้าราชการซึ่งมีหน้าที่เกี่ยวข้อง และ หัวหน้าส่วนราชการนั้น ประมาทเลินเล่ออย่างร้ายแรง เว้นแต่จะพิสูจน์ได้ว่า ความล่าช้านั้นมิได้เกิดขึ้น จากความผิดของตน (มาตรา ๒๔)"},
{"id" : "48", "question" : "ในการพิจารณาวินิจฉัยชี้ขาดปัญหาใด ๆ พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ได้กำหนดแนวทางไว้อย่างไร", "answer" : "<ol><li>ให้เป็นหน้าที่ของส่วนราชการที่รับผิดชอบในปัญหานั้นๆ จะต้องพิจารณาวินิจฉัยชี้ขาดโดยเร็ว </li><li>การตั้งคณะกรรมการขึ้นพิจารณาวินิจฉัย ให้ดำเนินการได้ เท่าที่จำเป็น อันไม่อาจหลีกเลี่ยงได้ </li></ol>(มาตรา ๒๕)"},
{"id" : "49", "question" : "ผู้บังคับบัญชา สามารถสั่งราชการด้วยวาจา หรือไม่", "answer" : "สามารถกระทำได้ ในกรณีที่ผู้บังคับบัญชา มีความจำเป็นที่ไม่อาจสั่งเป็นลายลักษณ์อักษรในขณะนั้น (มาตรา ๒๖)"},
{"id" : "50", "question" : "การกระจายอำนาจ การตัดสินใจเกี่ยวกับ การสั่ง การอนุญาต การอนุมัติ การปฏิบัติราชการ หรือการดำเนินการอื่นใด ของผู้ดำรงตำแหน่งใด ให้แก่ผู้ดำรงตำแหน่งที่มี หน้าที่รับผิดชอบ มีหลักการดำเนินการอย่างไร", "answer" : " ต้องมุ่งผล ให้เกิดความสะดวก และรวดเร็ว ในการบริการประชาชน (มาตรา ๒๗)"},
{"id" : "51", "question" : "การนำเทคโนโลยีสารสนเทศ หรือโทรคมนาคม มาใช้ในการปฏิบัติงาน เพื่อลดขั้นตอนการทำงาน สามารถกระทำได้หรือไม่", "answer" : "สามารถทำได้ ตามความเหมาะสมและกำลังเงินงบประมาณ ของส่วนราชการ เพื่อลดขั้นตอน เพิ่มประสิทธิภาพ และประหยัดค่าใช้จ่าย รวมทั้งไม่เกิดผลเสียหายแก่ราชการ (มาตรา ๒๗)"},
{"id" : "52", "question" : "ในการให้บริการประชาชน ส่วนราชการ นอกจากต้องกระทำโดยใช้ แพลตฟอร์มดิจิทัลกลางที่สำนักงานพัฒนารัฐบาลดิจิทัล กำหนดแล้ว ยังต้องดำเนินการอื่น อย่างไรบ้าง", "answer" : "ต้องจัดทำแผนภูมิ ขั้นตอนและระยะเวลาการดำเนินการ รวมทั้งรายละเอียดอื่น ๆ ที่เกี่ยวข้องในแต่ละขั้นตอน เปิดเผยไว้ ณ ที่ทำการของส่วนราชการ และในระบบเครือข่ายสารสนเทศ ของส่วนราชการ (มาตรา ๒๙)"},
{"id" : "53", "question" : "ศูนย์บริการร่วม ของส่วนราชการ มีจุดประสงค์เพื่อการใด", "answer" : " เพื่ออำนวยความ สะดวกแก่ประชาชน สามารถติดต่อ สอบถาม ขออนุญาต หรือขออนุมัติในเรื่องใด ๆ โดยติดต่อเจ้าหน้าที่ ณ ศูนย์บริการร่วมเพียงแห่งเดียว (มาตรา ๓๐)"},
{"id" : "54", "question" : "ในกระทรวงหนึ่ง ให้เป็นหน้าที่ของผู้ใด  ที่จะต้องจัดให้ส่วนราชการภายในกระทรวง จัดตั้งศูนย์บริการร่วม ", "answer" : "ปลัดกระทรวง (มาตรา ๓๐)"},
{"id" : "55", "question" : "ในกรณีที่ประชาชนมามาติดต่อขอใช้บริการของศูนย์บริการร่วมเป็นครั้งแรก เจ้าหน้าที่ของศูนย์บริการ ต้องดำเนินการอย่างไร", "answer" : "ตรวจสอบว่า เอกสารหลักฐานครบถ้วนหรือไม่ พร้อมทั้งแจ้ง ให้ทราบถึงระยะเวลา ที่จะต้องใช้ดำเนินการในเรื่องนั้น (มาตรา ๓๑)"},
{"id" : "56", "question" : " ในอำเภอหนึ่ง ให้เป็นหน้าที่ของผู้ใด  ที่จะต้องจัดให้ส่วนราชการภายในอำเภอ จัดตั้งศูนย์บริการร่วม ", "answer" : "นายอำเภอ (มาตรา ๓๒)"},
{"id" : "57", "question" : "หลักเกณฑ์ในการพิจารณา ทบทวนภารกิจ ว่าภารกิจใด มีความจำเป็น หรือ สมควรที่จะยกเลิก ปรับปรุง หรือเปลี่ยนแปลงการดำเนินการต่อไปหรือไม่ จะต้องคำนึงถึงเรื่องใดบ้าง", "answer" : "<ul><li>ยุทธศาสตร์ชาติ </li><li>แผนแม่บท </li><li>แผนการปฏิรูปประเทศ </li><li>แผนพัฒนาเศรษฐกิจและสังคมแห่งชาติ </li><li>นโยบายของคณะรัฐมนตรี ที่แถลงต่อรัฐสภา และแผนอื่นที่เกี่ยวข้อง </li><li>กำลังเงินงบประมาณของประเทศ</li><li>ความคุ้มค่าของภารกิจ</li><li>สถานการณ์อื่น </li></ul>(มาตรา ๓๓)"},
{"id" : "58", "question" : "หน่วยงานใด มีหน้าที่ในการพิจารณา ภารกิจของส่วนราชการว่า ภารกิจใดสมควรเปลี่ยนแปลง ยกเลิก หรือเพิ่มเติม และเสนอคณะรัฐมนตรี เพื่อพิจารณา", "answer" : " ก.พ.ร. (มาตรา ๓๓)"},
{"id" : "59", "question" : "ในกรณีที่มีการยุบเลิก โอน หรือรวมส่วนราชการใดทั้งหมด หรือบางส่วน ห้ามมิให้จัดตั้งส่วนราชการ ที่มีภารกิจหรืออำนาจหน้าที่ ที่ีมีลักษณะเดียวกัน หรือคล้ายคลึงกันกับ ส่วนราชการดังกล่าวขึ้นอีก โดยมีข้อยกเว้นอะไรบ้าง", "answer" : "กรณียกเว้น คือ <ol><li>เพื่อรักษาความมั่นคงของรัฐ หรือเศรษฐกิจของประเทศ </li><li>รักษาผลประโยชน์ส่วนรวมของประชาชน และ</li><li>ได้รับความเห็นชอบจาก ก.พ.ร.</li></ol>(มาตรา ๓๔)"},
{"id" : "60", "question" : "การยกเลิก ปรับปรุง หรือจัดให้มี กฎ ระเบียบ ข้อบังคับ หรือประกาศขึ้นใหม่ ต้องคำนึงถึงเรื่องใด", "answer" : "ความสะดวก รวดเร็ว และลดภาระของประชาชน เป็นสำคัญ (มาตรา ๓๕)"},
{"id" : "61", "question" : "หน่วยงานใด มีอำนาจเสนอแนะให้ส่วนราชการ แก้ไข ปรับปรุง หรือยกเลิก กฎหมาย กฎ ระเบียบ ข้อบังคับ หรือประกาศ ได้", "answer" : "สำนักงานคณะกรรมการกฤษฎีกา (มาตรา ๓๖)"},
{"id" : "62", "question" : "ส่วนราชการ จำเป็นต้องปฏิบัติตามข้อเสนอแนะของ สำนักงานคณะกรรมการกฤษฎีกา ที่เสนอแนะให้ แก้ไข ปรับปรุง หรือยกเลิก กฎหมาย กฎ ระเบียบ ข้อบังคับ หรือประกาศ หรือไม่", "answer" : "ไม่จำเป็น <br>>หากไม่เห็นชอบด้วยกับคำเสนอแนะ ของ สำนักงานคณะกรรมการกฤษฎีกา ให้เสนอเรื่อง ต่อคณะรัฐมนตรีเพื่อพิจารณาวินิจฉัย (มาตรา ๓๖)"},
{"id" : "63", "question" : "ในกรณีที่ หน่วยงานใด กำหนดระยะเวลาแล้วเสร็จของภารกิจใด ภารกิจหนึ่ง ล่าช้าเกินความจำเป็น เป็นอำนาจของหน่วยงานใด ที่จะเปลี่ยนแปลงกำหนดระยะเวลาแล้วเสร็จใหม่", "answer" : "ก.พ.ร. (มาตรา ๓๗)"},
{"id" : "64", "question" : "เป็นหน้าที่ของผู้ใด ในการกำกับ ติดตาม การปฏิบัติงานของข้าราชการ ให้แล้วเสร็จ ภายในระยะเวลา ตามกำหนดระยะเวลาแล้วเสร็จของงาน ที่ประกาศให้ประชาชน และข้าราชการทราบเป็นการทั่วไป", "answer" : "ผู้บังคับบัญชา  (มาตรา ๓๗)"},
{"id" : "65", "question" : "เมื่อได้รับการติดต่อสอบถามเป็นหนังสือจากประชาชน ส่วนราชการจะต้องตอบคำถาม หรือแจ้งการดำเนินการ ให้ทราบภายในกี่วัน", "answer" : "15 วัน หรือภายในกำหนดเวลาแล้วเสร็จ ตามที่ประกาศไว้ (มาตรา ๓๘)"},
{"id" : "66", "question" : "ระบบที่ช่วยอำนวยความสะดวก รวดเร็ว ให้แก่ประชาชนในการติดต่อกับส่วนราชการทุกแห่ง มีชื่อว่าอะไร", "answer" : "ระบบเครือข่ายสารสนเทศกลาง"},
{"id" : "67", "question" : " หน่วยงานใด มีหน้าที่จัดให้มีระบบเครือข่ายสารสนเทศกลาง", "answer" : "กระทรวงเทคโนโลยีสารสนเทศและการสื่อสาร (มาตรา ๔๐)"},
{"id" : "68", "question" : "การปฏิบัติราชการในเรื่องใด ๆ โดยปกติให้ถือว่าเป็นเรื่องเปิดเผย ถามว่า มีกรณีใดบ้างที่ อาจกำหนดให้เป็นความลับได้", "answer" : "กรณี ที่มีความจำเป็นอย่างยิ่ง <ol><li>เพื่อประโยชน์ในการรักษาความมั่นคงของประเทศ </li><li>เพื่อประโยชน์ในการรักษาความมั่นคงทางเศรษฐกิจ </li><li>การรักษาความสงบเรียบร้อยของประชาชน </li><li>การคุ้มครองสิทธิส่วนบุคคล</li></ol> (มาตรา ๔๓)"},
{"id" : "69", "question" : "โดยปกติ การจัดซื้อจัดจ้างต้องกระทำโดยเปิดเผย แต่การเปิดเผยข้อมูลดังกล่าวไม่อาจกระทำได้ ในกรณีใดบ้าง", "answer" : "ก่อให้เกิดความได้เปรียบหรือเสียเปรียบ หรือความเสียหายแก่บุคคลใด ในการจัดซื้อหรือจัดจ้าง (มาตรา ๔๔)"},
{"id" : "70", "question" : "ในการจัดทำสัญญาจัดซื้อหรือจัดจ้าง ห้ามมิให้มีข้อความใดบ้าง", "answer" : "ห้ามไม่ให้มีข้อความที่ ห้ามมิให้มีการเปิดเผยข้อความหรือข้อตกลงในสัญญาจัดซื้อจัดจ้าง (ยกเว้นข้อมูลดังกล่าว เป็นข้อมูลที่อยู่ภายใต้บังคับกฎหมาย กฎ ระเบียบ หรือข้อบังคับ ที่เกี่ยวกับการคุ้มครองความลับทางราชการ หรือในส่วนที่เป็นความลับทางการค้า ก็ระบุในสัญญาได้ว่า การนี้ไม่ให้เปิดเผยต่อสาธารณะ) <br>(มาตรา ๔๔)"},
{"id" : "71", "question" : "คณะผู้ประเมินอิสระ ดำเนินการประเมินผลการปฎิบํติราชการ ของส่วนราชการด้านใดบ้าง", "answer" : "<ol><li>ผลสัมฤทธิ์ของภารกิจ </li><li>คุณภาพการให้บริการ </li><li>ความพึงพอใจของประชาชนผู้รับบริการ </li><li>ความคุ้มค่าในภารกิจ</li></ol> (มาตรา ๔๕)"},
{"id" : "72", "question" : "การประเมินภาพรวมของผู้บังคับบัญชาแต่ละระดับ ให้ดำเนินการอย่างไร", "answer" : "ไม่เป็นการบังคับ ถ้าส่วนราชการจะจัดให้มีขึ้น ต้องกระทำเป็นความลับ และเป็นไปเพื่อ ประโยชน์แห่งความสามัคคี ของข้าราชการ (มาตรา ๔๖)"},
{"id" : "73", "question" : "การประเมินผลการปฏิบัติงาน ของข้าราชการ มีจุดประสงค์เพื่อการใด", "answer" : " เพื่อประโยชน์ในการบริหารงานบุคคล (มาตรา ๔๗)"},
{"id" : "74", "question" : "การประเมินผลการปฏิบัติงาน ของข้าราชการ ให้คำนึงถึงเรื่องใดบ้าง", "answer" : "<ul><li>ผลการปฏิบัติงาน เฉพาะตัวของข้าราชการผู้นั้นในตำแหน่งที่ปฏิบัติ </li><li>ประโยชน์ และผลสัมฤทธิ์ ที่หน่วยงานที่ข้าราชการผู้นั้นสังสัด ได้รับจากการปฏิบัติงานของ ข้าราชการผู้นั้น</li></ul>(มาตรา ๔๗)"},
{"id" : "75", "question" : "เงินเพิ่มพิเศษ หรือบำเหน็จความชอบ นำมาจากเงินงบประมาณอะไร", "answer" : "เงินเพิ่มพิเศษที่คณะรัฐมนตรีจัดสรร หรือเงินงบประมาณเหลือจ่ายของส่วนราชการนั้น (มาตรา ๔๘-๔๙)"},
{"id" : "76", "question" : "การจัดสรรเงินเพิ่มพิเศษให้แก่ส่วนราชการ มีหลักเกณฑ์อย่างไร", "answer" : "การให้บริการที่มีคุณภาพ และเป็นไปตามเป้าหมายที่กำหนด รวมทั้งเป็นที่พึงพอใจแก่ประชาชน  (มาตรา ๔๘)"},
{"id" : "77", "question" : "หน่วยงานใด เป็นผู้กำหนดหลักเกณฑ์และวิธีการ จัดสรรเงินเพิ่มพิเศษ เป็นบำเหน็จความชอบ แก่ส่วนราชการ", "answer" : "ก.พ.ร.  (มาตรา ๔๙)"},
{"id" : "78", "question" : "องค์กรปกครองส่วนท้องถิ่น ต้องจัดทำหลักเกณฑ์การบริหารกิจการบ้านเมืองที่ดี ตามแนวทางของ พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ทั้งนี้ อย่างน้อยต้องประกอบด้วยหลักเกณฑ์อะไรบ้าง", "answer" : "อย่างน้อย ต้องมีหลักเกณฑ์เกี่ยวกับ <ol><li>การลดขั้นตอนการปฏิบัติงาน </li><li>การอำนวยความสะดวก </li><li>การตอบสนองความต้องการของประชาชน</li></ol>(มาตรา ๕๒)"},
{"id" : "79", "question" : " กระทรวงใด มีหน้าที่ดูแลและให้ความช่วยเหลือ องค์กรปกครองส่วนท้องถิ่น ในการจัดทำหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ", "answer" : "กระทรวงมหาดไทย"},
{"id" : "80", "question" : "พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี เกิดจากพระราชบัญญัติใด", "answer" : "พระราชบัญญัติ ระเบียบบริหารราชการแผ่นดิน (ฉบับที่ ๕) พ.ศ. ๒๕๔๕ บัญญัติให้ การกำหนดกลไก เกณฑ์ และวิธีการ ในการปฏิบัติราชการ และการสั่งการ ให้ส่วนราชการ และข้าราชการปฏิบัติราชการ เพื่อให้เกิดการบริหารกิจการบ้านเมืองที่ดี กระทำโดยตราเป็น พระราชกฤษฎีกา"},
]
var principles_of_good_govt_shuffled = shuffle(principles_of_good_govt);

var good_govt = [
{ "id" : "1", "question" : "พระราชบัญญัติระเบียบบริหาราชการแผ่นดิน พ.ศ. 2534 ใช้บังคับตั้งแต่เมื่อใด",  "answer" : "ประกาศในราชกิจจานุเบกษาเมื่อวันที่ 4 กันยายน 2534 ใช้บังคับตั้งแต่วันถัดจากวันประกาศ คือ วันที่ 5 กันยายน 2534 เป็นต้นไป"},
{ "id" : "2", "question" : "หลักการในการบริหารราชการตาม พรบ. ระเบียบบริหารราชการแผ่นดิน พ.ศ. 2534และที่แก้ไขเพิ่มเติมคืออะไร",  "answer" : "<ul><li>ประโยชน์สุขของประชาชน</li><li>เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ</li><li>ความมีประสิทธิภาพ ความคุ้มค่าในเชิงภารกิจแห่งรัฐ </li><li>การลดขั้นตอนการปฏิบัติงาน-การลดภารกิจและยุบเลิกหน่วยงานที่ไม่จำเป็น </li><li>การกระจายภารกิจและทรัพยากรให้แก่ท้องถิ่น</li><li>การกระจายอำนาจตัดสินใจ </li><li>การอำนวยความสะดวกและการตอบสนองความต้องการของประชาชน </ul>(มาตรา ๓)"},
{ "id" : "3", "question" : "พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน พ.ศ 2534 ได้วางแนวทางการจัดสรรงบประมาณและการบรรจุแต่งตั้งบุคคลเข้าดำรงตำแหน่ง หรือปฏิบัติหน้าที่ตาม พ.ร.บ.จะต้องเป็นไปตามหลักการใด",  "answer" : "<ul><li>ประโยชน์สุขของประชาชน</li><li>เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ</li><li>ความมีประสิทธิภาพ ความคุ้มค่าในเชิงภารกิจแห่งรัฐ </li><li>การลดขั้นตอนการปฏิบัติงาน-การลดภารกิจและยุบเลิกหน่วยงานที่ไม่จำเป็น </li><li>การกระจายภารกิจและทรัพยากรให้แก่ท้องถิ่น</li><li>การกระจายอำนาจตัดสินใจ </li><li>การอำนวยความสะดวกและการตอบสนองความต้องการของประชาชน </ul>(มาตรา ๓)"},
{ "id" : "4", "question" : "ในการปฏิบัติหน้าที่ของส่วนราชการ ต้องคำนึงถึงเรื่องใด ",  "answer" : "-ความรับผิดชอบของผู้ปฏิบัติงาน<br> -การมีส่วนร่วมของประชาชน<br> -การเปิดเผยข้อมูล <br>-การติดตามตรวจสอบและประเมินผลการปฏิบัติงาน (มาตรา ๓)"},
{ "id" : "5", "question" : "การจัดระเบียบบริหารราชการแผ่นดิน แบ่งออกได้เป็นกี่ประเภท",  "answer" : "3 ประเภท คือ ส่วนกลาง ส่วนภูมิภาค และส่วนท้องถิ่น (มาตรา ๔)"},
{ "id" : "6", "question" : "สำนักนายกรัฐมนตรีมีฐานะเป็นกรม หรือเป็นกระทรวง",  "answer" : "เป็นกระทรวง (มาตรา ๗)"},
{ "id" : "7", "question" : "กรม ซึ่งไม่สังกัดกระทรวงหรือทบวง มีฐานะเป็นนิติบุคคลหรือไม่",  "answer" : "เป็นนิติบุคคล  (มาตรา ๗)"},
{ "id" : "8", "question" : "สำนักนายกรัฐมนตรี มีฐานะเป็นนิติบุคคลหรือไม่",  "answer" : "เป็นนิติบุคคล  (มาตรา ๗)"},
{ "id" : "9", "question" : "หน่วยงานใดมีหน้าที่เสนอความเห็นต่อคณะรัฐมนตรี ให้แบ่งส่วนราชการภายในของกรม",  "answer" : "สำนักงานคณะกรรมการข้าราชการพลเรือนและสำนักงบประมาณ (มาตรา ๘ สัตต)"},
{ "id" : "10", "question" : "การจัดตั้งกรมขึ้นใหม่  ให้ตราเป็นกฎหมายใด",  "answer" : "พระราชบัญญัติ (มาตรา ๘)<ul><li>ตั้งกรมใหม่ -&gt; พ.ร.บ.</li><li>ยุบรวมกรม, เปลี่ยนชื่อ -&gt; พระราชกฤษฎีกา</li><li>แบ่งส่วนราชการ -&gt; ประกาศกระทรวง</li></ul>"},
{ "id" : "11", "question" : "การยุบรวมกรมในกระทรวงใดกระทรวงหนึ่ง ในกรณีที่ไม่มีการกำหนดตำแหน่งข้าราชการเพิ่มขึ้น จะต้องตราเป็นกฎหมายใด",  "answer" : "พระราชกฤษฎีกา(ตั้งกรมใหม่ &gt; พ.ร.บ.<br>ยุบรวมกรม, เปลี่ยนชื่อ &gt; พระราชกฤษฎีกา<br>แบ่งส่วนราชการ &gt; ประกาศกระทรวง)(มาตรา ๘)"},
{ "id" : "12", "question" : "การแบ่งส่วนราชการภายในกรม จะต้องตราเป็นกฎหมายใด",  "answer" : "กฎกระทรวง (ตั้งกรมใหม่ &gt; พ.ร.บ.<br>ยุบรวมกรม, เปลี่ยนชื่อ &gt; พระราชกฤษฎีกา<br>แบ่งส่วนราชการ &gt; กฎกระทรวง) (มาตรา ๘)"},
{ "id" : "13", "question" : "การแบ่งส่วนราชการภายในสำนักงานรัฐมนตรี ต้องตราเป็นกฎหมายใด",  "answer" : "ให้ออกเป็นกฎกระทรวง  (มาตรา ๘ ฉ)"},
{ "id" : "14", "question" : "การแบ่งส่วนราชการภายในกรม ต้องตราเป็นกฎหมายใด",  "answer" : "ให้ออกเป็นกฎกระทรวง  (มาตรา ๘ ฉ)"},
{ "id" : "15", "question" : "การเปลี่ยนชื่อกรมในกระทรวงใดกระทรวงหนึ่ง จะต้องตราเป็นกฎหมายใด",  "answer" : "พระราชกฤษฎีกา(ตั้งกรมใหม่ &gt; พ.ร.บ.<br>ยุบรวมกรม, เปลี่ยนชื่อ &gt; พระราชกฤษฎีกา<br>แบ่งส่วนราชการ &gt; กฎกระทรวง)(มาตรา ๘)"},
{ "id" : "16", "question" : "บทบัญญัติแห่งกฎหมาย กฎ ระเบียบ ข้อบังคับ ที่อ้างถึงส่วนราชการที่ได้ถูกเปลี่ยนชื่อ จะต้องทำอย่างไร",  "answer" : "ไม่ต้องทำอะไร เพราะให้ถือว่าบทบัญญัติแห่งกฎหมาย กฎ ระเบียบ ข้อบังคับ นั้น อ้างถึงส่วนราชการที่ได้เปลี่ยนชื่อนั้น โดยอัตโนมัติ  (มาตรา ๘)"},
{ "id" : "17", "question" : "งบประมาณรายจ่ายที่เหลืออยู่ของส่วนราชการที่ถูกยุบ จะต้องทำอย่างไร",  "answer" : "ไม่ต้องทำอะไร เพราะให้ถือว่าเป็นอันระงับไป  (มาตรา ๘)"},
{ "id" : "18", "question" : "ทรัพย์สินของส่วนราชการที่ถูกยุบ จะต้องทำอย่างไร",  "answer" : "ให้โอนให้แก่ส่วนราชการอื่นหรือหน่วยงานอื่นของรัฐ ตามที่รัฐมนตรีซึ่งเป็นผู้รักษาการตามพระราชกฤษฎีกากำหนด โดยความเห็นชอบของคณะรัฐมนตรี  (มาตรา ๘)"},
{ "id" : "19", "question" : "การยุบส่วนราชการที่เรียกชื่ออย่างอื่นและมีฐานะเป็นกรม ต้องออกเป็นกฎหมายใด",  "answer" : "ให้ตราเป็นพระราชกฤษฎีกา  (มาตรา ๘)"},
{ "id" : "20", "question" : "ส่วนราชการที่ประสงค์จะรับโอนข้าราชการผู้ต้องพ้นจากราชการ เพราะเหตุยุบตำแหน่ง อันเนื่องมาจากการยุบส่วนราชการ จะต้องรับโอนภายในกี่วัน", "answer" : "ต้องรับโอนภายใน 30 วัน (มาตรา ๘)"},
{ "id" : "21", "question" : "การแบ่งส่วนราชการภายในมหาวิทยาลัย ให้ตราเป็นกฎหมายใด",  "answer" : "ให้เป็นไปตามกฎหมายว่าด้วยมหาวิทยาลัยนั้น (มาตรา ๘)"},
{ "id" : "22", "question" : "อำนาจหน้าที่ของนายกรัฐมนตรี กำหนดไว้ในมาตราใดของ พ.ร.บ.ระเบียบการบริหารราชการแผ่นดิน",  "answer" : "มาตรา ๑๐"},
{ "id" : "23", "question" : "ผู้ใดรับผิดชอบในการ<i>กำหนดนโยบาย เป้าหมาย และผลสัมฤทธิ์ของงาน<i>ในสำนักนายกรัฐมนตรี",  "answer" : "นายกรัฐมนตรี (มาตรา ๑๐)"},
{ "id" : "24", "question" : "นายกรัฐมนตรีมีอำนาจสั่งสอบสวนข้อเท็จจริงเกี่ยวกับการปฏิบัติราชการของราชการส่วนท้องถิ่น หรือไม่",  "answer" : "มี (มาตรา ๑๑)"},
{ "id" : "25", "question" : "นายกรัฐมนตรีมีอำนาจยับยั้งการปฏิบัติราชการใด ๆ ของราชการส่วนภูมิภาคที่ขัดต่อนโยบายหรือไม่",  "answer" : "มี (มาตรา ๑๑)"},
{ "id" : "26", "question" : "นายกรัฐมนตรีสามารถยับยั้งการปฏิบัติราชการของส่วนกลางได้ในกรณีใด",  "answer" : "กรณีขัดต่อนโยบายหรือมติของคณะรัฐมนตรี (มาตรา ๑๑)"},
{ "id" : "27", "question" : "นายกรัฐมนตรี สามารถแต่งตั้งข้าราชการซึ่งสังกัดกระทรวง ทบวง กรมหนึ่งไปดำรงตำแหน่งของอีกกระทรวง ทบวง กรมหนึ่ง โดยให้ได้รับเงินเดือนจากกระทรวง ทบวง กรมเดิม ได้หรือไม่",  "answer" : " สามารถกระทำได้ (มาตรา ๑๑(๕))"},
{ "id" : "28", "question" : "การที่นายกรัฐมนตรี จะแต่งตั้งข้าราชการตำแหน่งอธิบดี ต้องได้รับอนุมัติจากใครหรือไม่",  "answer" : "ต้องได้รับอนุมัติจากคณะรัฐมนตรี (มาตรา ๑๑(๕))"},
{ "id" : "29", "question" : "สำนักเลขาธิการนายกรัฐมนตรี มีอำนาจหน้าทอะไรบ้าง",  "answer" : "มีอำนาจหน้าที่เกี่ยวกับราชการทางการเมือง<br>(ระวัง อย่าสับสนกับ สำนักเลขาธิการคณะรัฐมนตรี ซึ่งมีหน้าที่เกี่ยวกับ ราชการของคณะรัฐมนตรี รัฐสภา และราชการในพระองค์ )"},
{ "id" : "30", "question" : "เลขาธิการ<i>นายกรัฐมนตรี</i> เป็นข้าราชการประเภทใด",  "answer" : "เป็นข้าราชการการเมือง (มาตรา ๑๓)"},
{ "id" : "31", "question" : "รองเลขาธิการ<i>นายกรัฐมนตรี</i>ฝ่ายการเมือง เป็นข้าราชการประเภทใด",  "answer" : "เป็นข้าราชการการเมือง (มาตรา ๑๓)"},
{ "id" : "32", "question" : "รองเลขาธิการนายกรัฐมนตรีฝ่ายบริหาร  เป็นข้าราชการประเภทใด",  "answer" : "เป็นข้าราชการพลเรือนสามัญ  (มาตรา ๑๓)"},
{ "id" : "33", "question" : "สำนักเลขาธิการคณะรัฐมนตรี มีอำนาจหน้าที่ในเรื่องใดบ้าง",  "answer" : "มีอำนาจหน้าที่เกี่ยวกับราชการของคณะรัฐมนตรี รัฐสภา และราชการในพระองค์ (มาตรา ๑๔)<br>(ระวัง อย่าสับสนกับ สำนักเลขาธิการนายกรัฐมนตรี ซึ่งมีอำนาจหน้าที่เกี่ยวกับราชการทางการเมือง)"},
{ "id" : "34", "question" : "ใครเป็นผู้บังคับบัญชาข้าราชการของสำนักเลขาธิการ<i>คณะรัฐมนตรี</i>",  "answer" : "เลขาธิการคณะรัฐมนตรี (มาตรา ๑๔)"},
{ "id" : "35", "question" : "เลขาธิการ<i>คณะรัฐมนตรี</i>  เป็นข้าราชการประเภทใด",  "answer" : "ข้าราชการพลเรือนสามัญ (มาตรา ๑๔)<br>(แต่ เลขาธิการ<i>นายกรัฐมนตรี </i> เป็นข้าราชการการเมือง)"},
{ "id" : "36", "question" : "รองเลขาธิการ<i>คณะรัฐมนตรี</i> เป็นข้าราชการประเภทใด",  "answer" : "ข้าราชการพลเรือนสามัญ (มาตรา ๑๔)"},
{ "id" : "37", "question" : "ผู้ช่วยเลขาธิการ<i>คณะรัฐมนตรี</i>  เป็นข้าราชการประเภทใด",  "answer" : "ข้าราชการพลเรือนสามัญ (มาตรา ๑๔)"},
{ "id" : "38", "question" : "หน่วยงานใดมีอำนาจหน้าที่เกี่ยวกับราชการในพระองค์ ",  "answer" : "สำนักเลขาธิการคณะรัฐมนตรี  (มาตรา ๑๔)<br>ผู้ใดรับผิดชอบในการ <i>กำหนดแนวทางและแผนการปฏิบัติราชการ<i> ของสำนักนายกรัฐมนตรี ",  "answer" : "ปลัดสำนักนายกรัฐมนตรี (มาตรา ๑๖)<br>(การกำหนดเป้าหมาย ผลสัมฤทธิ์ของงาน เป็นหน้าที่ของนายกรัฐมนตรี)"},
{ "id" : "39", "question" : "ใครเป็นผู้บังคับบัญชาข้าราชการของส่วนราชการในสำนักนายกรัฐมนตรีรองจากนายกรัฐมนตรี ",  "answer" : "นายกรัฐมนตรี <br>รองนายกรัฐมนตรี <br>รัฐมนตรีประจำสำนักนายกรัฐมนตรี <br>และปลัดสำนักนายกรัฐมนตรี (เฉพาะหน่วยงานที่ไม่ได้ขึ้นตรงต่อนายกรัฐมนตรี) (มาตรา ๑๖)"},
{ "id" : "40", "question" : "หน่วยงานใดบ้างที่อยู่ในสังกัดสำนักนายกรัฐมนตรี แต่ไม่อยู่ภายใต้บังคับบัญชาของ ปลัดสำนักนายกรัฐมนตรี ",  "answer" : "มีหลายหน่วยงาน เช่น สำนักข่าวกรองแห่งชาติ สำนักงบประมาณ สำนักงานสภาความมั่นคงแห่งชาติ สำนักงานคณะกรรมการกฤษฎีกา สำนักงานคณะกรรมการข้าราชการพลเรือน สำนักงานคณะกรรมการพัฒนาการเศรษฐกิจและสังคมแห่งชาติ เป็นต้น"},
{ "id" : "41", "question" : "หน่วยงานใดบ้างที่อยู่ในสังกัดสำนักนายกรัฐมนตรี และอยู่ภายใต้บังคับบัญชาของ ปลัดสำนักนายกรัฐมนตรี ",  "answer" : "มีหลายหน่วยงาน เช่น สำนักงานปลัดสำนักนายก กรมประชาสัมพันธ์ สำนักงานคณะกรรมการคุ้มครองผู้บริโภค องค์การสื่อสารมวลชนแห่งประเทศไทย เป็นต้น"},
{ "id" : "42", "question" : "ในกระทรวงหนึ่ง ผู้ใดเป็นผู้รับผิดชอบในการกำหนดนโยบาย เป้าหมาย และผลสัมฤทธิ์ของงานในกระทรวงนั้น ให้สอดคล้องกับนโยบายที่คณะรัฐมนตรีแถลงไว้ต่อรัฐสภา หรือที่คณะรัฐมนตรีกำหนดหรืออนุมัติ ",  "answer" : "รัฐมนตรีว่าการกระทรวง (มาตรา ๒๐)"},
{ "id" : "43", "question" : "ใครทำหน้าที่เป็นหัวหน้ากลุ่มที่ตั้งขึ้นโดยกฎกระทรวง ซึ่งรวมส่วนราชการระดับกรม ตั้งแต่สองส่วนราชการขึ้นไป",  "answer" : "ผู้ดำรงตำแหน่งไม่ต่ำกว่าอธิบดี (มาตรา ๒๑)"},
{ "id" : "44", "question" : "หน่วยงานใดมีหน้าที่อนุมัติให้กระทรวงสามารถมีรองปลัดกระทรวงเพิ่มขึ้น เนื่องจากมีภารกิจในกระทรวงเพิ่มขึ้น",  "answer" : " คณะกรรมการข้าราชการพลเรือน และคณะกรรมการพัฒนาระบบราชการ (มาตรา ๒๑)"},
{ "id" : "45", "question" : "สำนักงานรัฐมนตรีมีอำนาจหน้าที่อะไร",  "answer" : "มีอำนาจหน้าที่เกี่ยวกับราชการทางการเมือง (มาตรา ๒๒)"},
{ "id" : "46", "question" : "บุคคลใด เป็นผู้บังคับบัญชาข้าราชการสำนักงานรัฐมนตรี",  "answer" : "เลขานุการรัฐมนตรี (มาตรา ๒๒)"},
{ "id" : "47", "question" : "เลขานุการรัฐมนตรีเป็น ข้าราชการการเมือง หรือ เป็นข้าราชการพลเรือนสามัญ",  "answer" : "เป็นข้าราชการการเมือง (มาตรา ๒๒)"},
{ "id" : "48", "question" : "หน่วยงานใดในกรมมีอำนาจหน้าที่เกี่ยวกับราชการทั่วไปของกรมและราชการ ที่มิได้แยกให้เป็นหน้าที่ของกองหรือส่วนราชการใดโดยเฉพาะ",  "answer" : "สำนักงานเลขานุการกรม(มาตรา ๓๓)"},
{ "id" : "49", "question" : "บุคคลใด เป็นผู้บังคับบัญชาข้าราชการในสำนักงานเลขานุการกรม",  "answer" : "เลขานุการกรม (มาตรา ๓๓)"},
{ "id" : "50", "question" : "การมอบอำนาจ มีหลักเกณฑ์อย่างไร",  "answer" : " ผู้ดำรงตำแหน่งนั้นอาจมอบอำนาจให้ผู้ดำรงตำแหน่งอื่นในส่วนราชการเดียวกัน หรือส่วนราชการอื่น หรือผู้ว่าราชการจังหวัดเป็นผู้ปฏิบัติราชการแทนได้ ในกรีที่ <br>1. ถ้ากฎหมาย กฎ ระเบียบ ประกาศ หรือคำสั่งนั้น หรือมติของคณะรัฐมนตรีในเรื่องนั้น มิได้กำหนดเรื่องการมอบอำนาจไว้เป็นอย่างอื่น หรือมิได้ห้ามเรื่องการมอบอำนาจไว้ <br>2. ปฎิบัติตามหลักเกณฑ์ที่กำหนดในพระราชกฤษฎีกา  (มาตรา ๓๘)"},
{ "id" : "51", "question" : "การมอบอำนาจ ให้กระทำโดยวิธีการใด",  "answer" : "ทำเป็นหนังสือ (มาตรา ๓๘)"},
{ "id" : "52", "question" : "ในการมอบอำนาจ ให้ผู้มอบอำนาต้องพิจารณาถึงเรื่องใดบ้าง",  "answer" : "1. การอำนวยความสะดวกแก่ประชาชน<br>2. ความรวดเร็วในการปฏิบัติราชการ <br>3.การกระจายความรับผิดชอบตามสภาพของตำแหน่งของผู้รับมอบอำนาจ และ<br>4.ผู้รับมอบอำนาจต้องปฏิบัติหน้าที่ ที่ได้รับมอบอำนาจตามวัตถุประสงค์ของการมอบอำนาจดังกล่าว (มาตรา ๔๐)"},
{ "id" : "53", "question" : "หลังจากมอบอำนาจแล้ว ผู้มอบอำนาจสามารถแก้ไขการปฏิบัติราชการของผู้รับมอบอำนาจได้หรือไม่",  "answer" : "ได้  (มาตรา ๔๐)"},
{ "id" : "54", "question" : "ในกรณีที่นายกรัฐมนตรีไม่อาจปฏิบัติราชการได้ รัฐมนตรีคนใดคนหนึ่ง สามารถรักษาการแทนได้หรือไม่",  "answer" : "ได้ ถ้าไม่มีผู้ดำรงตำแหน่งรองนายกรัฐมนตรี หรือมีแต่ไม่อาจปฏิบัติราชการได้ (มาตรา ๔๑)"},
{ "id" : "55", "question" : "ความใน หมวด ๖ การรักษาราชการแทน ไม่นำมาใช้กับราชการใด",  "answer" : "ราชการในกระทรวงที่เกี่ยวกับทหาร"},
{ "id" : "56", "question" : "การจัดระเบียบบริหารราชการส่วนภูมิภาคมีกี่รูปแบบ อะไรบ้าง",  "answer" : "มี 2 รูปแบบ คือ จังหวัดและอำเภอ"},
{ "id" : "57", "question" : "การจัดระเบียบบริหารราชการส่วนภูมิภาค ยึดหลักการ รวมอำนาจ แบ่งอำนาจ หรือกระจายอำนาจ",  "answer" : "แบ่งอำนาจ (Deconcentration) คือ ราชการบริหารส่วนกลางจะมอบอำนาจหน้าที่ ในกิจการบางอย่างไปให้แก่ราชการบริหารส่วนภูมิภาคไปปฏิบัติจัดทำ "},
{ "id" : "58", "question" : "จังหวัด มีฐานะเป็นอะไร",  "answer" : "เป็นนิติบุคคล (มาตรา ๕๒)"},
{ "id" : "59", "question" : "การตั้ง ยุบ และเปลี่ยนแปลงเขตจังหวัด ให้ตราเป็นกฎหมายใด",  "answer" : "พระราชบัญญัติ  (มาตรา ๕๒)"},
{ "id" : "60", "question" : "จังหวัดมีหน้าที่อะไรบ้าง",  "answer" : "(๑) นำภารกิจของรัฐและนโยบายของรัฐบาลไปปฏิบัติให้เกิดผลสัมฤทธิ์<br>(๒) ดูแลให้มีการปฏิบัติและบังคับการให้เป็นไปตามกฎหมาย เพื่อให้เกิดความสงบเรียบร้อยและเป็นธรรมในสังคม<br>(๓) จัดให้มีการคุ้มครอง ป้องกัน ส่งเสริม และช่วยเหลือประชาชนและชุมชนที่ด้อยโอกาส เพื่อให้ได้รับความเป็นธรรมทั้งด้านเศรษฐกิจและสังคมในการดำรงชีวิตอย่างพอเพียง<br>(๔) จัดให้มีการบริการภาครัฐเพื่อให้ประชาชนสามารถเข้าถึงได้อย่างเสมอหน้า รวดเร็วและมีคุณภาพ<br>(๕) จัดให้มีการส่งเสริม อุดหนุน และสนับสนุนองค์กรปกครองส่วนท้องถิ่นเพื่อให้สามารถดำเนินการ ตามอำนาจและหน้าที่ขององค์กรปกครองส่วนท้องถิ่น และให้มีขีดความสามารถพร้อมที่จะดำเนินการตามภารกิจที่ได้รับการถ่ายโอนจากกระทรวง ทบวง กรม<br>(๖) ปฏิบัติหน้าที่อื่นตามที่คณะรัฐมนตรี กระทรวง ทบวง กรม หรือหน่วยงานอื่นของรัฐมอบหมายหรือที่มีกฎหมายกำหนด (มาตรา ๕๒)"},
{ "id" : "61", "question" : "แผนพัฒนาจังหวัดต้องสอดคล้องกับอะไรบ้าง",  "answer" : "(๑)แนวทางการพัฒนาเศรษฐกิจและสังคมในระดับชาติ และ<br>(๒)ความต้องการของประชาชนในท้องถิ่นในจังหวัด"},
{ "id" : "62", "question" : "วิธีการสรรหาผู้แทนภาคประชาสังคม และผู้แทนภาคธุรกิจเอกชน ในการจัดทำแผนพัฒนาจังหวัด ให้ยึดตามหลักเกณฑ์ใด",  "answer" : "ให้เป็นไปตามหลักเกณฑ์และวิธีการที่กำหนดในพระราชกฤษฎีกา (มาตรา ๕๓)"},
{ "id" : "63", "question" : "แผนพัฒนาจังหวัด มีผลต่อองค์กรปกครองส่วนท้องถิ่น หรือไม่ อย่างไร",  "answer" : "มี คือ เมื่อประกาศใช้แผนพัฒนาจังหวัดแล้ว การจัดทำแผนพัฒนาท้องถิ่นขององค์กรปกครองส่วนท้องถิ่น และการดำเนินกิจการของส่วนราชการ และหน่วยงานอื่นของรัฐทั้งปวงที่กระทำในพื้นที่จังหวัด ต้องสอดคล้องกับแผนพัฒนาจังหวัด  (มาตรา ๕๓)"},
{ "id" : "64", "question" : "คณะที่ทำหน้าที่เป็นที่ปรึกษาของผู้ว่าราชการจังหวัด มีชื่อว่าอะไร",  "answer" : "คณะกรมการจังหวัด (กรมการ ไม่ใช่ กรรมการ...)(มาตรา ๕๓)"},
{ "id" : "65", "question" : "ผู้ใด ทำหน้าที่เป็นกรมการจังหวัดและเลขานุการ ของคณะกรมการจังหวัด",  "answer" : "หัวหน้าสำนักงานจังหวัด"},
{ "id" : "66", "question" : "ผู้ช่วยผู้ว่าราชการจังหวัด สังกัดกระทรวงมหาดใด",  "answer" : "กระทรวงมหาดไทย"},
{ "id" : "67", "question" : "ก.ธ.จ. ย่อมาจากอะไร",  "answer" : "คณะกรรมการธรรมาภิบาลจังหวัด"},
{ "id" : "68", "question" : "ก.ธ.จ. มีหน้าที่อะไร",  "answer" : "มีหน้าที่สอดส่องและเสนอแนะการปฏิบัติภารกิจของหน่วยงานของรัฐในจังหวัดให้ ใช้วิธีการบริหารกิจการบ้านเมืองที่ดี และเป็นไปตามหลักการที่กำหนด"},
{ "id" : "69", "question" : "ผู้ว่าราชการจังหวัดมีอำนาจและหน้าที่ อะไรบ้าง",  "answer" : "(๑) บริหารราชการตามกฎหมาย ระเบียบแบบแผนของทางราชการ และตามแผนพัฒนาจังหวัด<br>(๒) บริหารราชการตามที่คณะรัฐมนตรี กระทรวง ทบวง กรม มอบหมายหรือตามที่นายกรัฐมนตรีสั่งการ ในฐานะหัวหน้ารัฐบาล<br>(๓) บริหารราชการตามคำแนะนำ และคำชี้แจงของผู้ตรวจราชการกระทรวง ในเมื่อไม่ขัดต่อกฎหมาย ระเบียบ ข้อบังคับ หรือคำสั่งของกระทรวง ทบวง กรม มติของคณะรัฐมนตรี หรือการสั่งการของนายกรัฐมนตรี <br>(๔) กำกับดูแลการปฏิบัติราชการอันมิใช่ราชการส่วนภูมิภาคของข้าราชการ ซึ่งประจำอยู่ในจังหวัดนั้น ยกเว้นข้าราชการทหาร ข้าราชการฝ่ายตุลาการ ข้าราชการฝ่ายอัยการ ข้าราชการพลเรือนในมหาวิทยาลัย ข้าราชการในสำนักงานตรวจเงินแผ่นดินและข้าราชการครู ให้ปฏิบัติราชการให้เป็นไปตามกฎหมาย ระเบียบ ข้อบังคับหรือคำสั่งของกระทรวง ทบวง กรม หรือมติของคณะรัฐมนตรี หรือการสั่งการของนายกรัฐมนตรี หรือยับยั้งการกระทำใด ๆ ของข้าราชการในจังหวัดที่ขัดต่อกฎหมาย ระเบียบ ข้อบังคับ หรือคำสั่งของกระทรวง ทบวงกรม มติของคณะรัฐมนตรี หรือการสั่งการของนายกรัฐมนตรีไว้ชั่วคราวแล้วรายงานกระทรวง ทบวง กรม ที่เกี่ยวข้อง<br>(๕) ประสานงานและร่วมมือกับข้าราชการทหาร ข้าราชการฝ่ายตุลาการข้าราชการฝ่ายอัยการ ข้าราชการพลเรือนในมหาวิทยาลัย ข้าราชการในสำนักงานตรวจเงินแผ่นดินและข้าราชการครู ผู้ตรวจราชการและ หัวหน้าส่วนราชการในระดับเขตหรือภาค ในการพัฒนาจังหวัดหรือป้องปัดภัยพิบัติสาธารณะ <br>(๖)เสนองบประมาณต่อกระทรวงที่เกี่ยวข้อง หรือเสนอขอจัดตั้งงบประมาณต่อสำนักงบประมาณ และรายงานให้กระทรวงมหาดไทยทราบ <br>(๗)กำกับดูแลการบริหารราชการส่วนท้องถิ่นตามกฎหมาย <br>(๘) กำกับการปฏิบัติหน้าที่ของพนักงานองค์การของรัฐบาลหรือรัฐวิสาหกิจ ในการนี้ให้มีอำนาจ ทำรายงานหรือแสดงความคิดเห็นเกี่ยวกับ การดำเนินงานขององค์การของรัฐบาลหรือรัฐวิสาหกิจต่อรัฐมนตรีเจ้าสังกัด องค์การของรัฐบาลหรือรัฐวิสาหกิจ <br>(๙) บรรจุ แต่งตั้ง ให้บำเหน็จ และลงโทษข้าราชการส่วนภูมิภาคในจังหวัดตามกฎหมาย และตามที่ปลัดกระทรวง ปลัดทบวง หรืออธิบดีมอบหมาย"},
{ "id" : "70", "question" : "การตั้ง ยุบ และเปลี่ยนเขตอำเภอ ให้ตราเป็นกฎหมายใด",  "answer" : "พระราชกฤษฎีกา  (มาตรา ๖๑)"},
{ "id" : "71", "question" : "บัญชีรายชื่อบุคคลที่จะทำหน้าที่เป็นคณะบุคคลผู้ทำหน้าที่ไกล่เกลี่ยและประนอมข้อพิพาทของอำเภอ ต้องได้รับความเห็นชอบจากผู้ใด",  "answer" : "คณะกรมการจังหวัด  (มาตรา ๖๑)"},
{ "id" : "72", "question" : "อำเภอมีอำนาจไกล่เกลี่ยข้อพิพาททางแพ่งเกี่ยวกับ ที่ดิน มรดก และข้อพิพาททางแพ่งอื่นที่มีทุนทรัพย์ไม่เกินกี่บาท",  "answer" : "สองล้านบาท  <br>(แก้ไขตาม พ.ร.ฎ. กำหนดทุนทรัพย์การไกล่เกลี่ยและประนอมข้อพิพาททางแพ่งอื่น พ.ศ. ๒๕๖๕)"},
{ "id" : "73", "question" : "ความผิดที่มีโทษทางอาญาที่เกิดขึ้นในเขตอำเภอใด ถ้าผู้เสียหายและผู้ถูกกล่าวหา ยินยอมเป็นหนังสือและปฏิบัติตามคำไกล่เกลี่ย ของคณะบุคคลผู้ทำหน้าที่ไกล่เกลี่ย และประนอมข้อพิพาทแล้ว มีผลทางคดีอาญา อย่างไร",  "answer" : "เป็นอันเลิกกัน ตามประมวลกฎหมายวิธีพิจารณาความอาญา   (มาตรา ๖๑)"},
{ "id" : "74", "question" : "ในกรณีที่ผู้เสียหายและผู้ถูกกล่าวหาไม่ยินยอมตามการไกล่เกลี่ยของคณะบุคคลผู้ทำหน้าที่ไกล่เกลี่ย และประนอมข้อพิพาทของอำเภอ การนับ อายุความ การร้องทุกข์ตามประมวลกฎหมายอาญา ให้เริ่มนับตั้งแต่เมื่อไร",  "answer" : "ตั้งแต่วันที่จำหน่ายข้อพิพาท (มาตรา ๖๑)"},
{ "id" : "75", "question" : "นายอำเภอสังกัดกระทรวงใด",  "answer" : "กระทรวงมหาดไทย"},
{ "id" : "76", "question" : "การจัดระเบียบการปกครององค์การบริหารส่วนจังหวัด เทศบาล ให้เป็นไปตามกฎหมายใด",  "answer" : "ให้เป็นไปตามกฎหมายว่าด้วยการนั้น เช่น พระราชบัญญัติองค์การบริหารส่วนจังหวัด พ.ศ. 2540 "},
{ "id" : "77", "question" : "ก.พ.ร. เป็นชื่อย่อของคณะกรรมการใด",  "answer" : "คณะกรรมการพัฒนาระบบราชการ"},
{ "id" : "78", "question" : "ปัจจุบัน (พ.ศ. ๒๕๖๕) ผู้ใดทำหน้าที่เป็น ประธาน ก.พ.ร.",  "answer" : "นายวิษณุ เครืองาม"},
{ "id" : "79", "question" : "กรรมการผู้ทรงคุณวุฒิ ในคณะกรรมการพัฒนาระบบราชการ ตามที่กำหนดไว้ มีจำนวนกี่คน",  "answer" : "ไม่เกินสิบคน"},
{ "id" : "80", "question" : "กรรมการผู้ทรงคุณวุฒิ ในคณะกรรมการพัฒนาระบบราชการ ประกอบด้วยผู้มีความรู้ความเชี่ยวชาญ ในสาขาใดบ้าง",  "answer" : "-นิติศาสตร์ <br>-เศรษฐศาสตร์ <br>-รัฐศาสตร์ <br>-การบริหารรัฐกิจ <br>-การบริหารธุรกิจ <br>-การเงินการคลัง <br>-จิตวิทยาองค์การ และ<br>-สังคมวิทยา"},
{ "id" : "81", "question" : "ผู้ที่ทำหน้าที่แต่งตั้ง กรรมการผู้ทรงคุณวุฒิ ในคณะกรรมการพัฒนาระบบราชการ คือใคร",  "answer" : "คณะรัฐมนตรี"},
{ "id" : "82", "question" : "กรรมการผู้ทรงคุณวุฒิ ในคณะกรรมการพัฒนาระบบราชการ ได้รับการแต่งตั้งโดยใช้วิธีการใด",  "answer" : "การสรรหา ตามหลักเกณฑ์และวิธีการสรรหาที่คณะรัฐมนตรีกำหนด"},
{ "id" : "83", "question" : "กรรมการผู้ทรงคุณวุฒิ ในคณะกรรมการพัฒนาระบบราชการ  มีวาระการดำรงตำแหน่งคราวละกี่ปี",  "answer" : "4 ปี เมื่อพ้นจากตำแหน่งแล้วอาจได้รับแต่งตั้งอีกได้ แต่ไม่เกินสองวาระติดต่อกัน"},
{ "id" : "84", "question" : "เมื่อตำแหน่งกรรมการผู้ทรงคุณวุฒิ ใน ก.พ.ร. ว่างลงก่อนวาระ ให้ดำเนินการแต่งตั้งกรรมการผู้ทรงคุณวุฒิภายในกี่วัน",  "answer" : "30 วัน เว้นแต่วาระของกรรมการผู้ทรงคุณวุฒิ เหลือไม่ถึงหนึ่งร้อยแปดสิบวัน จะไม่แต่งตั้งกรรมการผู้ทรงคุณวุฒิ ก็ได้"},
{ "id" : "85", "question" : "การวินิจฉัยชี้ขาด ในการประชุม ก.พ.ร. มีเกณฑ์อย่างไร",  "answer" : "ให้ถือเสียงข้างมาก กรรมการคนหนึ่งให้มีเสียงหนึ่งในการลงคะแนน ถ้ามีคะแนนเสียงเท่ากัน ให้ประธานในที่ประชุมออกเสียงเพิ่มขึ้นอีกเสียงหนึ่ง เป็นเสียงชี้ขาด"},
{ "id" : "86", "question" : "เลขาธิการ ก.พ.ร. ขึ้นตรงต่อ ปลัดสำนักนายกรัฐมนตรี หรือนายกรัฐมนตรี  ",  "answer" : "นายกรัฐมนตรี (มาตรา ๗๑)"},
{ "id" : "87", "question" : "เลขาธิการ ก.พ.ร. เป็น ข้าราชการการเมือง หรือข้าราชการพลเรือนสามัญ ",  "answer" : "ข้าราชการพลเรือนสามัญ (มาตรา ๗๑)"},
{ "id" : "88", "question" : "หน่วยงานใด มีหน้าที่เสนอต่อคณะรัฐมนตรีเพื่อกำหนดหลักเกณฑ์และมาตรฐานในการจัดตั้ง การรวม การโอน การยุบ เลิก การกำหนดชื่อ การเปลี่ยนชื่อ การกำหนดอำนาจหน้าที่ และการแบ่งส่วนราชการภายใน ของส่วนราชการที่เป็นกระทรวง ทบวง กรม",  "answer" : "ก.พ.ร.  (มาตรา ๗๑)"},
];

// var good_govt_shuffled = shuffle(good_govt);
changeData('good_govt');


// ***************





var numOfQuestions = 10;  // เป็น dummy ว่ามีทั่้งหมด 10 ข้อ
var currQstnID = "tbl_q10"; // เป็น dummy ว่าทำไปถึงข้อ 10 แล้ว จะได้แสดงเครื่องหมายถูก ว่า ทำหมดแล้ว
var clickedQstns = "xzcccx11111";

// คือส่งข้อมูลเพื่อส่งไปยัง WillpopScope ซึ่งจะทำงานตอนคลิกปุ่มลูกศรกลับไปยังหน้าที่แล้วที่เข้ามา
// ข้อมูลที่ส่งไป เอาตามรูปแบบของข้อสอบที่เป็นไฟล์ html ซึ่งประกอบไปด้วย
// จำนวนข้อทั้งหมด, ข้อปัจจุบันที่คลิก, ชื่อ id และ วันที่
// ข้อมูลที่จะเอาไปทำ ไอคอน คือ จำนวนข้อทั้งหมด และข้อที่คลิก ซึ่งเป็นชื่อ id โดยที่ Willpop จะแยกเอาเฉพาะตัวเลข
//  ทำข้อที่ 10 จากจำนวนทั้งหมด 10 ข้อ จึงได้ 100% ได้ไอคอนชื่อ p00.png คือ มีเครื่องหมายถูก แสดงว่า เสร็จแล้ว

// var msgToSend = numOfQuestions + "xzc" + currQstnID + clickedQstns;

var args = numOfQuestions + "xzc" + currQstnID + clickedQstns;

console.log("zz messege to Flutter via messageHandler: " + args);


// ระวังตรงนี้ เวลา copy มาจาก Notebook มันคอมเม้นออก ต้องเอามาใส่ ไม่งั้นไม่รับข้อมูลจาก Flutter
// ส่งข้อมูลไป flutter ผ่าน JavascriptChannel ชื่อ messageHandler เพื่อบอกว่า ทำเสร็จแล้ว
 //messageHandler.postMessage(msgToSend);  // *****************************

 window.flutter_inappwebview.callHandler('messageHandler', ...args)
.then(function (result) {
// รับค่าที่ส่งเข่ามา
    console.log("isBuyAndMode จาก Flutter to JS via messageHandler: " + result.Message);
    isBuyAndMode(result.Message);
});




// รับข้อมูลมาจาก flutter
function isBuyAndMode(myDat){
var inComingData = myDat;

var isPremium; // ซื้อแล้ว
var is_darkMode;
var htmlMode; // มืดหรือสว่าง

var element = document.body; // สำหรับเปลี่ยนโหมด มืด-สว่าง โดยเปลี่ยนสี background และ ตัวหนังสือ
var hex = ("#00FF00");  // สำหรับเปลี่ยนสีลิงค์

 // alert("buy already?");

// แยก การซื้อ และโหมด ที่ส่งเข้ามา คั่นด้วย xyz
// เรื่องซื้อ ไม่ต้องเชค เพราะกันไว้แล้วว่า ถ้ายังไม่ซื้อ ไม่ให้เข้ามาทำข้อสอบที่นี
datArr = myDat.split("xyz");   //datArr[0] คือ ซื้อแล้วหรือยัง true=ซื้อแล้ว  datArr[1] คือ โหมดมือหรือไม่  true=ใช่โหมดมืด  false=ไม่ใช่โหมดมืด

is_Bought = datArr[0];

//alert("datArr buy already? " +  is_Bought);


// ไม่ต้องเชคแล้ว เพราะถ้ายังไม่ซื้อ ไม่ให้เข้ามาที่นี่เลย
//var demo = document.getElementById("demo_version");  // บางไฟล์มี  div ชื่อ demo_version ต้องซ่อน ถ้าซื้อแล้ว
//var full = document.getElementById("full_version");
//var fadeout = document.getElementById("fadeout");

classRoundedCorner = document.getElementsByClassName('rcorners1');
if (classRoundedCorner.length >= 1) {
    for (var i = 0; i < classRoundedCorner.length; i++){
        classRoundedCorner[i].style.borderColor = '#FDEAB3';
    };
 };
classBigBlue  = document.getElementsByClassName('big_blue');
if (classBigBlue.length >= 1) {
    for (var i = 0; i < classBigBlue.length; i++){
        classBigBlue[i].style.color = '#FBD052';
    };
};
classBigRed = document.getElementsByClassName('big_red');
if (classBigRed.length >= 1) {
    for (var i = 0; i < classBigRed.length; i++){
        classBigRed[i].style.color = '#FFC300';
    };
};
//
//// แยก การซื้อ และโหมด ที่ส่งเข้ามา คั่นด้วย xyz
//// เรื่องซื้อ ไม่ต้องเชค เพราะกันไว้แล้วว่า ถ้ายังไม่ซื้อ ไม่ให้เข้ามาทำข้อสอบที่นี
//datArr = myDat.split("xyz");   //datArr[0] คือ ซื้อแล้วหรือยัง true=ซื้อแล้ว  datArr[1] คือ โหมดมือหรือไม่  true=ใช่โหมดมืด  false=ไม่ใช่โหมดมืด
//
//is_Bought = datArr[0];
//alert("buy already?" +  is_Bought);

// ปรับโหมด มืด-สว่าง
is_darkMode = datArr[1];

// alert("is_darkMode \n(true = โหมดมืด, false = โหมดสว่าง) :" + is_darkMode);

if (is_darkMode == "true"){
    htmlMode = "dark";
 }else{
         htmlMode = "light";
     }

if (htmlMode=="dark"){ // ถ้าอยู่ในโหมด มืด
element.style.backgroundColor = 'black';
element.style.color = 'white';
// alert("htmlMode: "+ htmlMode);

 // กรอบล้อมรอบ คำถาม
 var tableBorder = document.getElementById("listingTable");
 tableBorder.style.borderColor = "gray";

 // กรอบล้อมรอบ คำตอบ
  var show_Answer = document.getElementById("showAnswer");
  show_Answer.style.borderColor = "gray";


// พื้นหลังเลขข้อ
var numBkg = document.getElementById('qa_item_num');  // เลขข้อ ใน Q&A
numBkg.style.backgroundColor = '#818589';  // gun metal grey
var bottomMenu =  document.getElementById('footer');
bottomMenu.style.backgroundColor = '#001C57';  // น้ำเงินเข้ม เกือบดำ oxford blue

var msgForNonByr =  document.getElementById('msgForNon-buyers');  // ให้ซื้อ
msgForNonByr.style.color = "#FFC0CB";  // ชมพู

// ปุ่ม แสดง/ซ่อน ตัวเลือก
var optnBttn = document.getElementById('show_options');
        optnBttn.style.backgroundColor = "#B2BEB5";
        optnBttn.style.color = "white";


// ถ้าอยู่ในโหมดมืด เปลี่ยนสีลิงค์ ให้สว่างขึ้น
    var links = document.getElementsByTagName("a");
    if(links !== null){
    for(var i=0;i<links.length;i++)
    {
        if(links[i].href)
        {
            links[i].style.color = hex;
        }
    }
    } // end of if(links !==

//  เปลี่ยนพื้นหลัง modal-content ที่แสดงผลการทำข้อสอบ
//var modalContent = document.getElementsByClassName("modal-content")[0];
//  alert("modalContent: " + modalContent);
//modalContent.style.backgroundColor = '#808080';

 // change background color of timer wraper
//var timerWrapper = document.getElementsByClassName("timer_wrapper");
//if (timerWrapper.length >= 1) {
//    for (var i = 0; i < timerWrapper.length; i++){
//        timerWrapper[i].style.backgroundColor = '#808080';
//    };
    // change timer font color from red to white
//    var time = document.getElementById("timer");
//    time.style.color = '#FFFFFF';
// };
//  เปลี่ยนสีพื้นตาราง ไม่เสถียร เลยไม่เปลี่ยน แก้เป็นสีน้ำตาลใน css แทน ใช้ทั้งสองโหมด
// ไม่เสถียร เพราะ ตอน run ครั้งแรก javascript ทำงานก่อน จึงไม่เจอตาราง ต้องเอา javascript ไปไว้ตอนท้าย เพื่อให้ทั้งหน้า load ให้เสร็จเรียบร้อยเสียก่อน
//// // qstn-div
var qstn_div = document.getElementsByClassName("qstn-div");
//   alert("qstn_div length: " + qstn_div.length);
 if (qstn_div.length >= 1) {
     for (var i = 0; i < qstn_div.length; i++){
  //   alert("qstn_div number: " + i);
         qstn_div[i].style.backgroundColor = '#4f4f4f';
     };
  };



    // change background color of table
     var tableElements = document.getElementsByTagName("table");
       if (tableElements.length >= 1) {
      for(var i = 0; i < tableElements.length; i++){
          var thisTable = tableElements[i] ;
          var rows = thisTable.getElementsByTagName("tr") ;
      		for (var j=0; j<rows.length; j++) {
      				rows[j].style.backgroundColor = "gray";
      		}
     		}
      	}




//  // change table row background
//  var tableElements = document.getElementsByTagName("table");
//   //    alert("table length: " + tableElements.length);
//  for(var i = 0; i < tableElements.length; i++){
//      var thisTable = tableElements[i];
//      var rows = thisTable.getElementsByTagName("tr") ;
//  //   alert("rows length: " + rows.length);
//  		for (var j=0; j<rows.length; j++) {
//  	//	     alert("what rows: " + j);
//  		rows[j].style.backgroundColor = "#5f5f5f";
//        }
//  	}  // end of for(var i = 0; i < tableElements

}else{  // ถ้าอยู่ในโหมด สว่าง
element.style.backgroundColor = 'white';
element.style.color = 'black';
}
}  // end of  isBuyAndMode(myDat)



// ***********************

function result() {
  var score = 0;
  not_correct.length = 0;
  correct_qstns.length = 0;
  skipped_qstns.length = 0;

	count = 0;

var node_list = document.getElementsByTagName('input');
 var count  = 0;
for (var i = 0; i < node_list.length; i++) {

 // หา node ที่เป็น radio button และที่ถูกเลือกด้วย
 if (node_list[i].type == 'radio' && node_list[i].checked) {
            count++;
        }
    }

var node_quiz = document.getElementsByClassName("quiz");
var this_qstn_score;

var num_of_qstns = node_quiz.length;
for (var i = 0; i < num_of_qstns; i++) {

checkForSkipped("q"+(i+1));

this_qstn_score =parseInt(getSelectedRadioValue("q"+(i+1))) || 0;
score += this_qstn_score;
 }




// จำนวนข้อที่ไม่ได้ทำ
var notChecked = num_of_qstns - count;

if(not_correct.length !== 0)
	{
	/*
	message = "คะแนนของท่าน: " + score + "  คะแนน หรือเท่ากับ  " + parseFloat((score /num_of_qstns)*100).toFixed(2) + " &#37; <br>ข้อที่ทำถูก: " + correct_qstns.toString() + "<br>ข้อที่ทำผิด: " + not_correct.toString();
	*/
	message = "คะแนนของท่าน: " + score + "  คะแนน หรือเท่ากับ  " + parseFloat((score /num_of_qstns)*100).toFixed(2) + " &#37;<br>ข้อที่ทำผิด: " + not_correct.toString();

	}else{
    message = "คะแนนของท่าน: " + score + "  คะแนน หรือเท่ากับ   " + parseFloat((score /num_of_qstns)*100).toFixed(2) + " &#37;"
	};

// ถ้ามีการไม่ทำบางข้อ ให้แสดงข้อมูลใน feedback ด้วย
	if (notChecked > 0)
	{
		message = message + "<br><br>ไม่ได้ทำข้อสอบ จำนวน " + notChecked + " ข้อ ได้แก่ " + skipped_qstns.toString() + "<br><br>ท่านสามารถปิดหน้าจอนี้ เพื่อกลับไปแก้ข้อผิด หรือทำต่อให้ครบ แล้วกดปุ่ม ส่งคำตอบ อีกครั้ง"
	}

// หยุดการจับเวลา
//		pauseCountDown();

//if (min > 0 && hour == 0)
//{
//	message = message +"<br><br>ใช้เวลาทำข้อสอบ " + min + " นาที";
//
//if (min > 0 && hour > 0)
//{
//	message = message +"<br><br>ใช้เวลาทำข้อสอบ " + hour + " ช.ม. " + min + " นาที";
//}

// แสดง feedback ใน id myMessage ของไฟล์ html ที่เรียกใช้งาน
		document.getElementById("myMessage").innerHTML = message;
		modal.style.display = "block";

//alert (message);

// ป้องกันไม่ให้หน้าจอเลื่อนไปข้างบน
 return false;
}

function checkForSkipped(name){
  var is_skipped=0;

  var radios = document.getElementsByName(name);

 var thisQstn = " ข้อ " + name.substr(1);

    for (var i = 0; i < radios.length; i++) {
			if (radios[i].checked){  //ถ้าไม่มีการเลือกข้อนี้
			is_skipped++; // เก็บข้อมูลข้อที่ข้าม ไม่ได้ทำ
	}	}

   if (is_skipped==0){  //ถ้าไม่มีการเลือกข้อนี้
			skipped_qstns.push(thisQstn); // เก็บข้อมูลข้อที่ข้าม ไม่ได้ทำ
	}
}


function getSelectedRadioValue(name) {
  var radios = document.getElementsByName(name);
  var thisQstn = " ข้อ " + name.substr(1);

  for (var i = 0; i < radios.length; i++) {

    if (radios[i].checked) {
		if(radios[i].value==0){
			// เก็บข้อที่ทำผิดไว้ใน array ชื่อ not_correct เพื่อจะนำไปแสดงใน feedback ด้วย
			not_correct.push(thisQstn);
		}else{
			// เก็บข้อที่ทำถูกไว้ใน array ชื่อ	correct_qstns เพื่อจะนำไปแสดงใน feedback ด้วย
			correct_qstns.push(thisQstn);
		}




      return radios[i].value;
    }

  }
}

/* for sequential numbers */
//
//var current = document.getElementById('default');
//
//  function highlite(el)
//  {
//     if (current != null)
//     {
//         current.className = "";
//     }
//     el.className = "highlite";
//     current = el;
//  }
//



function prevPage()
{
var showIt = document.getElementById("showAnswer");
showIt.style.display = 'none';
//var showMsg = document.getElementById("myMessage");
//showMsg.style.display = 'none';
// resetCountDown();
//document.getElementById('myInput').value = '';
// countDown(0,00,05)
    if (current_page > 1) {
        current_page--;
        changePage(current_page, true, thisJson);
    }
}

function nextPage()
{
var showIt = document.getElementById("showAnswer");
showIt.style.display = 'none';
//var showMsg = document.getElementById("myMessage");
//showMsg.style.display = 'none';
// countDown(0,00,05)
//resetCountDown();
//document.getElementById('myInput').value = '';
    if (current_page < numPages()) {
        current_page++;
        changePage(current_page, true, thisJson);
    }
}

function showItAns()
{

	//pauseCountDown();
    var showIt = document.getElementById("showAnswer");
//	showIt.innerHTML =  "คำตอบคือ: " + thisJson[current_page-1].answer + "<br>";
	showIt.innerHTML = thisJson[current_page-1].answer + "<br>";
	showIt.style.display = 'block';
}


function changeData(myJason){

// alert("data: " + myJason);
switch (myJason) {

case "good_govt":
//    document.getElementById('myInput').value = '';  // ลบที่พิมพ์คำตอบก่อนหน้านี้ ในช่อง input
	document.getElementById('showAnswer').style.display ='none';  // ซ่อนเฉลยที่ปรากฎอยู่
   thisJson =  good_govt;  // เอาไปใช้ สำหรับให้ฝึก
	//current_page = 1;  // เริ่มที่หน้า 1
    changePage(1, false, thisJson);  // ส่งข้อมูลไปแสดง หน้า, ยังไม่เริ่มจับเวลา(เพราะเพิ่งเข้ามา), ไฟล์ข้อมูลที่เลือก
    break;

	case "principlesOfGoodGovt":
//    document.getElementById('myInput').value = '';  // ลบที่พิมพ์คำตอบก่อนหน้านี้ ในช่อง input
	document.getElementById('showAnswer').style.display ='none';  // ซ่อนเฉลยที่ปรากฎอยู่
   thisJson =  principles_of_good_govt;  // เอาไปใช้ สำหรับให้ฝึก
 //  alert("thisJason: " + thisJson);
	//current_page = 1;  // เริ่มที่หน้า 1
    changePage(1, false, thisJson);  // ส่งข้อมูลไปแสดง หน้า, ยังไม่เริ่มจับเวลา(เพราะเพิ่งเข้ามา), ไฟล์ข้อมูลที่เลือก
    break;
default:
  	// clear input field
 //   document.getElementById('myInput').value = '';
	document.getElementById('showAnswer').style.display ='none';
//	shuffle(objJsonSimple);
    thisJson =  good_govt;
	current_page = 1;
    changePage(1, false, thisJson);
}
}

function goToPage(whatPage, whatData){  //สำหรับ ไปหน้าแรก หน้าสุดท้าย หรือหน้าที่ระบุ
var pos;

//    document.getElementById('myInput').value = '';  // ลบที่พิมพ์คำตอบก่อนหน้านี้ ในช่อง input
   document.getElementById('showAnswer').style.display ='none';  // ซ่อนเฉลยที่ปรากฎอยู่
   thisJson =  whatData;  // เอาไปใช้ สำหรับให้ฝึก
   if(whatPage == "start"){
   pos = 1;
   current_page = 1;
   }else if(whatPage == "end"){
   pos = thisJson.length;
   current_page = pos;
   }else if(whatPage == "specify"){
    var goPageNum = document.getElementById("itemToGo").value;
         if((goPageNum > thisJson.length-1)||(goPageNum < 1)){
            alert("ไม่พบเลขข้อที่ท่านระบุ");
    		return;
         }else{
            pos = goPageNum;
            current_page = pos;
            }
       }
  // alert("go Page: " + pos);
	//current_page = 1;  // เริ่มที่หน้า 1
    changePage(pos, false, thisJson);  // ส่งข้อมูลไปแสดง หน้า, ยังไม่เริ่มจับเวลา(เพราะเพิ่งเข้ามา), ไฟล์ข้อมูลที่เลือก
//    break;
}

function changePage(page, isStartTiming, myJason)
{
let order = getRadioCheckedValue("isOrder");
let autoShowAns =  getRadioCheckedValue("isShowAns");

// alert("order: " + order + "\nisShow: " + autoShowAns);
// alert("data in changePage: " + myJason[1].question);
var notShuffled_json = myJason;

    var btn_next = document.getElementById("btn_next");
    var btn_last = document.getElementById("go_last");
    var btn_prev = document.getElementById("btn_prev");
    var btn_first = document.getElementById("go_first");

    var listing_table = document.getElementById("listingTable");
    var page_span = document.getElementById("page");
	var orderBtn =  document.getElementById("fromStartToEnd");
	var orderBtnLabel =  document.getElementById("fromStartToEndLabel");
	var showAnsDiv = document.getElementById("forBtnShowAns");
//    alert("xxx buy already? " +  is_Bought + " page: " + page);

	if (order == 'no'){
        if(firstQuestion !== myJason_shuffled[0]){ // สลับเพียงครั้งเดียว ต่อการใช้งาน
            shuffle(myJason);  // เอา list ข้อมูล มาสลับเสียใหม่ ไม่ให้เรียงลำดับ
        //    alreadyShuffled = true;
            myJason_shuffled = myJason;
            firstQuestion = myJason_shuffled[0];
        }else{  // ไม่สลับใหม่ แต่ ใช้ที่เคยสลับแล้ว
              myJason = myJason_shuffled;
        }
 //  orderBtn.disabled = true;
 //  orderBtnLabel.style.color = '#a6a6a6';
           //   alert(thisJson[5].id);
	}else{
            myJason.sort(function(a, b) {
                 return parseFloat(a.id) - parseFloat(b.id); // เรียงตาม id จากน้อย ไป มาก
             });
         //    alert(thisJson[5].id);
	//myJason = notShuffled_json
	}

if(autoShowAns == 'no'){
//	alert("current_page: " + current_page);
showItAns()  // แสดงเลย ไม่ต้องคลิก
const ans_btn = document.getElementById('showAnswer_btn');  // เบลอ gray out ปุ่มแสดงคำตอบ
ans_btn.style.display = "none";
}else{
const ans_btn = document.getElementById('showAnswer_btn');  // เบลอ gray out ปุ่มแสดงคำตอบ
ans_btn.style.display = "block";

}

// เวลาจะใช้จริง ให้กำหนดเป็น 15
 //if((is_Bought == "false") && (page >=200)){

 if((is_Bought == "false") && (current_page >=15)){
 // alert("xxxx");
  var ans_btn = document.getElementById('showAnswer_btn');
  ans_btn.disabled = true;
  var ans_div = document.getElementById('showAnswer');
  ans_div.style.display = 'none';
  var msgForNon = document.getElementById('msgForNon-buyers');
  msgForNon.style.display = 'block';

  }



// if (isStartTiming == true)
// {
// countDown(0,02,0)
// }
    // Validate page
if (page < 1) page = 1;
    if (page > numPages()) page = numPages();

    listing_table.innerHTML = "";

//    for (i = (page-1) * records_per_page; i < (page * records_per_page) && i < objJson.length; i++) {
//        listing_table.innerHTML += objJson[i].number  + "<br>";
//    }
//alert("data before iteration i : " + myJason[1].question);
	    for (i = (page-1) * records_per_page; i < (page * records_per_page) && i < myJason.length; i++) {
        listing_table.innerHTML += myJason[i].question  + "<br>";
    }
    page_span.innerHTML = page + "/" + numPages();

    if (page == 1) {
    btn_prev.disabled = true;
    btn_first.disabled = true;
     //   btn_prev.style.visibility = "hidden";
      //  btn_first.style.visibility = "hidden";
    } else {
        btn_prev.disabled = false;
        btn_first.disabled = false;
     //   btn_prev.style.visibility = "visible";
      //  btn_first.style.visibility = "visible";
    }

    if (page == numPages()) {
     btn_next.disabled = true;
     btn_last.disabled = true;
        //btn_next.style.visibility = "hidden";
       // btn_last.style.visibility = "hidden";
    } else {
         btn_next.disabled = false;
         btn_last.disabled = false;
//        btn_next.style.visibility = "visible";
//        btn_last.style.visibility = "visible";
    }
}

function numPages()
{
//    return Math.ceil(objJson.length / records_per_page);
	  return Math.ceil(thisJson.length / records_per_page);
}

function showOptions(){
var options = document.getElementById("nav");
btn = document.getElementById('show_options');
  if (options.style.display === "none") {
    options.style.display = "block";
	btn.textContent = 'ซ่อนตัวเลือกการใช้งาน';
	btn.style.color = "red";
  } else {
    options.style.display = "none";
	btn.textContent = 'แสดงตัวเลือกการใช้งาน';
	btn.style.color = "";
  }
}





/*for timer
var myVar = 0;*/
//var hour,min,sec;
//var isPause=false;
//var css_start = "display = inline; position: relative; top: 1px; font-size: 20px; font-weight: bold; min-width: 70px; min-height: 10px;";
//var pause_btn = "display = inline; position: relative; top: 1px; font-size: 20px; font-weight: bold; color: red; min-width: 70px; min-height: 10px;";
//var css_btns = "display = inline; position: relative; top: 1px; font-size: 20px; font-weight: bold; min-width: 70px; min-height: 10px;";
//var css_disp_none = "display:none; position: relative; top: 1px; font-size: 20px; font-weight: bold; min-width: 70px; min-height: 10px;";
//var css_row = "position: relative; top: 1px;";


//function countDown(h,m,s){

//document.getElementById("start").style.cssText = css_disp_none;
//document.getElementById("pause").style.cssText = pause_btn;
//document.getElementById("reset").style.cssText = css_btns;
// document.getElementById("row").style.cssText = css_row;

//if (isPause==false)
//{
//	hour = 0;
//	min=0;
//	sec=1;
//}

//if (hour >= h && min >= m && sec >=0)
//{
//	hour = 0;
//	min=0;
//	sec=1;
//}

//myVar = setInterval(function(){

  //     document.getElementById("timer").innerHTML = hour +" : " + min +" : " + sec ;
//       sec++;
//		if(hour == h && min == m && sec == (s+1)){
//			document.getElementById("start").style.cssText = css_start;
//			document.getElementById("pause").style.cssText = css_disp_none;
//			document.getElementById("reset").style.cssText = css_btns;
		//	document.getElementById("row").style.cssText = css_row;

			message = "<strong><font color=\"red\">หมดเวลา </font></strong><br>";
			// แสดง feedback ใน id myMessage ของไฟล์ html ที่เรียกใช้งาน
//			document.getElementById("myMessage").innerHTML = message;
//			modal.style.display = "block";


			// alert("time's up");

//			clearInterval(myVar);
//			return;
//		}

//       if(sec == 60)
//       {
 //        min++;
 //        //sec = 60;
//		 sec = 0;
 //        if (min == 60)
   //      {
	//		 hour++;
//			 //min = 60;
//			 min = 0;
//			 if (hour == h)
//			 {
//				 hour = h;
//
//			 }

//         }
 //      }
  //    },1000);
//    }

function shuffle(array) {
  let currentIndex = array.length,  randomIndex;
  // While there remain elements to shuffle.
  while (currentIndex != 0) {
    // Pick a remaining element.
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex--;
    // And swap it with the current element.
    [array[currentIndex], array[randomIndex]] = [
      array[randomIndex], array[currentIndex]];
  }
  return array;
}




function getRadioCheckedValue(radio_name)
{
   var oRadio = document.forms[0].elements[radio_name];

   for(var i = 0; i < oRadio.length; i++)
   {
      if(oRadio[i].checked)
      {
         return oRadio[i].value;
      }
   }
   return '';

}

function shuffle(array) {
  let currentIndex = array.length,  randomIndex;
  // While there remain elements to shuffle.
  while (currentIndex != 0) {
    // Pick a remaining element.
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex--;
    // And swap it with the current element.
    [array[currentIndex], array[randomIndex]] = [
      array[randomIndex], array[currentIndex]];
  }
  return array;
}

function getRadioCheckedValue(radio_name)
{
   var oRadio = document.forms[0].elements[radio_name];

   for(var i = 0; i < oRadio.length; i++)
   {
      if(oRadio[i].checked)
      {
         return oRadio[i].value;
      }
   }
   return '';

}

/*!
 * swiped-events.js - v@version@
 * Pure JavaScript swipe events
 * https://github.com/john-doherty/swiped-events
 * @inspiration https://stackoverflow.com/questions/16348031/disable-scrolling-when-touch-moving-certain-element
 * @author John Doherty <www.johndoherty.info>
 * @license MIT
 */
(function (window, document) {

    'use strict';

    // patch CustomEvent to allow constructor creation (IE/Chrome)
    if (typeof window.CustomEvent !== 'function') {

        window.CustomEvent = function (event, params) {

            params = params || { bubbles: false, cancelable: false, detail: undefined };

            var evt = document.createEvent('CustomEvent');
            evt.initCustomEvent(event, params.bubbles, params.cancelable, params.detail);
            return evt;
        };

        window.CustomEvent.prototype = window.Event.prototype;
    }

    document.addEventListener('touchstart', handleTouchStart, false);
    document.addEventListener('touchmove', handleTouchMove, false);
    document.addEventListener('touchend', handleTouchEnd, false);

    var xDown = null;
    var yDown = null;
    var xDiff = null;
    var yDiff = null;
    var timeDown = null;
    var startEl = null;

    /**
     * Fires swiped event if swipe detected on touchend
     * @param {object} e - browser event object
     * @returns {void}
     */
    function handleTouchEnd(e) {

        // if the user released on a different target, cancel!
        if (startEl !== e.target) return;

        var swipeThreshold = parseInt(getNearestAttribute(startEl, 'data-swipe-threshold', '20'), 10); // default 20px
        var swipeTimeout = parseInt(getNearestAttribute(startEl, 'data-swipe-timeout', '500'), 10);    // default 500ms
        var timeDiff = Date.now() - timeDown;
        var eventType = '';
        var changedTouches = e.changedTouches || e.touches || [];

        if (Math.abs(xDiff) > Math.abs(yDiff)) { // most significant
            if (Math.abs(xDiff) > swipeThreshold && timeDiff < swipeTimeout) {
                if (xDiff > 0) {
                    eventType = 'swiped-left';
                }
                else {
                    eventType = 'swiped-right';
                }
            }
        }
        else if (Math.abs(yDiff) > swipeThreshold && timeDiff < swipeTimeout) {
            if (yDiff > 0) {
                eventType = 'swiped-up';
            }
            else {
                eventType = 'swiped-down';
            }
        }

        if (eventType !== '') {

            var eventData = {
                dir: eventType.replace(/swiped-/, ''),
                touchType: (changedTouches[0] || {}).touchType || 'direct',
                xStart: parseInt(xDown, 10),
                xEnd: parseInt((changedTouches[0] || {}).clientX || -1, 10),
                yStart: parseInt(yDown, 10),
                yEnd: parseInt((changedTouches[0] || {}).clientY || -1, 10)
            };

            // fire `swiped` event event on the element that started the swipe
            startEl.dispatchEvent(new CustomEvent('swiped', { bubbles: true, cancelable: true, detail: eventData }));

            // fire `swiped-dir` event on the element that started the swipe
            startEl.dispatchEvent(new CustomEvent(eventType, { bubbles: true, cancelable: true, detail: eventData }));
        }

        // reset values
        xDown = null;
        yDown = null;
        timeDown = null;
    }

    /**
     * Records current location on touchstart event
     * @param {object} e - browser event object
     * @returns {void}
     */
    function handleTouchStart(e) {

        // if the element has data-swipe-ignore="true" we stop listening for swipe events
        if (e.target.getAttribute('data-swipe-ignore') === 'true') return;

        startEl = e.target;

        timeDown = Date.now();
        xDown = e.touches[0].clientX;
        yDown = e.touches[0].clientY;
        xDiff = 0;
        yDiff = 0;
    }

    /**
     * Records location diff in px on touchmove event
     * @param {object} e - browser event object
     * @returns {void}
     */
    function handleTouchMove(e) {

        if (!xDown || !yDown) return;

        var xUp = e.touches[0].clientX;
        var yUp = e.touches[0].clientY;

        xDiff = xDown - xUp;
        yDiff = yDown - yUp;
    }

    /**
     * Gets attribute off HTML element or nearest parent
     * @param {object} el - HTML element to retrieve attribute from
     * @param {string} attributeName - name of the attribute
     * @param {any} defaultValue - default value to return if no match found
     * @returns {any} attribute value or defaultValue
     */
    function getNearestAttribute(el, attributeName, defaultValue) {

        // walk up the dom tree looking for attributeName
        while (el && el !== document.documentElement) {

            var attributeValue = el.getAttribute(attributeName);

            if (attributeValue) {
                return attributeValue;
            }

            el = el.parentNode;
        }

        return defaultValue;
    }

}(window, document));

// แก้ปัญหา Samsung blank screen

//document.addEventListener('DOMContentLoaded', () => {
//  const secondDiv = document.getElementById('second_div');
//  console.log(document.getElementById('second_div'));
//  if (secondDiv) {
//    secondDiv.scrollIntoView();
//  }
//});
//
//document.addEventListener('DOMContentLoaded', () => {
//  const firstDiv = document.getElementById('first_div');
//  console.log(document.getElementById('first_div'));
//  if (firstDiv) {
//    firstDiv.scrollIntoView();
//  }
//});

