//var isPremiumVersion = "false";    // ถ้าใช้บน PC เพราะเรียกจาก Android  ไม่ได้ ค่าที่ส่งเข้ามา คือ  true  หรือ  false
 //var isPremiumVersion = Android.getIsFullVersion(); // เรียก method จาก android class ชื่อ JavaScriptInterface    ค่าที่ส่งเข้ามา คือ  true  หรือ  false

// วันนี้เรียนรู้อีกอย่าง เรื่องการรับส่งข้อมูลระหว่าง flutter - javascript
// ประเด็นคือ ต้องอยู่ใน JavascriptChannel เดียวกัน เช่น ไฟล์นี้ full_exam.js
// ส่งข้อมูลไปทาง MessageHandler ก็ต้องสร้างฟังก์ชัน isBuyAndMode เพื่อรับข้อมูล
// จะไปสร้าง is_IsNewClicked เพื่อรับข้อมูลไม่ได้ เพราะอยู่คนละ Channel กัน
// หาอยู่ตั้งนานว่า ผิดตรงไหน เพราะ flutter ไม่บอกว่ามี error เพียงแต่ไม่มีค่าตัวแปรที่ส่งมาให้

var isPremiumVersion;
var correct_qstns = [];
var not_correct = [];
var skipped_qstns = [];
var message;
var count;
var hour=0;
var min=0;
var sec=0;
var myVar = 0;  // for timer setInterval
var is_Bought;
var current_page = 1;
var records_per_page = 1;
var thisJson = [];
var alreadyShuffled = false;
var myJason_shuffled = [];
var firstQuestion ="";

// แก้ปัญหา Samsung ไม่แสดงหน้าเว็บ ออกเป็นหน้าว่างหรือสีดำ

//setTimeout(() => {
//  const secondDiv = document.getElementById('second_div');
//  if (secondDiv) {
//    secondDiv.scrollIntoView();
//  }
//}, 100); // Wait for rendering
//
//setTimeout(() => {
//  const firstDiv = document.getElementById('first_div');
//  if (firstDiv) {
//    firstDiv.scrollIntoView();
//  }
//}, 100); // Wait for rendering

//document.addEventListener('DOMContentLoaded', () => {
//  const secondDiv = document.getElementById('second_div');
//  console.log(document.getElementById('second_div'));
//  if (secondDiv) {
//    secondDiv.scrollIntoView();
//  }
//});
//
//document.addEventListener('DOMContentLoaded', () => {
//  const firstDiv = document.getElementById('first_div');
//  console.log(document.getElementById('first_div'));
//  if (firstDiv) {
//    firstDiv.scrollIntoView();
//  }
//});


document.addEventListener('swiped', function(e) {
    console.log(e.target); // the element that was swiped
    console.log(e.detail.dir); // swiped direction
});

document.addEventListener('swiped-left', function(e) {
  //  console.log(e.target); // the element that was swiped
	//alert('swiped left!')
	if (current_page < numPages()) {
	nextPage();
	}
});

document.addEventListener('swiped-right', function(e) {
   // console.log(e.target); // the element that was swiped
	//alert('swiped right!')
	if(current_page > 1){
	prevPage();
	}
});
//
//var clicks = 0;
//var timer, timeout = 350; // time between each click
//
var doubleClick = function(e) {
  console.log('doubleClick!!');
  console.log('doubleClick!!' + e.target);
  goToPage('start', thisJson);
}

var tripleClick = function(e) {
  console.log('tripleClick!!');
  goToPage('end', thisJson);
}

TOUCH_TIMEOUT_MILLISECONDS = 500;
touch_count = 0;

window.document.querySelector('body').addEventListener('touchstart', function(evt){
    touch_count += 1;

    setTimeout(function(){
    touch_count=0
    }, TOUCH_TIMEOUT_MILLISECONDS);
    if(touch_count==2) doubleClick(evt);
    if(touch_count==3) tripleClick(evt);
evt.preventDefault();
});

// on page load





//// click timer
//document.querySelector('body').addEventListener('touchend', function(e) {
//  clearTimeout(timer);
//  clicks++;
//  var evt = e;
//  timer = setTimeout(function() {
//    if(clicks==2) doubleClick(evt);
//    if(clicks==3) tripleClick(evt);
//    clicks = 0;
//  }, timeout);
//});

// swiped-up down มันยุ่งกับ เลื่อนหน้าจอ ขึ้นลง เลยคิดว่า เอาออกดีกว่า

//
//document.addEventListener('swiped-up', function(e) {
//   // console.log(e.target); // the element that was swiped
//	//alert('swiped right!')
//	//if(current_page > 1){
//	//prevPage();
//	//}
//		goToPage('end', thisJson);
//});
//
//document.addEventListener('swiped-down', function(e) {
//   // console.log(e.target); // the element that was swiped
//	//alert('swiped right!')
////	if(current_page > 1){
//	//prevPage();
//	//}
//		goToPage('start', thisJson);
//});

var objJsonSimplexx = [
{number:"111_simple", answer: "111xx"},
{number:"222", answer: "222xx"},
{number:"333", answer: "333xx"},
{number:"444", answer: "xxx"},
]


var principles_of_good_govt = [
{ "id" : "1", "question" : "จุดมุ่งหมาย ในการตราพระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙ คืออะไร",  "answer" : "เพื่อให้การปฏิบัติราชการทางปกครองมีความโปร่งใส เป็นกลาง เป็นธรรม และมีประสิทธิภาพ โดยเฉพาะเรื่อง การออกคำสั่งทางปกครองของเจ้าหน้าที่ ซึ่งมีผลกระทบต่อสิทธิ และเสรีภาพของประชาชน (หมายเหตุ ตอนท้ายพระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙)"},
{ "id" : "2", "question" : "เหตุผล ในการตราพระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง (ฉบับที่ ๓) พ.ศ. ๒๕๖๒ คืออะไร",  "answer" : "กฎหมายว่าด้วยวิธีปฏิบัติราชการทางปกครอง ยังไม่มีประสิทธิภาพในการบังคับใช้ โดยเฉพาะเรื่อง วิธีการยึด การอายัด และการขายทอดตลาดทรัพย์สิน ไม่มีรายละเอียดวิธีปฏิบัติ และระยะเวลาในการบังคับทางปกครองที่ชัดเจน ซึ่งก่อให้เกิดความไม่เป็นธรรม แก่ผู้อยู่ในบังคับของมาตรการบังคับทางปกครอง ประกอบกับเจ้าหน้าที่ ของหน่วยงานของรัฐส่วนใหญ่ ไม่มีความเชี่ยวชาญในการยึด การอายัด และการขายทอดตลาดทรัพย์สิน อีกทั้งไม่มีบทบัญญัติที่ให้อำนาจแก่เจ้าหน้าที่ ในการสืบหาทรัพย์สิน และมอบหมายให้หน่วยงานอื่น หรือเอกชนดำเนินการแทนได้ ส่งผลให้ไม่สามารถบังคับตามคำสั่งทางปกครอง ที่กำหนดให้ชำระเงินได้อย่างมีประสิทธิภาพ และรัฐต้องสูญเสียรายได้ในที่สุด (หมายเหตุ ตอนท้ายพระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง ฉบับที่ ๓ พ.ศ. ๒๕๖๒)"},
{ "id" : "3", "question" : "ผู้ที่จะต้องอยู่ภายใต้บังคับของกฎหมาย พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙ คือใคร ",  "answer" : "เจ้าหน้าที่ของหน่วยงานของรัฐ ที่มีอำนาจในการทำคำสั่งทางปกครอง"},
{ "id" : "4", "question" : "การดำเนินงานของ มหาเถรสมาคม อยู่ภายใต้การบังคับของ พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙  หรือไม่",  "answer" : "มหาเถรสมาคม เป็นองค์การทางศาสนา จึงไม่อยู่ในบังคับของ พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙ (มาตรา ๔)"},
{ "id" : "5", "question" : "การดำเนินงานเกี่ยวกับราชการทหาร อยู่ภายใต้การบังคับของ พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙  หรือไม่",  "answer" : "ไม่อยู่ในบังคับของ พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙ (มาตรา ๔)"},
{ "id" : "6", "question" : "คำสั่งเจ้าคณะจังหวัด เรื่อง แต่งตั้งเจ้าอาวาส เป็นคำสั่งทางปกครอง หรือไม่",  "answer" : "ไม่เป็น เพราะเป็นกิจกรรมขององค์การทางศาสนา  (มาตรา ๔)"},
{ "id" : "7", "question" : " ประกาศของเทศบาลเมืองปากช่องและนายกเทศมนตรีเมืองปากช่อง เรื่อง ประมูลรถยนต์บรรทุกเอนกประสงค์และรถยนต์บรรทุกขยะมูลฝอย เป็นคำสั่งทางปกครอง หรือไม่",  "answer" : "เป็นคำสั่งทางปกครอง (คําสั่งศาลปกครองสูงสุดที่ 547/2554)"},
{ "id" : "8", "question" : "ประกาศ กกต.รับรองผลการเลือกตั้ง เป็นคำสั่งทางปกครอง หรือไม่",  "answer" : "ไม่เป็น เพราะ กกต. เป็นองค์กรที่ใช้อำนาจตามรัฐธรรมนูญโดยเฉพาะ จึงไม่อยู่ในบังคับของ พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง  (มาตรา ๔)"},
{ "id" : "9", "question" : "การพิจารณาพิพากษาคดีของศาล อยู่ภายใต้บังคับของ พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง หรือไม่",  "answer" : "ไม่อยู่ภายใต้บังคับของ พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง เพราะ มาตรา ๔ กำหนด มิให้ใช้บังคับแก่การพิจารณาพิพากษาคดีของศาล"},
{ "id" : "10", "question" : "คำสั่งสำนักงานศาลยุติธรรม  เรื่อง มอบอำนาจในการบริหารงานบุคคลของ ข้าราชการศาลยุติธรรม และลูกจ้าง เป็นคำสั่งทางปกครองหรือไม่",  "answer" : "เป็นคำสั่งทางปกครอง เพราะเกี่ยวกับงานบริหารบุคคล ไม่เกี่ยวกับการพิจารณาพิพากษาคดีของศาล หรือการดำเนินงานของเจ้าหน้าที่ในกระบวนการพิจารณาคดี การบังคับคดี และการวางทรัพย์  (มาตรา ๔)"},
{ "id" : "11", "question" : "หมายเรียกของตำรวจให้มาพบพนักงานสอบสวน จัดเป็นคำสั่งทางปกครองหรือไม่",  "answer" : "ไม่เป็น เพราะเป็นการดำเนินงานตามกระบวนการยุติธรรมทางอาญา"},
{ "id" : "12", "question" : "การดำเนินการยกเว้นไม่ให้นำ พระราชบัญญัติวิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙ มาใช้บังคับ จะต้องดำเนินการอย่างไร",  "answer" : "ตราพระราชกฤษฎีกาตามข้อเสนอของคณะกรรมการวิธีปฏิบัติราชการทางปกครอง (มาตรา ๔)"},
{ "id" : "13", "question" : "วิธีปฏิบัติราชการทางปกครอง คืออะไร",  "answer" : "การเตรียมการและการดำเนินการ ของเจ้าหน้าที่ เพื่อจัดให้มีคำสั่งทางปกครองหรือกฎ และรวมถึงการดำเนินการใด ๆ ในทางปกครอง ตามพระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง (มาตรา ๕)"},
{ "id" : "14", "question" : "การพิจารณาทางปกครอง คืออะไร",  "answer" : "การเตรียมการและการดำเนินการของเจ้าหน้าที่ เพื่อจัดให้มีคำสั่งทางปกครอง (มาตรา ๕)"},
{ "id" : "15", "question" : "คำสั่งทางปกครอง มีลักษณะอย่างไร",  "answer" : "<ol><li>คำสั่งทางปกครองเป็นการใช้อำนาจตามกฎหมายของเจ้าหน้าที่ คือ ผู้ใช้อำนาจต้องเป็นเจ้าหน้าที่ และต้องมีกฎหมายให้อำนาจไว้ด้วย</li><li>มีผลในทางกฎหมาย หรือเป็นการสร้างนิติสัมพันธ์</li></ol> (มาตรา ๕)"},
{ "id" : "16", "question" : "การใช้อำนาจตามกฎหมายของเจ้าหน้าที่ ที่มีผลเป็นการสร้างนิติสัมพันธ์ หมายถึงอะไร",  "answer" : "เป็นการใช้อำนาจตามกฎหมายของเจ้าหน้าที่ ที่มีผลในทางกฎหมาย เช่น เจ้าหน้าที่ออกใบอนุญาตจำหน่ายสุราให้แก่นายสุจริต มีผลในทางกฎหมายคือทำให้นายสุจริตสามารถจำหน่ายสุราได้อย่างถูกกฎหมาย ตำรวจไม่สามารถมาจับกุมการจำหน่ายสุราของนายสุจริตได้ "},
{ "id" : "17", "question" : "นิติสัมพันธ์ หรือผลกระทบทางกฎหมาย มีเรื่องที่เกี่ยวกับอะไรบ้าง",  "answer" : "<ol><li>ก่อ  เช่น ก่อให้เกิดสิทธิบางอย่าง เช่น ใบอนุญาตจำหน่ายสุรา ทำให้ผู้ที่ได้รับใบอนุญาตมีสิทธิในการขายเหล้าเบียร์ เป็นต้น</li><li>เปลี่ยนแปลง</li><li>โอน เช่น การเปลี่ยนมือ สิทธิการครอบครองจากคนหนึ่ง ไปยังอีกคนหนึ่ง</li><li>สงวน คือ กำหนดให้ใช้เฉพาะคน ไม่ให้นำไปใช้กับผู้อื่น</li><li>ระงับ</li><li>มีผลกระทบต่อสถานภาพ ของสิทธิหรือหน้าที่ของบุคคล</li></ol>  (มาตรา ๕)"},
{ "id" : "18", "question" : "ให้ท่านยกตัวอย่าง คำสั่งทางปกครองที่มีผลเป็นการสร้างนิติสัมพันธ์ ",  "answer" : "การใช้อำนาจตามกฎหมายของเจ้าหน้าที่ เช่น การสั่งการ การอนุญาต การอนุมัติ การวินิจฉัยอุทธรณ์ การรับรอง และการรับจดทะเบียน แต่ไม่หมายความรวมถึงการออกกฎ  (มาตรา ๕)"},
{ "id" : "19", "question" : "กฎ คืออะไร",  "answer" : "กฎ หมายถึง พระราชกฤษฎีกา กฎกระทรวง ประกาศกระทรวง ข้อบัญญัติท้องถิ่น ระเบียบ ข้อบังคับ หรือบทบัญญัติอื่น ที่มีผลบังคับเป็นการทั่วไป โดยไม่มุ่งหมายให้ใช้บังคับแก่กรณีใด หรือบุคคลใดเป็นการเฉพาะ (มาตรา ๕)"},
{ "id" : "20", "question" : "คำสั่งทางปกครองและกฎ ต่างกันอย่างไร",  "answer" : "คำสั่งทางปกครอง มีผลเฉพาะบุคคลเฉพาะกรณี แต่ กฎ มีีผลบังคับเป็นการทั่วไป ไม่มุ่งหมายให้ใช้แก่กรณีใด หรือบุคคลใดเป็นการเฉพาะ"},
{ "id" : "21", "question" : "ข้อบัญญัติท้องถิ่นที่มีผลบังคับเป็นการทั่วไป ไม่มุ่งหมายให้ใช้แก่กรณีใด หรือบุคคลใดเป็นการเฉพาะ เป็นคำสั่งทางปกครองหรือไม่",  "answer" : "ไม่เป็น แต่เป็นกฎ   (มาตรา ๕)"},
{ "id" : "22", "question" : "ประกาศกระทรวง เป็นกฎ หรือเป็นคำสั่งทางปกครอง",  "answer" : "เป็นกฎ   (มาตรา ๕)"},
{ "id" : "23", "question" : "คำสั่งลดขั้นเงินเดือน เป็นคำสั่งทางปกครอง หรือกฎ",  "answer" : "เป็นคำสั่งทางปกครอง เพราะมีผลเฉพาะบุคคล"},
{ "id" : "24", "question" : "คณะกรรมการที่จัดตั้งขึ้นตามกฎหมายที่มีการจัดองค์กร และวิธีพิจารณา สำหรับการวินิจฉัย ชี้ขาด สิทธิและหน้าที่ ตามกฎหมาย มีชื่อว่าอะไร",  "answer" : "คณะกรรมการวินิจฉัยข้อพิพาท  (มาตรา ๕) "},
{ "id" : "25", "question" : "\"คู่กรณี\" ตามพระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙ หมายถึงผู้ใด",  "answer" : "ผู้ยื่นคำขอ หรือผู้คัดค้านคำขอ ผู้อยู่ในบังคับ หรือจะอยู่ในบังคับ ของคำสั่งทางปกครอง และผู้ซึ่งได้เข้ามาในกระบวนการพิจารณาทางปกครอง เนื่องจากสิทธิของผู้นั้น จะถูกกระทบกระเทือน จากผลของคำสั่งทางปกครอง  (มาตรา ๕)"},
{ "id" : "26", "question" : "ผู้ใด เป็นผู้รักษาการ พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง ",  "answer" : "นายกรัฐมนตรี (มาตรา ๖)"},
{ "id" : "27", "question" : "กฎกระทรวงและประกาศนั้น ซึ่งออกโดยนายกรัฐมนตรี เพื่อปฏิบัติการ ตามพระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง  มีผลใช้บังคับเมื่อใด",  "answer" : "เมื่อประกาศในราชกิจจานุเบกษาแล้ว (มาตรา ๖)"},
{ "id" : "28", "question" : "กรรมการผู้ทรงคุณวุฒิ ในคณะกรรมการวิธีปฏิบัติราชการทางปกครอง แต่งตั้งจาก ผู้ซึ่งมีความเชี่ยวชาญในทางใดบ้าง",  "answer" : "นิติศาสตร์ รัฐประศาสนศาสตร์ รัฐศาสตร์ สังคมศาสตร์ หรือการบริหารราชการแผ่นดิน และต้องไม่เป็นผู้ดำรงตำแหน่งทางการเมือง (มาตรา ๗)"},
{ "id" : "29", "question" : "ผู้ใด ทำหน้าที่เป็นเลขานุการ ของคณะกรรมการวิธีปฏิบัติราชการทางปกครอง",  "answer" : "ข้าราชการของสำนักงานคณะกรรมการกฤษฎีกา (มาตรา ๗)"},
{ "id" : "30", "question" : "กรรมการในคณะคณะกรรมการวิธีปฏิบัติราชการทางปกครอง ซึ่งคณะรัฐมนตรีแต่งตั้ง มีวาระดำรงตำแหน่ง คราวละกี่ปี",  "answer" : "สามปี (มาตรา ๘)"},
{ "id" : "31", "question" : "สำนักงานเลขานุการ ของคณะกรรมการวิธีปฏิบัติราชการทางปกครอง อยู่ที่ใด",  "answer" : "สำนักงานคณะกรรมการกฤษฎีกา (มาตรา ๑๐)"},
{ "id" : "32", "question" : "คณะกรรมการวิธีปฏิบัติราชการทางปกครอง มีอำนาจหน้าที่ อย่างไรบ้าง",  "answer" : "<ol><li>สอดส่องดูแล และให้คำแนะนำ เกี่ยวกับการดำเนินงานของเจ้าหน้าที่ในการปฏิบัติ ตามพระราชบัญญัตินี้ </li><li>ให้คำปรึกษาแก่เจ้าหน้าที่ เกี่ยวกับการปฏิบัติตามพระราชบัญญัตินี้ ตามที่บุคคลดังกล่าว ร้องขอ ทั้งนี้ ตามหลักเกณฑ์ ที่คณะกรรมการวิธีปฏิบัติราชการทางปกครอง กำหนด</li><li> มีหนังสือเรียกให้เจ้าหน้าที่ หรือบุคคลอื่นใด มาชี้แจงหรือแสดงความเห็นประกอบ การพิจารณาได้ </li><li>เสนอแนะในการตราพระราชกฤษฎีกา และการออกกฎกระทรวง หรือประกาศ ตามพระราชบัญญัตินี้</li><li>จัดทำรายงาน เกี่ยวกับการปฏิบัติ ตามพระราชบัญญัตินี้ เสนอคณะรัฐมนตรี เป็นครั้งคราว ตามความเหมาะสม แต่อย่างน้อยปีละหนึ่งครั้ง เพื่อพัฒนาและปรับปรุงการปฏิบัติราชการทางปกครอง ให้เป็นไปโดยมีความเป็นธรรม และมีประสิทธิภาพยิ่งขึ้น</li><li>เรื่องอื่น ตามที่คณะรัฐมนตรี หรือนายกรัฐมนตรีมอบหมาย</li></ol>"},
{ "id" : "33", "question" : "องค์ประกอบสำคัญของ \"เจ้าหน้าที่\" ที่จะเป็นผู้ใช้อำนาจทางปกครอง ประกอบด้วยสาระสำคัญ 3 ประการ อะไรบ้าง",  "answer" : "<ol><li>จะต้องเป็นผู้ที่มีอำนาจหน้าที่ในเรื่องนั้น</li><li>จะต้องเป็นผู้ที่ได้รับแต่งตั้งโดยชอบด้วยกฎหมาย</li><li>จะต้องเป็นผู้ที่มีความเป็นกลางในเรื่องนั้น</li></ol>"},
{ "id" : "34", "question" : "มีกรณีใดบ้าง ที่เจ้าหน้าที่ ซึ่งมีอำนาจ แต่ไม่สามารถทำการพิจารณาทางปกครองได้ ",  "answer" : "<ol><li>เป็นคู่กรณีเอง</li><li>เป็นคู่หมั้นหรือคู่สมรสของคู่กรณี </li><li>เป็นญาติของคู่กรณี คือ เป็นบุพการีหรือผู้สืบสันดานไม่ว่าชั้นใด ๆ หรือเป็นพี่น้อง หรือลูกพี่ลูกน้องนับได้เพียงภายในสามชั้น หรือเป็นญาติเกี่ยวพันทางแต่งงานนับได้เพียงสองชั้น</li><li> เป็นหรือเคยเป็นผู้แทนโดยชอบธรรม หรือผู้พิทักษ์ หรือผู้แทน หรือตัวแทนของคู่กรณี</li><li>เป็นเจ้าหนี้ หรือลูกหนี้ หรือเป็นนายจ้างของคู่กรณี</li><li> กรณีอื่น ตามที่กำหนดในกฎกระทรวง </li></ol> (มาตรา ๑๓)<ol>กฎกระทรวง ๒๕๖๖ เพิ่มเติม กำหนดให้เจ้าหน้าที่ดังต่อไปนี้จะทําการพิจารณาทางปกครองไม่ได้ <li>เคยเป็นคู่หมั้นหรือคู่สมรสของคู่กรณี </li><li>เป็นหรือเคยเป็นผู้ซึ่งอยู่กินกันฉันสามีภริยา โดยมิได้จดทะเบียนสมรสกับคู่กรณี </li><li>เป็นหรือเคยเป็นผู้ซึ่งอยู่กินกับคู่กรณีที่เป็นบุคคลเพศเดียวกันโดยกําเนิดในลักษณะ เดียวกัน กับชายหญิงที่อยู่กินกันฉันสามีภริยา </li><li>เป็นบุพการีหรือผู้สืบสันดานในความเป็นจริง ไม่ว่าชั้นใด ๆ หรือเป็นพี่น้อง หรือลูกพี่ลูกน้องในความเป็นจริง นับได้เพียงภายในสามชั้นของคู่กรณี </li><li>เป็นหรือเคยเป็นบุตรบุญธรรมของคู่กรณี หรือเป็น หรือเคยเป็น ผู้รับคู่กรณีเป็นบุตรบุญธรรม  </li><li>เป็นลุง ป้า น้า อา ของคู่กรณี </li><li> เป็นผู้พักอาศัยอยู่ร่วมกับคู่กรณีในสถานที่เดียวกัน ในลักษณะครัวเรือนเดียวกัน </li><li> เป็นลูกจ้างหรือที่ปรึกษาซึ่งได้รับค่าตอบแทนของคู่กรณี </li></ol>"},
{ "id" : "35", "question" : "เมื่อมีผู้ยื่นคัดค้านเจ้าหน้าที่ว่า ไม่สามารถทำการพิจารณาทางปกครองได้ เนื่องจากไม่มีความเป็นกลาง เพราะเคยเป็นคู่รักของคู่กรณีมาก่อน เจ้าหน้าที่ผู้นั้น ต้องปฏิบัติอย่างไร",  "answer" : "เจ้าหน้าที่สามารถปฏิบัติได้ 2 อย่างคือ<ol><li>ถ้าเห็นด้วยกับคำคัดค้านนั้น ก็ให้หยุดการพิจารณาเรื่องไว้ก่อน และแจ้งให้ผู้บังคับบัญชาเหนือตนขึ้นไปชั้นหนึ่ง ทราบ  หรือ</li><li>ถ้าไม่เห็นด้วย คิดว่าตนเองมีความเป็นกลาง เช่น แม้จะเป็นคนรักกันแต่ก็นานมาแล้ว ไม่ได้แต่งงานกัน และตอนนี้เลิกคบกันแล้ว เจ้าหน้าที่ผู้นั้นก็สามารถปฏิบัติงานต่อไปได้ แต่ต้องแจ้งให้ผู้บังคับบัญชาเหนือตนขึ้นไปชั้นหนึ่งทราบ</li></ol> (มาตรา ๑๔)"},
{ "id" : "36", "question" : "ถ้ามีคู่กรณีคัดค้านว่า เจ้าหน้าที่เป็นผู้ที่ไม่สามารถทำการพิจารณาทางปกครองได้  แต่เจ้าหน้าที่ผู้นั้นเห็นว่า ตนไม่มีเหตุตามที่คัดค้านนั้น ในกรณีนี้ เจ้าหน้าที่ผู้นั้นจะทำการพิจารณาเรื่องต่อไปได้หรือไม่",  "answer" : "ได้ แต่ต้องแจ้งให้ผู้บังคับบัญชาเหนือตนขึ้นไปชั้นหนึ่ง หรือประธานกรรมการทราบ แล้วแต่กรณี   (มาตรา ๑๖)"},
{ "id" : "37", "question" : "เมื่อมีผู้ยื่นคัดค้านเจ้าหน้าที่ว่า เป็นผู้ที่ไม่สามารถทำการพิจารณาทางปกครองได้ และเจ้าหน้าที่ผู้นั้น ได้หยุดการพิจารณาทางปกครองเรื่องนั้นแล้ว ถามว่าสิ่งที่เจ้าหน้าที่ี่ผู้ถูกคัดค้าน ผู้นั้น ได้กระทำไปก่อนการหยุดการพิจารณาจะมีผลอย่างไร",  "answer" : "ไม่ส่งผลกระทบต่อสิ่งที่่เจ้าหน้าที่ผู้ถูกคัดค้านได้กระทำไปแล้ว หรือ สิ่งที่กระทำไปแล้วย่อมไม่เสียไป ยกเว้นผู้เข้าปฏิบัติหน้าที่แทนผู้ถูกคัดค้าน หรือคณะกรรมการที่มีอำนาจ พิจารณาทางปกครอง จะเห็นสมควรดำเนินการส่วนหนึ่งส่วนใดเสียใหม่ก็ได้  (มาตรา ๑๗)"},
{ "id" : "38", "question" : "เมื่อมีผู้ยื่นคัดค้านเจ้าหน้าที่ว่า เป็นผู้ที่ไม่สามารถทำการพิจารณาทางปกครองได้ มีกรณีใดบ้างที่ผู้ที่ถูกคัดค้านยังสามารถปฏิบัติหน้าที่ต่อไปได้ ",  "answer" : "<ol><li>ผู้ที่ถูกคัดค้านเห็นว่า ตนไม่มีเหตุตามที่คัดค้านนั้น และได้แจ้งให้ผู้บังคับบัญชาเหนือตนขึ้นไปชั้นหนึ่ง หรือประธานกรรมการทราบแล้ว </li><li> กรณีที่ หากปล่อยให้ล่าช้าไป จะเสียหายต่อประโยชน์สาธารณะ หรือสิทธิของบุคคล จะเสียหายโดยไม่มีทางแก้ไขได้ หรือไม่มีเจ้าหน้าที่อื่นปฏิบัติหน้าที่แทนผู้นั้นได้ </li></ol>(มาตรา ๑๖ และมาตรา ๑๘)"},
{ "id" : "39", "question" : "นายสมหมาย ได้รับการแต่งตั้งให้เป็นกรรมการ ในคณะกรรมการที่มีอำนาจพิจารณาทางปกครอง ต่อมาภายหลังทราบว่า นายสมหมายขาดคุณสมบัติไม่สามารถปฏิบัติงานในฐานะกรรมการต่อไปได้ ถามว่า สิ่งที่นายสมบัติได้ปฏิบัติไปตามอำนาจหน้าที่ ถือเป็นโมฆะ หรือไม่",  "answer" : "ไม่เป็นโมฆะ ถือว่าไม่กระทบกระเทือนถึง สิ่งที่นายสมบัติได้ปฏิบัติตามอำนาจหน้าที่ไปแล้ว ( มาตรา ๑๙)"},
{ "id" : "40", "question" : "ในคณะกรรมการตรวจการจ้าง มีผู้คัดค้านว่ามีกรรมการ 1 คน ขาดคุณสมบัติเพราะไม่มีความเป็นกลาง ในกรณีนี้ จะดำเนินการอย่างไร",  "answer" : "ให้ประธานกรรมการเรียกประชุม คณะกรรมการเพื่อพิจารณาเหตุคัดค้านนั้น ในการประชุมดังกล่าว กรรมการผู้ถูกคัดค้านเมื่อได้ชี้แจงข้อเท็จจริง และตอบข้อซักถามแล้ว ต้องออกจากที่ประชุม จากนั้นให้กรรมการที่เหลือ ลงมติ ถ้ากรรมการ จำนวน 2 ใน 3 ของกรรมการที่เหลืออยู่ เห็นว่า กรรมการผู้ที่ถูกคัดค้านสามารถปฏิบัติหน้าที่ต่อไปได้  ก็ให้กรรมการผู้ที่ถูกคัดค้านนั้น ปฏิบัติหน้าที่ต่อไปได้ "},
{ "id" : "41", "question" : "คู่กรณี เป็นใครได้บ้าง",  "answer" : "บุคคลธรรมดา คณะบุคคล หรือนิติบุคคล ที่สิทธิของตนถูกกระทบกระเทือน หรืออาจถูกกระทบกระเทือน โดยมิอาจหลีกเลี่ยงได้ "},
{ "id" : "42", "question" : "ผู้มีความสามารถกระทำการ ในกระบวนการพิจารณาทางปกครองได้  จะต้องเป็นผู้มีคุณสมบัติอย่างไร",  "answer" : "<ol><li>บรรลุนิติภาวะ</li><li>ผู้ซึ่งมีบทกฎหมายเฉพาะ กำหนดให้มีความสามารถกระทำการในเรื่องที่กำหนดได้ </li><li>นิติบุคคลหรือคณะบุคคล โดยผู้แทนหรือตัวแทน แล้วแต่กรณี</li><li>ผู้ซึ่งมีประกาศของนายกรัฐมนตรี หรือผู้ซึ่งนายกรัฐมนตรีมอบหมายในราชกิจจานุเบกษา กำหนดให้มีความสามารถกระทำการ ในเรื่องที่กำหนดได้ </li></ol> (มาตรา ๒๒)"},
{ "id" : "43", "question" : " ในการพิจารณาทางปกครอง ที่คู่กรณีต้องมาปรากฏตัวต่อหน้าเจ้าหน้าที่ คู่กรณี สามารถนำทนายความ หรือที่ปรึกษา มาด้วย ได้หรือไม่",  "answer" : "ได้ (มาตรา ๒๓)"},
{ "id" : "44", "question" : "ในกรณีที่ คู่กรณีต้องมาปรากฏตัวต่อหน้าเจ้าหน้าที่ ในการพิจารณาทางปกครอง และได้นำที่ปรึกษาเข้ามาร่วมด้วย สิ่งที่ที่ปรึกษาได้กระทำในระหว่างการพิจารณาทางปกครอง มีผลอย่างไร",  "answer" : "ให้ถือว่าเป็นการกระทำของคู่กรณี เว้นแต่คู่กรณีจะได้คัดค้านเสียแต่ในขณะนั้น คือในระหว่างการพิจารณาทางปกครองนั้น (มาตรา ๒๓)"},
{ "id" : "45", "question" : "ในกรณีที่ คู่กรณีมีหนังสือแต่งตั้งให้บุคคลบรรลุนิติภาวะกระทำการ อย่างหนึ่งอย่างใดแทนตน ต่อมาพบว่า ผู้ได้รับการแต่งตั้งให้กระทำการแทน ไม่ทราบข้อเท็จจริงในเรื่องนั้นอย่างเพียงพอ เจ้าหน้าที่ จะดำเนินการอย่างไร",  "answer" : "ให้เจ้าหน้าที่แจ้งให้คู่กรณีทราบ โดยไม่ชักช้า (มาตรา ๒๔)"},
{ "id" : "46", "question" : "ในกรณีที่ คู่กรณีมีหนังสือแต่งตั้งให้บุคคลบรรลุนิติภาวะกระทำการ อย่างหนึ่งอย่างใดแทนตน ต่อมาคู่กรณีเสียชีวิต จะถือว่าการแต่งตั้งให้กระทำการแทนนั้น เป็นอันสิ้นสุดลงหรือไม่",  "answer" : "ไม่ถือว่าสิ้นสุดลง  (มาตรา ๒๔)"},
{ "id" : "47", "question" : "ในกรณีที่มีคู่กรณี เกินห้าสิบคน ยื่นคำขอที่มีข้อความทำนองเดียวกัน และไม่ได้มีการระบุ ให้บุคคลใดเป็นตัวแทน แต่มีข้อความเป็นปริยายให้เข้าใจไดว่า นาย ก. เป็นตัวแทนร่วม กรณีนี้ จะ ถือว่า นาย ก. เป็นตัวแทนร่วมของคู่กรณีเหล่านั้น ได้หรือไม่",  "answer" : "ได้ (มาตรา ๒๕)"},
{ "id" : "48", "question" : "ในกรณีที่มีการยื่นคำขอ โดยมีผู้ลงชื่อร่วมกันเกินห้าสิบคน แต่ไม่มี การกำหนดให้บุคคลใดเป็นตัวแทนร่วม เจ้าหน้าที่จะดำเนินการอย่างไร",  "answer" : "ให้เจ้าหน้าที่ในเรื่องนั้นแต่งตั้งบุคคล ที่คู่กรณีฝ่ายข้างมาก เห็นชอบเป็นตัวแทนร่วมของบุคคลดังกล่าว (มาตรา ๒๕)"},
{ "id" : "49", "question" : "ในกรณีที่คู่กรณียื่นเอกสารที่เป็นภาษาต่างประเทศต่อเจ้าหน้าที่ และเจ้าหน้าที่ให้คู่กรณี จัดทำคำแปลเป็นภาษาไทย โดยมีการรับรองความถูกต้องมาให้ ภายในระยะเวลาที่เจ้าหน้าที่กำหนด กรณีนี้ จะถือว่า วันใดเป็นวันยื่นเอกสาร",  "answer" : "ให้ถือว่า วันที่เจ้าหน้าที่ได้รับคำแปลนั้น เป็นวันที่เจ้าหน้าที่ได้รับเอกสาร (มาตรา ๒๖)"},
{ "id" : "50", "question" : "ในกรณีที่เจ้าหน้าที่กำหนดให้คู่กรณีส่งเอกสาร ภายใน 7 วัน และคู่กรณีส่งเอกสารภาษาอังกฤษ ในวันที่ 7 และส่งคำแปล ในวันที่ 10 จะถือว่า คู่กรณีส่งเอกสารภายในระยะเวลาที่กำหนดหรือไม่",  "answer" : "ถือว่า คู่กรณีส่งเอกสารช้ากว่ากำหนด <br>มาตรา ๒๖ กำหนดให้เจ้าหน้าที่ ถือว่า วันที่ได้รับคำแปล เป็นวันที่เจ้าหน้าที่ได้รับเอกสาร"},
{ "id" : "51", "question" : "เมื่อมีผู้ยื่นคําขอเพื่อให้เจ้าหน้าที่มีคําสั่งทางปกครอง เจ้าหน้าจะต้องดำเนินการอย่างไร",  "answer" : "ให้เจ้าหน้าที่ดำเนินการดังต่อไปนี้<ol><li>ตรวจสอบความถูกต้อง ของคําขอ และความครบถ้วนของเอกสาร</li><li>หากคําขอไม่ถูกต้อง ให้เจ้าหน้าที่ดังกล่าวแนะนําให้แก่ผู้ยื่นคําขอ ดําเนินการแก้ไขเพิ่มเติมเสียให้ถูกต้อง</li><li>หากมีเอกสารใด ไม่ครบถ้วนให้แจ้งให้แก่ผู้ยื่นคําขอทราบทันที หรือภายในไม่เกินเจ็ดวัน นับแต่วันที่ได้รับคําขอ</li><li>การแจ้งต้องทําเป็นหนังสือ ลงลายมือชื่อของผู้รับคําขอ และระบุรายการเอกสาร ที่ไม่ถูกต้อง หรือยังไม่ครบถ้วนให้ผู้ยื่นคําขอทราบ พร้อมทั้งบันทึกการแจ้งดังกล่าว ไว้ในกระบวนพิจารณาจัดทําคําสั่งทางปกครองนั้นด้วย</li></ol> (มาตรา ๒๗)"},
{ "id" : "52", "question" : "ในกรณีที่เจ้าหน้าที่แจ้งให้ผู้ยื่นคําขอจัดส่งเอกสารเพิ่มเติมในเวลาที่กำหนด เมื่อครบกำหนดแล้ว ผู้ยื่นคําขอยังไม่ส่งเอกสารเพิ่มเติมให้ครบถ้วน เจ้าหน้าที่จะดำเนินการอย่างไร",  "answer" : "ให้ถือว่าผู้ยื่นคําขอ ไม่ประสงค์ที่จะให้เจ้าหน้าที่ดําเนินการตามคําขอต่อไป ในกรณีเช่นนั้น ให้เจ้าหน้าที่ส่งเอกสารคืนให้ผู้ยื่นคําขอ พร้อมทั้งแจ้งสิทธิในการอุทธรณ์ให้ผู้ยื่นคําขอทราบ และบันทึกการดําเนินการดังกล่าวไว้ <br>[มาตรา ๒๗ แก้ไขเพิ่มเติมโดยพระราชบัญญัติวิธีปฏิบัติราชการทางปกครอง (ฉบับที่ ๒) พ.ศ. ๒๕๕๗]"},
{ "id" : "53", "question" : "การตรวจสอบข้อเท็จจริง ในการพิจารณาทางปกครอง เจ้าหน้าที่สามารถตรวจสอบหลักฐาน พยาน นอกเหนือจากที่ คู่กรณีระบุในคำขอ ได้หรือไม่",  "answer" : "ได้ เจ้าหน้าที่สามารถดำเนินการได้ โดยไม่ต้องผูกพันอยู่กับคำขอ หรือพยานหลักฐานของคู่กรณี (มาตรา ๒๘)"},
{ "id" : "54", "question" : "ในการพิจารณาทางปกครอง ของเจ้าหน้าที่ สามารถดำเนินการอะไรได้บ้าง",  "answer" : "<ol><li>แสวงหาพยานหลักฐานทุกอย่างที่เกี่ยวข้อง</li><li>รับฟังพยานหลักฐาน คำชี้แจง หรือความเห็นของคู่กรณี หรือของพยานบุคคล หรือพยานผู้เชี่ยวชาญที่คู่กรณีกล่าวอ้าง เว้นแต่เจ้าหน้าที่เห็นว่า เป็นการกล่าวอ้างที่ไม่จำเป็น ฟุ่มเฟือย หรือเพื่อประวิงเวลา</li><li>ขอข้อเท็จจริงหรือความเห็นจากคู่กรณี พยานบุคคล หรือพยานผู้เชี่ยวชาญ</li><li>ขอให้ผู้ครอบครองเอกสารส่งเอกสารที่เกี่ยวข้อง</li><li>ออกไปตรวจสถานที่ (มาตรา ๒๙)"},
{ "id" : "55", "question" : "ในขณะที่เจ้าหน้าที่ยังไม่ได้ทำคำสั่งทางปกครองในเรื่องนั้น คู่กรณี ขอตรวจดูเอกสาร ต้นร่างคำวินิจฉัย เพื่อการโต้แย้งหรือชี้แจง หรือป้องกันสิทธิของตน ได้หรือไม่",  "answer" : "ไม่ได้ แต่มีสิทธิขอดูเอกสารอื่น ๆ ได้ (มาตรา ๓๑)"},
{ "id" : "56", "question" : "ในกรณีที่ คู่กรณีขอตรวจดูเอกสาร ที่จำเป็นต้องรู้ เพื่อการโต้แย้งหรือชี้แจง หรือป้องกันสิทธิของตน เจ้าหน้าที่ สามารถปฏิเสธ ไม่อนุญาตให้ตรวจดูเอกสารหรือพยานหลักฐาน ได้ หรือไม่",  "answer" : "ได้ ถ้าเป็นกรณีที่ต้องรักษาไว้เป็นความลับ (มาตรา ๓๒)"},
{ "id" : "57", "question" : "เจ้าหน้าที่สามารถทำคำสั่งทางปกครอง ในรูปแบบอื่นที่ไม่ใช่เป็นหนังสือ หรือ ด้วยวาจา ได้หรือไม่",  "answer" : "ได้ แต่ต้องมีข้อความ หรือความหมายที่ชัดเจน เพียงพอที่จะเข้าใจได้ (มาตรา ๓๔)"},
{ "id" : "58", "question" : "ในกรณีที่คำสั่งทางปกครอง เป็นคำสั่งด้วยวาจา ผู้รับคำสั่งสามารถร้องขอให้ทำเป็นหนังสือ ได้หรือไม่",  "answer" : "ได้ แต่ต้องกระทำภายใน ๗ วันนับแต่วันที่มีคำสั่ง และต้องมีเหตุผลอันสมควรด้วย (มาตรา ๓๕)"},
{ "id" : "59", "question" : "คำสั่งการปกครองที่ทำเป็นหนังสือ อย่างน้อยต้องประกอบด้วยอะไรบ้าง",  "answer" : "<ol><li>วัน เดือน และปี ที่ทำคำสั่ง</li><li>ชื่อและตำแหน่ง ของเจ้าหน้าที่ผู้ทำคำสั่ง</li><li>ลายมือชื่อของเจ้าหน้าที่ ผู้ทำคำสั่ง</li></ol>(มาตรา ๓๖)"},
{ "id" : "60", "question" : "เหตุผลในการออกคำสั่งทางปกครอง ซึ่งต้องปรากฎในคำสั่งทางปกครอง ที่ทำเป็นหนังสือ อย่างน้อยต้องประกอบด้วยอะไรบ้าง",  "answer" : "<ol><li>ข้อเท็จจริงอันเป็นสาระสำคัญ</li><li> ข้อกฎหมายที่อ้างอิง</li><li>ข้อพิจารณา และข้อสนับสนุนในการใช้ดุลพินิจ</li></ol> (มาตรา ๓๗)"},
{ "id" : "61", "question" : "คำสั่งทางปกครองที่ไม่ระบุเหตุผล ถือเป็นคำสั่งทางปกครองที่เป็นโมฆะ หรือไม่",  "answer" : "ไม่เป็นโมฆะ สามารถเพิ่มเติมภายหลังได้ "},
{ "id" : "62", "question" : "การออกคำสั่งทางปกครองเป็นหนังสือ เจ้าหน้าที่ต้องดำเนินการให้เสร็จภายในกี่วัน นับแต่วันที่เจ้าหน้าที่ได้รับคำขอ และเอกสารถูกต้องครบถ้วน",  "answer" : "30 วัน<br>[มาตรา ๓๙/๑ เพิ่มโดยพระราชบัญญัติวิธีปฏิบัติราชการทางปกครอง (ฉบับที่ ๒) พ.ศ. ๒๕๕๗]"},
{ "id" : "63", "question" : "มีกรณีใดบ้างที่ทำให้คำสั่งทางปกครองเป็นคำสั่งทางปกครองที่ไม่สมบูรณ์ ",  "answer" : "<ol><li>ออกคำสั่งทางปกครอง โดยยังไม่มีผู้ยื่นคำขอ</li><li>คำสั่งทางปกครอง ที่ขาดเหตุผลประกอบ</li><li>การรับฟังคู่กรณี ยังทำได้ไม่สมบูรณ์ </li><li>คำสั่งทางปกครอง ที่ต้องให้เจ้าหน้าที่อื่น ให้ความเห็นชอบก่อน แต่เจ้าหน้าที่อื่นยังไม่ได้ให้ความเห็นชอบ</li></ol> (มาตรา ๔๑)"},
{ "id" : "64", "question" : "คำสั่งทางปกครองเป็นคำสั่งทางปกครองที่ไม่สมบูรณ์ จะสามารถแก้ไขให้เป็นคำสั่งทางปกครองที่สมบูรณ์ได้หรือไม่",  "answer" : "ได้ เช่น ภายหลังมีการยื่นคำขอ เพิ่มเหตุผลประกอบ รับฟังคู่กรณีเพิ่มให้สมบูรณ์ หรือให้เจ้าหน้าที่อื่นให้ความเห็นชอบ ทั้งนี้ขึ้นอยู่กับสาเหตุที่ทำให้คำสั่งทางปกครองไม่สมบูรณ์  (มาตรา ๔๑)"},
{ "id" : "65", "question" : "คำสั่งทางปกครอง ที่ขาดเหตุผลประกอบ เป็นคำสั่งทางปกครองที่สมบูรณ์หรือไม่",  "answer" : "ไม่เป็นคำสั่งทางปกครองที่สมบูรณ์ ยกเว้นนอกจากจะมีการจัดทำเหตุผลประกอบเพิ่มเติมในภายหลัง ก่อนสิ้นสุดกระบวนการพิจารณาอุทธรณ์ หรือก่อนมีการนำคำสั่งทางปกครอง ไปสู่การพิจารณา ของผู้มีอำนาจพิจารณาวินิจฉัยความถูกต้อง จึงจะถือว่าเป็นคำสั่งทางปกครองที่สมบูรณ์ (มาตรา ๔๑)"},
{ "id" : "66", "question" : "เจ้าหน้าที่สามารถแก้ไข คำสั่งทางปกครอง ที่มีข้อผิดพลาดเล็กน้อย ได้หรือไม่",  "answer" : "ได้ แต่ต้องแจ้งให้ผู้ที่เกี่ยวข้องทราบ ตามควรแก่กรณี (มาตรา ๔๓)  "},
{ "id" : "67", "question" : "ในกรณีที่คำสั่งทางปกครองใด ซึ่งไม่ได้ออกโดยรัฐมนตรี และไม่มีกฎหมายกำหนดขั้นตอนอุทธรณ์ไว้เป็นการเฉพาะ ถ้าคู่กรณีต้องการอุทธรณ์ คำสั่งทางปกครองนั้น จะต้องยื่นต่อเจ้าหน้าที่ ผู้ทำคำสั่งทางปกครองภายในกี่วัน นับแต่วันที่ได้รับแจ้งคำสั่งดังกล่าว",  "answer" : "ภายในสิบห้าวัน (มาตรา ๔๔)"},
{ "id" : "68", "question" : "การอุทธรณ์เป็นเหตุให้ทุเลาการบังคับตามคำสั่งทางปกครอง หรือไม่",  "answer" : "ไม่เป็นเหตุให้ทุเลาการบังคับตามคำสั่งทางปกครอง เว้นแต่จะมีการสั่งให้ทุเลาการบังคับ โดยเจ้าหน้าที่ผู้ทำคำสั่ง ผู้มีอำนาจพิจารณาคำอุทธรณ์  หรือผู้มีอำนาจพิจารณาวินิจฉัยความถูกต้องของคำสั่งทางปกครอง <br>[แก้ไข เพิ่มเติมโดยพระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง (ฉบับที่ ๓) พ.ศ. ๒๕๖๒]"},
{ "id" : "69", "question" : "ถ้ามีคู่กรณียื่นคำอุทธรณ์ต่อเจ้าหน้าที่ เจ้าหน้าที่ต้องดำเนินการให้เสร็จสิ้น ภายในกี่วัน",  "answer" : "สามสิบวัน นับแต่วันที่ได้รับอุทธรณ์ (มาตรา ๔๕)"},
{ "id" : "70", "question" : "ในกรณีที่เจ้าหน้าที่เห็นด้วยกับคำอุทธรณ์ เจ้าหน้าที่สามารถดำเนินการเปลี่ยนแปลง หรือเพิกถอนคำสั่งทางปกครองเดิม ได้ด้วยตนเองหรือไม่",  "answer" : "ได้ แต่ต้องไม่เกินสามสิบวัน นับแต่วันที่ได้รับอุทธรณ์  (มาตรา ๔๕-๔๖)"},
{ "id" : "71", "question" : "ในกรณีที่เจ้าหน้าที่ไม่เห็นด้วยกับคำอุทธรณ์ เจ้าหน้าที่จะดำเนินต่อไปอย่างไร",  "answer" : "รายงานความเห็นของตนพร้อมเหตุผล ไปยังผู้มีอำนาจพิจารณาคำอุทธรณ์ ภายในสามสิบวัน นับแต่วันที่ได้รับอุทธรณ์  (มาตรา ๔๕)"},
{ "id" : "72", "question" : "การเพิกถอนคำสั่งทางปกครอง ที่มีลักษณะเป็นการให้ประโยชน์ ต้องกระทำภายในกี่วัน",  "answer" : "เก้าสิบวัน  (มาตรา ๔๙)"},
{ "id" : "73", "question" : "คำสั่งทางปกครอง ที่มีลักษณะเป็นการให้ประโยชน์ คืออะไร พร้อมยกตัวอย่างประกอบ",  "answer" : "คำสั่งทางปกครอง ที่มีลักษณะเป็นการให้ประโยชน์ เป็นคำสั่งทางปกครองที่มีผลดี หรือให้ประโยชน์ต่อผู้รับคําสั่ง เช่น<ul><li> ใบอนุญาตประกอบกิจการบรรจุก๊าซ</li><li> หนังสือรับรองการทําประโยชน์ในที่ดิน </li><li>ประกาศจุดผ่อนผันให้ตั้งแผงลอย </li><li> คําสั่งบรรจุแต่งตั้งผู้สอบแข่งขันได้เข้ารับราชการ </li><li> ประกาศรายชื่อผู้มีสิทธิเข้าศึกษาในมหาวิทยาลัย เป็นต้น</li><ul><br>(อ้างอิงจาก <u>ระยะเวลาเพิกถอนคําสั่งทางปกครองที่เป็นการให้ประโยชน์</u> โดย ศุภวัฒน์ สิงห์สุวงษ์ www.krisdika.go.th)"},
{ "id" : "74", "question" : "เจ้าหน้าที่ออกไปอนุญาตประกอบกิจการบรรจุก๊าซ แต่ภายหลังพบว่า เอกสารที่นำมาประกอบเพื่อขอให้ออกใบอนุญาต เป็นเอกสารปลอม เจ้าหน้าที่จะดำเนินการเพิกถอนคำสั่งทางปกครองนี้ อย่างไร",  "answer" : "เพิกถอนได้ทันที สามารถเพิกถอนคําสั่งได้ทุกเมื่อ เพราะเป็นคำสั่งทางปกครอง ที่ทำขึ้น จากการแสดงข้อความอันเป็นเท็จ หรือปกปิดข้อความจริง (มาตรา ๔๙)"},
{ "id" : "75", "question" : "การเพิกถอน คำสั่งทางปกครอง ที่ไม่ชอบด้วยกฎหมาย ซึ่งเป็นคำสั่งที่เป็นการให้ประโยชน์แก่ผู้รับ สามารถกระทำได้หรือไม่",  "answer" : "กระทำได้ แต่ต้องเป็นไปตามบทบัญญัติ มาตรา ๕๑ และมาตรา ๕๒"},
{ "id" : "76", "question" : "การร้องขอค่าทดแทน อันเนื่องมาจาการเพิกถอนคำสั่งทางปกครองที่ไม่ชอบด้วยกฎหมาย ของผู้ใด้รับผลกระทบ ให้กระทำภายในกี่วัน นับแต่ได้รับแจ้งให้ทราบถึงการเพิกถอนคำสั่งทางปกครองนั้น",  "answer" : "หนึ่งร้อยแปดสิบวัน (มาตรา ๕๒)"},
{ "id" : "77", "question" : "มีกรณีใดบ้าง ที่คำสั่งทางปกครองที่ชอบด้วยกฎหมาย ซึ่งเป็นการให้ประโยชน์แก่ผู้รับคำสั่งทางปกครอง อาจถูกเพิกถอน ทั้งหมดหรือบางส่วน โดยให้มีผลตั้งแต่ขณะที่เพิกถอน หรือมีผลในอนาคต (ไม่สามารถให้มีผลย้อนหลังได้)",  "answer" : "<ol><li>มีกฎหมายกำหนดให้เพิกถอนได้ หรือมีข้อสงวนสิทธิ ให้เพิกถอนได้ในคำสั่งทางปกครองนั้นเอง</li><li>คำสั่งทางปกครองนั้น มีข้อกำหนดให้ผู้รับประโยชน์ ต้องปฏิบัติ แต่ไม่มีการปฏิบัติภายในเวลาที่กำหนด</li><li>ข้อเท็จจริงและพฤติการณ์เปลี่ยนแปลงไป ซึ่งหากมีข้อเท็จจริงและพฤติการณ์เช่นนี้ ในขณะทำคำสั่งทางปกครองแล้ว เจ้าหน้าที่คงจะไม่ทำคำสั่งทางปกครองนั้น และหากไม่เพิกถอน จะก่อให้เกิดความเสียหายต่อประโยชน์สาธารณะได้</li><li>บทกฎหมายเปลี่ยนแปลงไป ซึ่งหากมีบทกฎหมายเช่นนี้ ในขณะทำคำสั่งทางปกครองแล้ว เจ้าหน้าที่คงจะไม่ทำคำสั่งทางปกครองนั้น แต่การเพิกถอนในกรณีนี้ ให้กระทำได้ เท่าที่ผู้รับประโยชน์ ยังไม่ได้ใช้ประโยชน์ หรือยังไม่ได้รับประโยชน์ ตามคำสั่งทางปกครองดังกล่าว และหากไม่เพิกถอน จะก่อให้เกิดความเสียหาย ต่อประโยชน์สาธารณะได้ </li><li>อาจเกิดความเสียหายอย่างร้ายแรง ต่อประโยชน์สาธารณะ หรือต่อประชาชน อันจำเป็นต้องป้องกัน หรือขจัดเหตุดังกล่าว</li></ol> (มาตรา ๕๓)"},
{ "id" : "78", "question" : "มีกรณีใดบ้าง ที่คำสั่งทางปกครองที่ชอบด้วยกฎหมาย ซึ่งเป็นการให้ประโยชน์แก่ผู้รับคำสั่งทางปกครอง อาจถูกเพิกถอน ทั้งหมดหรือบางส่วน โดยให้มีผลย้อนหลัง หรือไม่มีผลย้อนหลัง หรือมีผลในอนาคตได้",  "answer" : "<ol><li>มิได้ปฏิบัติ หรือปฏิบัติล่าช้า ในอันที่จะดำเนินการ ให้เป็นไปตามวัตถุประสงค์ของคำสั่งทางปกครอง</li><li>ผู้ได้รับประโยชน์ มิได้ปฏิบัติหรือปฏิบัติล่าช้า ในอันที่จะดำเนินการให้เป็นไป ตามเงื่อนไขของคำสั่งทางปกครอง</li></ol>  (มาตรา ๕๓)<br><br>"},
{ "id" : "79", "question" : "ใครมีอำนาจออกกฎกระทรวงโดยอาศัยอำนาจตามพระราชบัญญัติวิธี ปฎิบัติราชการทางปกครอง ฯ",  "answer" : "ผู้ที่มีอำนาจออกกฎกระทรวง คือ ผู้รักษาการตาม พ.ร.บ. ซึ่งได้แก่ นายกรัฐมนตรี <br>"},
{ "id" : "80", "question" : "การยกเว้นไม่ให้นำบทบัญญัติแห่งพระราชบัญญัติิวิธี ปฎิบัติราชการทางปกครอง ฯ มาใช้บังคับแก่การดำเนินกิจการใด หรือกับหน่วยงานใด จะต้องตราเป็นกฎหมายใด",  "answer" : "ให้ตราเป็นพระราชกฤษฎีกา (มาตรา ๔)"},
{ "id" : "81", "question" : "คำสั่งทางปกครอง ที่พ้นกำหนดอุทธรณ์ไปแล้ว เจ้าหน้าที่สามารถแก้ไขคำสั่ง ได้หรือไม่",  "answer" : "ได้ ในกรณีที่ คู่กรณีมีคำขอ และ เข้าเงื่อนไขต่อไปนี้นกรณีดังต่อไปนี้ <ol><li>มีพยานหลักฐานใหม่ อันอาจทำให้ข้อเท็จจริง ที่พีงเป็นยุติแล้วนั้น เปลี่ยนแปลงไปในสาระสำคัญ</li><li>คู่กรณีที่แท้จริง มิได้เข้ามาในกระบวนการพิจารณา ทางปกครอง หรือได้เข้ามา ในกระบวนการพิจารณาครั้งก่อนแล้ว แต่ถูกตัดโอกาส โดยไม่เป็นธรรมในการมีส่วนร่วม ในกระบวนการพิจารณาทางปกครอง</li><li>เจ้าหน้าที่ไม่มีอำนาจ ที่จะทำคำสั่งทางปกครอง ในเรื่องนั้น</li><li>ถ้าคำสั่งทางปกครอง ได้ออกโดยอาศัยข้อเท็จจริง หรือข้อกฎหมายใดและต่อมา ข้อเท็จจริง หรือข้อกฎหมายนั้น เปลี่ยนแปลงไปในสาระสำคัญ ในทางที่จะเป็นประโยชน์แก่คู่กรณี</li></ol>(มาตรา ๕๔)"},
{ "id" : "82", "question" : "การยื่นคำขอของคู่กรณีให้พิจารณาใหม่ ต้องกระทำภายในกี่วัน นับแต่ผู้นั้นได้รู้ถึงเหตุ ซึ่งอาจขอให้พิจารณาใหม่ได้ ",  "answer" : "เก้าสิบวัน (มาตรา ๕๔)"},
{ "id" : "83", "question" : "การบังคับทางปกครอง  จะใช้บังคับกับหน่วย งานของรัฐด้วยกัน ได้หรือไม่",  "answer" : "ไม่ได้ เว้นแต่จะมีกฎหมายกำหนดไว้เป็นอย่างอื่น (มาตรา ๖๓/๑)"},
{ "id" : "84", "question" : "ผู้ใดมีอำนาจสั่งให้ทุเลาการบังคับคำสั่งทางปกครอง",  "answer" : "<ol><li>เจ้าหน้าที่ผู้ทำคำสั่งนั้น</li><li>ผู้มีอำนาจพิจารณาคำอุทธรณ์ </li><li>ผู้มีอำนาจพิจารณาวินิจฉัยความถูกต้องของคำสั่งทางปกครอง</li></ol>(มาตรา ๖๓/๒)"},
{ "id" : "85", "question" : "ผู้มีอำนาจสั่งให้ทุเลาการบังคับคำสั่งทางปกครอง จะมอบอำนาจให้เจ้าหน้าที่อื่น เป็นผู้ดำเนินการแทน ได้หรือไม่",  "answer" : "ได้ หรืออาจมอบให้ผู้อยู่ใต้บังคับบัญชา ดำเนินการแทนก็ได้ (มาตรา ๖๓/๒)"},
{ "id" : "86", "question" : "การใช้มาตรการบังคับทางปกครองมีหลักเกณฑ์อย่างไร",  "answer" : "ใช้มาตรการบังคับทางปกครองเพียงเท่าที่จำเป็น เพื่อให้บรรลุตามวัตถุประสงค์ ของคำสั่งทางปกครอง โดยกระทบกระเทือน ผู้อยู่ในบังคับของคำสั่งทางปกครองน้อยที่สุด  (มาตรา ๖๓/๒)"},
{ "id" : "87", "question" : "ถ้าบทกฎหมายใด กำหนดมาตรการบังคับทางปกครองไว้โดยเฉพาะแล้ว แต่เจ้าหน้าที่เห็นว่าการใช้มาตรการบังคับนั้น จะเกิดผลน้อยกว่ามาตรการบังคับ ตามพระราชบัญญัติวิธี ปฎิบัติราชการทางปกครอง ฯ จะไม่ใชการบังคับทางปกครองตามกฎหมายนั้น และใช้ตามพระราชบัญญัติวิธี ปฎิบัติราชการทางปกครอง ฯ  จะได้หรือไม่",  "answer" : "ได้ (เพราะถือว่า พระราชบัญญัติวิธี ปฎิบัติราชการทางปกครอง ฯ เป็นกฎหมายกลาง)  (มาตรา ๖๓/๓)"},
{ "id" : "88", "question" : "นาย ก. เป็นผู้อยู่ในบังคับคำสั่งทางปกครอง และประสบอุบัติเหตุถึงแก่ความตาย จะทำให้คำสั่งทางปกครองนั้น สิ้นสุดการบังคับไปด้วยหรือไม่",  "answer" : "คำสั่งทางปกครองนั้นยังสามารถบังคับทางปกครองต่อไปได้  ถ้า นาย ก. มีทายาท ผู้รับมรดก หรือผู้จัดการมรดก ให้ถือว่าทายาทผู้รับมรดก หรือผู้จัดการมรดก เป็นผู้อยู่ในบังคับของมาตรการบังคับทางปกครองนั้น (มาตรา ๖๓/๔)"},
{ "id" : "89", "question" : "ในกรณีที่ผู้อยู่ในบังคับของมาตรการบังคับทางปกครองตาย เจ้าหน้าที่ต้องดำเนินการอย่างไร",  "answer" : "ให้แจ้งมาตรการบังคับทางปกครอง ไปยังทายาทผู้รับมรดก หรือผู้จัดการมรดก แล้วแต่กรณี  (มาตรา ๖๓/๔)"},
{ "id" : "90", "question" : "การนับระยะเวลาอุทธรณ์ ของทายาทผู้รับมรดกผู้อยู่ในบังคับของมาตรการบังคับทางปกครอง ซึ่งเสียชีวิตก่อนสิ้นสุดระยะเวลาอุทธรณ์การใช้มาตรการบังคับทางปกครอง และไม่ได้ยื่นอุทธรณ์การใช้มาตรการบังคับทางปกครองไว้ด้วย จะนับต่อไปจนสิ้นสุดระยะเวลาการอุธรณ์ หรือเริ่มนับใหม่",  "answer" : "เริ่มนับใหม่  (มาตรา ๖๓/๔)"},
{ "id" : "91", "question" : "ในกรณีที่ห้างหุ้นส่วนสามัญที่จดทะเบียนเป็นนิติบุคคลแล้ว มีการควบรวมกิจการ เจ้าหน้าที่จะดำเนินการบังคับทางปกครองอย่างไร",  "answer" : "ให้แจ้งมาตรการบังคับทางปกครองไปยังผู้ชำระบัญชี หรือนิติบุคคลที่เกิดจากการควบรวมกิจการ แล้วแต่กรณี ทั้งนี้ โดยไม่จำต้องออกคำสั่งทางปกครองใหม่ แก่นิติบุคคลดังกล่าวอีก"},
{ "id" : "92", "question" : "การบังคับทางปกครองโดยเจ้าหน้าที่ของหน่วยงานของรัฐ ในกรณีที่เจ้าหน้าที่มีคำสั่งทางปกครองที่กำหนดให้ชำระเงิน ถ้าถึงกำหนดแล้วไม่มีการชำระโดยถูกต้องครบถ้วน เจ้าหน้าที่ผู้ทำคำสั่งทางปกครองมีขั้นตอนดำเนินการอย่างไร",  "answer" : "<ol><li>มีหนังสือเตือนให้ผู้นั้น ชำระภายในระยะเวลาที่กำหนด แต่ต้องไม่น้อยกว่าเจ็ดวัน</li><li>ถ้าไม่มีการปฏิบัติตามคำเตือน เจ้าหน้าที่มีอำนาจ ยึดหรืออายัดทรัพย์สินของผู้นั้น และขายทอดตลาด เพื่อชำระเงินให้ครบถ้วนได้ </li></ol>(มาตรา ๖๓/๗)<br>"},
{ "id" : "93", "question" : "หน่วยงานของรัฐที่ออกคำสั่งให้ชำระเงิน ต้องดำเนินการยึด หรืออายัดทรัพย์สิน ภายในกี่ปี นับแต่วันที่คำสั่งทางปกครองที่กำหนดให้ชำระเงินเป็นที่สุด",  "answer" : "10 ปี (มาตรา ๖๓/๘)"},
{ "id" : "94", "question" : "การยึด หรืออายัดทรัพย์สิน ของผู้อยู่ในบังคับของมาตรการบังคับทางปกครอง แต่ยังได้เงินไม่ครบถ้วน และเวลาล่วงพ้นเกินกว่า 10 ปีแล้ว จะยึดหรืออายัดทรัพย์สินเพิ่มเติมอีก ได้หรือไม่",  "answer" : "ไม่ได้  (มาตรา ๖๓/๘)"},
{ "id" : "95", "question" : "การขายทอดตลาดทรัพย์สิน ของผู้อยู่ในบังคับของมาตรการบังคับทางปกครองที่ถูกยึดไว้แล้ว และเวลาล่วงพ้นเกินกว่า 10 ปี แต่การดำเนินการขายทอดตลาดยังไม่สำเร็จเสร็จสิ้น จะดำเนินการขายทอดตลาดทรัพย์สินนั้น ต่อไปได้หรือไม่",  "answer" : "ได้  (มาตรา ๖๓/๘)"},
{ "id" : "96", "question" : "หน่วยงานของรัฐที่ออกคำสั่งให้ชำระเงิน อาจมอบหมายให้เอกชนสืบหาทรัพย์สินแทนได้ ในกรณีที่ หน่วยงานไม่มีเจ้าหน้าที่ในการดำเนินการสืบหาทรัพย์สิน แต่จำนวนเงินที่ต้องชำระตามมาตรการบังคับทางปกครองนั้น ต้องมีมูลค่าเท่าไร",  "answer" : "มีมูลค่าตั้งแต่สองล้านบาทขึ้นไป (มาตรา ๖๓/๑๑)"},
{ "id" : "97", "question" : "ในกรณีที่หน่วยงานมอบหมายให้เอกชน ทำการแทน ในการสืบหาทรัพย์สินของผู้อยู่ในบังคับของมาตรการบังคับทางปกครอง เอกชนจะได้รับค่าตอบแทน อย่างไร",  "answer" : "ได้รับค่าตอบแทนไม่เกินร้อยละสองครึ่ง จากเงินหรือทรัพย์สินที่ได้มาจากการยึด อายัด หรือขายทอดตลาดทรัพย์สินที่สืบพบได้ ทั้งนี้ จำนวนเงินค่าตอบแทนสูงสุดต้องไม่เกิน หนึ่งล้านบาท ต่อจำนวนเงินที่ต้องชำระ ตามคำสั่งทางปกครองในเรื่องนั้น (มาตรา ๖๓/๑๑)"},
{ "id" : "98", "question" : "ในกรณีที่มีการบังคับให้ชำระเงินและคำสั่งทางปกครองที่กำหนดให้ชำระเงิน เป็นที่สุดแล้ว หากหน่วยงานของรัฐ ที่ออกคำสั่งให้ชำระเงิน ประสงค์ให้เจ้าพนักงานบังคับคดี ในสังกัดกรมบังคับคดีดำเนินการให้ จะต้องยื่นคำขอฝ่ายเดียวต่อศาล ภายในระยะเวลา กี่ปี ",  "answer" : "ภายในสิบปี นับแต่วันที่คำสั่งทางปกครอง ที่กำหนดให้ชำระเงินเป็นที่สุด (มาตรา ๖๓/๑๕)"},
{ "id" : "99", "question" : "ค่าปรับที่เจ้าหน้าที่ สั่งให้ผู้ที่ฝ่าฝืน หรือไม่ปฏิบัติตามคำสั่งทางปกครอง ที่กำหนดให้กระทำหรือ ละเว้นกระทำ ชำระเป็นรายวัน เรียกว่าอะไร",  "answer" : "ค่าปรับบังคับการ (มาตรา ๖๓/๒๐) "},
{ "id" : "100", "question" : "เจ้าหน้าที่ออกคำสั่งทางปกครอง ให้นาย ก. รื้อถอนอาคาร แต่นาย ก. ดื้อแพ่งไม่ปฏิบัติตาม ในกรณีนี้ เจ้าหน้าที่มีแนวทางดำเนินการอย่างไร",  "answer" : "เจ้าหน้าที่อาจใช้มาตรการบังคับทางปกครองอย่างหนึ่งอย่างใด ดังต่อไปนี้",  "answer" : "<ol><li> เจ้าหน้าที่เข้าดำเนินการด้วยตนเองหรือมอบหมาย ให้บุคคลอื่นกระทำการแทน โดยผู้อยู่ในบังคับของคำสั่งทางปกครอง จะต้องชดใช้ค่าใช้จ่ายและเงินเพิ่มรายวัน ในอัตราร้อยละยี่สิบห้าต่อปีของค่าใช้จ่ายดังกล่าว แก่หน่วยงานของรัฐที่เจ้าหน้าที่นั้นสังกัด</li><li> ให้มีการชำระค่าปรับบังคับการตามจำนวนที่สม ควรแก่เหตุแต่ต้องไม่เกินห้าหมื่นบาทต่อวัน เจ้าหน้าที่ระดับใด มีอำนาจกำหนดค่าปรับบังคับการ จำนวนเท่าใด สำหรับในกรณีใด ให้เป็นไปตามที่กำหนดในกฎกระทรวง</li></ol> (มาตรา ๖๓/๒๑)"},
{ "id" : "101", "question" : "คำเตือน ที่เจ้าหน้าจัดทำ ก่อนการใช้มาตรการบังคับทางปกครอง ให้มีการกระทำ หรือละเว้นกระทำ จะต้องประกอบด้วยอะไรบ้าง",  "answer" : "<ol><li>มาตรการบังคับทางปกครองที่จะใช้ หากขัดขืนไม่ปฏิบัติตาม (ห้ามระบุเกินกว่า 1 มาตรการ ในคราวเดียวกัน)</li><li> ค่าใช้จ่ายและเงินเพิ่มรายวัน ในการที่เจ้าหน้าที่เข้าดำเนินการ ด้วยตนเองหรือ มอบหมายให้บุคคลอื่นกระทำการแทน หรือจำนวนค่าปรับบังคับการ แล้วแต่กรณี</li></ol>(มาตรา ๖๓/๒๒)"},
{ "id" : "102", "question" : "ถ้าผู้อยู่ในบังคับของคำสั่งทางปกครอง ต่อสู้ขัดขวาง การบังคับทางปกครอง เจ้าหน้าที่ มีแนวทางดำเนินการอย่างไร",  "answer" : "<ol><li>เจ้าหน้าที่อาจใช้กำลังเข้าดำเนินการ เพื่อให้เป็นไปตามมาตรการบังคับทางปกครองได้ แต่ต้องกระทำโดยสมควรแก่เหตุ</li><li>เจ้าหน้าที่อาจแจ้งขอความช่วยเหลือจากเจ้าพนักงานตำรวจได้ </li></ol>(มาตรา ๖๓/๒๓)"},
{ "id" : "103", "question" : "วันสุดท้ายของการดำเนินการของเจ้าหน้าที่ หากตรงกับวันหยุดจะเลื่อนไป ให้ถือว่าวันสิ้นสุด เป็นวันแรกของการเปิดการทำงานตามปกติ หรือไม่ ",  "answer" : "ไม่เลื่อน ยังให้ถือว่า วันหยุดนั้น เป็นวันสุดท้ายของกำหนดระยะเวลาข้างต้น (มาตรา ๖๔)"},
{ "id" : "104", "question" : "วันสุดท้ายของการดำเนินการของผู้อยู่ในบังคับการปกครอง หากตรงกับวันหยุด จะเลื่อนไปให้ถือว่าวันสิ้นสุด เป็นวันแรกของการเปิดการทำงานตามปกติ หรือไม่ ",  "answer" : "ให้ถือว่า วันแรกของการทำงาน เป็นวันสิ้นสุด (มาตรา ๖๔)"},
{ "id" : "105", "question" : "การแจ้งคำสั่งทางปกครองเป็นหนังสือให้ผู้ที่เกี่ยวข้องทราบ โดยส่งไปยังภูมิสำเนาของผู้นั้น  จะถือว่าผู้นั้นได้รับการแจ้งตั้งแต่เมื่อใด",  "answer" : "ตั้งแต่ที่หนังสือนั้นไปถึง (มาตรา ๖๙)"},
{ "id" : "106", "question" : "เจ้าหน้าที่แจ้งคำสั่งทางปกครองที่เป็นหนังสือ โดยให้คนนำหนังสือไปส่งที่บ้านของผู้รับ แต่ไม่พบผู้รับ จึงวางหนังสือนั้นบนโต๊ะหน้าประตูบ้าน จะถือว่า ผู้นั้นได้รับแจ้งแล้วหรือไม่",  "answer" : "ถือว่า ได้รับการแจ้งแล้ว (มาตรา ๗๐)"},
{ "id" : "107", "question" : "การแจ้งคำสั่งทางปกครองทางไปรษณีย์ตอบรับ ให้ถือว่าผู้รับ ได้รับการแจ้งเมื่อใด",  "answer" : "เมื่อครบกำหนด เจ็ดวัน นับแต่วันส่ง สำหรับกรณีภายในประเทศ หรือเมื่อครบกำหนดสิบห้าวัน นับแต่วันส่งสำหรับกรณีส่งไปยังต่างประเทศ เว้นแต่จะมีการพิสูจน์ได้ว่า ไม่มีการได้รับ หรือได้รับก่อน หรือหลังจากวันนั้น (มาตรา ๗๑)"},
{ "id" : "108", "question" : "การแจ้งคำสั่งทางปกครองโดยวิธีปิดประกาศไว้ ณ ที่ทำการของเจ้าหน้าที่ และที่ว่าการอำเภอ ที่ผู้รับมีภูมิลำเนา จะกระทำได้ในกรณีที่มีผู้รับมากกว่ากี่คน",  "answer" : "50 คน (มาตรา ๗๒)"},
{ "id" : "109", "question" : "กรณีการแจ้งคำสั่งทางปกครองโดยวิธีปิดประกาศไว้ ณ ที่ทำการของเจ้าหน้าที่ และที่ว่าการอำเภอ ที่ผู้รับมีภูมิลำเนา จะถือว่าผู้รับได้รับการแจ้งเมื่อใด",  "answer" : "เมื่อล่วงพ้นระยะเวลา 15 วัน นับแต่วันที่ได้แจ้ง  (มาตรา ๗๒)"},
{ "id" : "110", "question" : "มีกรณีใดบ้าง ที่เจ้าหน้าที่สามารถใช้วิธีการแจ้งคำสั่งทางปกครอง โดยการประกาศในหนังสือพิมพ์ ",  "answer" : "<ol><li>ไม่รู้ตัวผู้รับ</li><li>รู้ตัวผู้รับ แต่ไม่รู้ภูมิลำเนา </li><li>รู้ตัวผู้รับและรู้ภูมิลำเนาของผู้รับ แต่มีผู้รับเกินหนึ่งร้อยคน</li></ol> (มาตรา ๗๓)"},
{ "id" : "111", "question" : "กรณีที่เจ้าหน้าที่ใช้วิธีการแจ้งคำสั่งทางปกครอง โดยการประกาศในหนังสือพิมพ์ จะถือว่า ผู้รับได้รับการแจ้งเมื่อใด",  "answer" : "เมื่อล่วงพ้นระยะเวลาสิบห้าวัน นับแต่วันที่ได้ลงประกาศในหนังสือพิมพ์  (มาตรา ๗๓)"},
]
// var good_govt_shuffled = shuffle(good_govt);
changeData('principles_of_good_govt');


// ***************





var numOfQuestions = 10;  // เป็น dummy ว่ามีทั่้งหมด 10 ข้อ
var currQstnID = "tbl_q10"; // เป็น dummy ว่าทำไปถึงข้อ 10 แล้ว จะได้แสดงเครื่องหมายถูก ว่า ทำหมดแล้ว
var clickedQstns = "xzcccx11111";

// คือส่งข้อมูลเพื่อส่งไปยัง WillpopScope ซึ่งจะทำงานตอนคลิกปุ่มลูกศรกลับไปยังหน้าที่แล้วที่เข้ามา
// ข้อมูลที่ส่งไป เอาตามรูปแบบของข้อสอบที่เป็นไฟล์ html ซึ่งประกอบไปด้วย
// จำนวนข้อทั้งหมด, ข้อปัจจุบันที่คลิก, ชื่อ id และ วันที่
// ข้อมูลที่จะเอาไปทำ ไอคอน คือ จำนวนข้อทั้งหมด และข้อที่คลิก ซึ่งเป็นชื่อ id โดยที่ Willpop จะแยกเอาเฉพาะตัวเลข
//  ทำข้อที่ 10 จากจำนวนทั้งหมด 10 ข้อ จึงได้ 100% ได้ไอคอนชื่อ p00.png คือ มีเครื่องหมายถูก แสดงว่า เสร็จแล้ว

//var msgToSend = numOfQuestions + "xzc" + currQstnID + clickedQstns;

var args = numOfQuestions + "xzc" + currQstnID + clickedQstns;
console.log("zz messege to Flutter via messageHandler: " + args);



// ระวังตรงนี้ เวลา copy มาจาก Notebook มันคอมเม้นออก ต้องเอามาใส่ ไม่งั้นไม่รับข้อมูลจาก Flutter
// ส่งข้อมูลไป flutter ผ่าน JavascriptChannel ชื่อ messageHandler เพื่อบอกว่า ทำเสร็จแล้ว
//  messageHandler.postMessage(msgToSend);  // *****************************

 window.flutter_inappwebview.callHandler('messageHandler', ...args)
.then(function (result) {
// รับค่าที่ส่งเข่ามา
    console.log("isBuyAndMode จาก Flutter to JS via messageHandler: " + result.Message);
    isBuyAndMode(result.Message);
});




// รับข้อมูลมาจาก flutter
function isBuyAndMode(myDat){
var inComingData = myDat;

var isPremium; // ซื้อแล้ว
var is_darkMode;
var htmlMode; // มืดหรือสว่าง

var element = document.body; // สำหรับเปลี่ยนโหมด มืด-สว่าง โดยเปลี่ยนสี background และ ตัวหนังสือ
var hex = ("#00FF00");  // สำหรับเปลี่ยนสีลิงค์

 // alert("buy already?");

// แยก การซื้อ และโหมด ที่ส่งเข้ามา คั่นด้วย xyz
// เรื่องซื้อ ไม่ต้องเชค เพราะกันไว้แล้วว่า ถ้ายังไม่ซื้อ ไม่ให้เข้ามาทำข้อสอบที่นี
datArr = myDat.split("xyz");   //datArr[0] คือ ซื้อแล้วหรือยัง true=ซื้อแล้ว  datArr[1] คือ โหมดมือหรือไม่  true=ใช่โหมดมืด  false=ไม่ใช่โหมดมืด

is_Bought = datArr[0];

//alert("datArr buy already? " +  is_Bought);


// ไม่ต้องเชคแล้ว เพราะถ้ายังไม่ซื้อ ไม่ให้เข้ามาที่นี่เลย
//var demo = document.getElementById("demo_version");  // บางไฟล์มี  div ชื่อ demo_version ต้องซ่อน ถ้าซื้อแล้ว
//var full = document.getElementById("full_version");
//var fadeout = document.getElementById("fadeout");

classRoundedCorner = document.getElementsByClassName('rcorners1');
if (classRoundedCorner.length >= 1) {
    for (var i = 0; i < classRoundedCorner.length; i++){
        classRoundedCorner[i].style.borderColor = '#FDEAB3';
    };
 };
classBigBlue  = document.getElementsByClassName('big_blue');
if (classBigBlue.length >= 1) {
    for (var i = 0; i < classBigBlue.length; i++){
        classBigBlue[i].style.color = '#FBD052';
    };
};
classBigRed = document.getElementsByClassName('big_red');
if (classBigRed.length >= 1) {
    for (var i = 0; i < classBigRed.length; i++){
        classBigRed[i].style.color = '#FFC300';
    };
};
//
//// แยก การซื้อ และโหมด ที่ส่งเข้ามา คั่นด้วย xyz
//// เรื่องซื้อ ไม่ต้องเชค เพราะกันไว้แล้วว่า ถ้ายังไม่ซื้อ ไม่ให้เข้ามาทำข้อสอบที่นี
//datArr = myDat.split("xyz");   //datArr[0] คือ ซื้อแล้วหรือยัง true=ซื้อแล้ว  datArr[1] คือ โหมดมือหรือไม่  true=ใช่โหมดมืด  false=ไม่ใช่โหมดมืด
//
//is_Bought = datArr[0];
//alert("buy already?" +  is_Bought);

// ปรับโหมด มืด-สว่าง
is_darkMode = datArr[1];

// alert("is_darkMode \n(true = โหมดมืด, false = โหมดสว่าง) :" + is_darkMode);

if (is_darkMode == "true"){
    htmlMode = "dark";
 }else{
         htmlMode = "light";
     }

if (htmlMode=="dark"){ // ถ้าอยู่ในโหมด มืด
element.style.backgroundColor = 'black';
element.style.color = 'white';
// alert("htmlMode: "+ htmlMode);

 // กรอบล้อมรอบ คำถาม
 var tableBorder = document.getElementById("listingTable");
 tableBorder.style.borderColor = "gray";

 // กรอบล้อมรอบ คำตอบ
  var show_Answer = document.getElementById("showAnswer");
  show_Answer.style.borderColor = "gray";


// พื้นหลังเลขข้อ
var numBkg = document.getElementById('qa_item_num');  // เลขข้อ ใน Q&A
numBkg.style.backgroundColor = '#818589';  // gun metal grey
var bottomMenu =  document.getElementById('footer');
bottomMenu.style.backgroundColor = '#001C57';  // น้ำเงินเข้ม เกือบดำ oxford blue

var msgForNonByr =  document.getElementById('msgForNon-buyers');  // ให้ซื้อ
msgForNonByr.style.color = "#FFC0CB";  // ชมพู

// ปุ่ม แสดง/ซ่อน ตัวเลือก
var optnBttn = document.getElementById('show_options');
        optnBttn.style.backgroundColor = "#B2BEB5";
        optnBttn.style.color = "white";


// ถ้าอยู่ในโหมดมืด เปลี่ยนสีลิงค์ ให้สว่างขึ้น
    var links = document.getElementsByTagName("a");
    if(links !== null){
    for(var i=0;i<links.length;i++)
    {
        if(links[i].href)
        {
            links[i].style.color = hex;
        }
    }
    } // end of if(links !==

//  เปลี่ยนพื้นหลัง modal-content ที่แสดงผลการทำข้อสอบ
//var modalContent = document.getElementsByClassName("modal-content")[0];
//  alert("modalContent: " + modalContent);
//modalContent.style.backgroundColor = '#808080';

 // change background color of timer wraper
//var timerWrapper = document.getElementsByClassName("timer_wrapper");
//if (timerWrapper.length >= 1) {
//    for (var i = 0; i < timerWrapper.length; i++){
//        timerWrapper[i].style.backgroundColor = '#808080';
//    };
    // change timer font color from red to white
//    var time = document.getElementById("timer");
//    time.style.color = '#FFFFFF';
// };
//  เปลี่ยนสีพื้นตาราง ไม่เสถียร เลยไม่เปลี่ยน แก้เป็นสีน้ำตาลใน css แทน ใช้ทั้งสองโหมด
// ไม่เสถียร เพราะ ตอน run ครั้งแรก javascript ทำงานก่อน จึงไม่เจอตาราง ต้องเอา javascript ไปไว้ตอนท้าย เพื่อให้ทั้งหน้า load ให้เสร็จเรียบร้อยเสียก่อน
//// // qstn-div
var qstn_div = document.getElementsByClassName("qstn-div");
//   alert("qstn_div length: " + qstn_div.length);
 if (qstn_div.length >= 1) {
     for (var i = 0; i < qstn_div.length; i++){
  //   alert("qstn_div number: " + i);
         qstn_div[i].style.backgroundColor = '#4f4f4f';
     };
  };



    // change background color of table
     var tableElements = document.getElementsByTagName("table");
       if (tableElements.length >= 1) {
      for(var i = 0; i < tableElements.length; i++){
          var thisTable = tableElements[i] ;
          var rows = thisTable.getElementsByTagName("tr") ;
      		for (var j=0; j<rows.length; j++) {
      				rows[j].style.backgroundColor = "gray";
      		}
     		}
      	}




//  // change table row background
//  var tableElements = document.getElementsByTagName("table");
//   //    alert("table length: " + tableElements.length);
//  for(var i = 0; i < tableElements.length; i++){
//      var thisTable = tableElements[i];
//      var rows = thisTable.getElementsByTagName("tr") ;
//  //   alert("rows length: " + rows.length);
//  		for (var j=0; j<rows.length; j++) {
//  	//	     alert("what rows: " + j);
//  		rows[j].style.backgroundColor = "#5f5f5f";
//        }
//  	}  // end of for(var i = 0; i < tableElements

}else{  // ถ้าอยู่ในโหมด สว่าง
element.style.backgroundColor = 'white';
element.style.color = 'black';
}
}  // end of  isBuyAndMode(myDat)



// ***********************

function result() {
  var score = 0;
  not_correct.length = 0;
  correct_qstns.length = 0;
  skipped_qstns.length = 0;

	count = 0;

var node_list = document.getElementsByTagName('input');
 var count  = 0;
for (var i = 0; i < node_list.length; i++) {

 // หา node ที่เป็น radio button และที่ถูกเลือกด้วย
 if (node_list[i].type == 'radio' && node_list[i].checked) {
            count++;
        }
    }

var node_quiz = document.getElementsByClassName("quiz");
var this_qstn_score;

var num_of_qstns = node_quiz.length;
for (var i = 0; i < num_of_qstns; i++) {

checkForSkipped("q"+(i+1));

this_qstn_score =parseInt(getSelectedRadioValue("q"+(i+1))) || 0;
score += this_qstn_score;
 }




// จำนวนข้อที่ไม่ได้ทำ
var notChecked = num_of_qstns - count;

if(not_correct.length !== 0)
	{
	/*
	message = "คะแนนของท่าน: " + score + "  คะแนน หรือเท่ากับ  " + parseFloat((score /num_of_qstns)*100).toFixed(2) + " &#37; <br>ข้อที่ทำถูก: " + correct_qstns.toString() + "<br>ข้อที่ทำผิด: " + not_correct.toString();
	*/
	message = "คะแนนของท่าน: " + score + "  คะแนน หรือเท่ากับ  " + parseFloat((score /num_of_qstns)*100).toFixed(2) + " &#37;<br>ข้อที่ทำผิด: " + not_correct.toString();

	}else{
    message = "คะแนนของท่าน: " + score + "  คะแนน หรือเท่ากับ   " + parseFloat((score /num_of_qstns)*100).toFixed(2) + " &#37;"
	};

// ถ้ามีการไม่ทำบางข้อ ให้แสดงข้อมูลใน feedback ด้วย
	if (notChecked > 0)
	{
		message = message + "<br><br>ไม่ได้ทำข้อสอบ จำนวน " + notChecked + " ข้อ ได้แก่ " + skipped_qstns.toString() + "<br><br>ท่านสามารถปิดหน้าจอนี้ เพื่อกลับไปแก้ข้อผิด หรือทำต่อให้ครบ แล้วกดปุ่ม ส่งคำตอบ อีกครั้ง"
	}

// หยุดการจับเวลา
//		pauseCountDown();

//if (min > 0 && hour == 0)
//{
//	message = message +"<br><br>ใช้เวลาทำข้อสอบ " + min + " นาที";
//
//if (min > 0 && hour > 0)
//{
//	message = message +"<br><br>ใช้เวลาทำข้อสอบ " + hour + " ช.ม. " + min + " นาที";
//}

// แสดง feedback ใน id myMessage ของไฟล์ html ที่เรียกใช้งาน
		document.getElementById("myMessage").innerHTML = message;
		modal.style.display = "block";

//alert (message);

// ป้องกันไม่ให้หน้าจอเลื่อนไปข้างบน
 return false;
}

function checkForSkipped(name){
  var is_skipped=0;

  var radios = document.getElementsByName(name);

 var thisQstn = " ข้อ " + name.substr(1);

    for (var i = 0; i < radios.length; i++) {
			if (radios[i].checked){  //ถ้าไม่มีการเลือกข้อนี้
			is_skipped++; // เก็บข้อมูลข้อที่ข้าม ไม่ได้ทำ
	}	}

   if (is_skipped==0){  //ถ้าไม่มีการเลือกข้อนี้
			skipped_qstns.push(thisQstn); // เก็บข้อมูลข้อที่ข้าม ไม่ได้ทำ
	}
}


function getSelectedRadioValue(name) {
  var radios = document.getElementsByName(name);
  var thisQstn = " ข้อ " + name.substr(1);

  for (var i = 0; i < radios.length; i++) {

    if (radios[i].checked) {
		if(radios[i].value==0){
			// เก็บข้อที่ทำผิดไว้ใน array ชื่อ not_correct เพื่อจะนำไปแสดงใน feedback ด้วย
			not_correct.push(thisQstn);
		}else{
			// เก็บข้อที่ทำถูกไว้ใน array ชื่อ	correct_qstns เพื่อจะนำไปแสดงใน feedback ด้วย
			correct_qstns.push(thisQstn);
		}




      return radios[i].value;
    }

  }
}

/* for sequential numbers */
//
//var current = document.getElementById('default');
//
//  function highlite(el)
//  {
//     if (current != null)
//     {
//         current.className = "";
//     }
//     el.className = "highlite";
//     current = el;
//  }
//



function prevPage()
{
var showIt = document.getElementById("showAnswer");
showIt.style.display = 'none';
//var showMsg = document.getElementById("myMessage");
//showMsg.style.display = 'none';
// resetCountDown();
//document.getElementById('myInput').value = '';
// countDown(0,00,05)
    if (current_page > 1) {
        current_page--;
        changePage(current_page, true, thisJson);
    }
}

function nextPage()
{
var showIt = document.getElementById("showAnswer");
showIt.style.display = 'none';
//var showMsg = document.getElementById("myMessage");
//showMsg.style.display = 'none';
// countDown(0,00,05)
//resetCountDown();
//document.getElementById('myInput').value = '';
    if (current_page < numPages()) {
        current_page++;
        changePage(current_page, true, thisJson);
    }
}

function showItAns()
{

	//pauseCountDown();
    var showIt = document.getElementById("showAnswer");
//	showIt.innerHTML =  "คำตอบคือ: " + thisJson[current_page-1].answer + "<br>";
	showIt.innerHTML = thisJson[current_page-1].answer + "<br>";
	showIt.style.display = 'block';
}


function changeData(myJason){

// alert("data: " + myJason);
switch (myJason) {

case "good_govt":
//    document.getElementById('myInput').value = '';  // ลบที่พิมพ์คำตอบก่อนหน้านี้ ในช่อง input
	document.getElementById('showAnswer').style.display ='none';  // ซ่อนเฉลยที่ปรากฎอยู่
   thisJson =  principles_of_good_govt;  // เอาไปใช้ สำหรับให้ฝึก
	//current_page = 1;  // เริ่มที่หน้า 1
    changePage(1, false, thisJson);  // ส่งข้อมูลไปแสดง หน้า, ยังไม่เริ่มจับเวลา(เพราะเพิ่งเข้ามา), ไฟล์ข้อมูลที่เลือก
    break;

	case "principlesOfGoodGovt":
//    document.getElementById('myInput').value = '';  // ลบที่พิมพ์คำตอบก่อนหน้านี้ ในช่อง input
	document.getElementById('showAnswer').style.display ='none';  // ซ่อนเฉลยที่ปรากฎอยู่
   thisJson =  principles_of_good_govt;  // เอาไปใช้ สำหรับให้ฝึก
 //  alert("thisJason: " + thisJson);
	//current_page = 1;  // เริ่มที่หน้า 1
    changePage(1, false, thisJson);  // ส่งข้อมูลไปแสดง หน้า, ยังไม่เริ่มจับเวลา(เพราะเพิ่งเข้ามา), ไฟล์ข้อมูลที่เลือก
    break;
default:
  	// clear input field
 //   document.getElementById('myInput').value = '';
	document.getElementById('showAnswer').style.display ='none';
//	shuffle(objJsonSimple);
    thisJson =  principles_of_good_govt;
	current_page = 1;
    changePage(1, false, thisJson);
}
}

function goToPage(whatPage, whatData){  //สำหรับ ไปหน้าแรก หน้าสุดท้าย หรือหน้าที่ระบุ
var pos;

//    document.getElementById('myInput').value = '';  // ลบที่พิมพ์คำตอบก่อนหน้านี้ ในช่อง input
   document.getElementById('showAnswer').style.display ='none';  // ซ่อนเฉลยที่ปรากฎอยู่
   thisJson =  whatData;  // เอาไปใช้ สำหรับให้ฝึก
   if(whatPage == "start"){
   pos = 1;
   current_page = 1;
   }else if(whatPage == "end"){
   pos = thisJson.length;
   current_page = pos;
   }else if(whatPage == "specify"){
    var goPageNum = document.getElementById("itemToGo").value;
         if((goPageNum > thisJson.length-1)||(goPageNum < 1)){
            alert("ไม่พบเลขข้อที่ท่านระบุ");
    		return;
         }else{
            pos = goPageNum;
            current_page = pos;
            }
       }
  // alert("go Page: " + pos);
	//current_page = 1;  // เริ่มที่หน้า 1
    changePage(pos, false, thisJson);  // ส่งข้อมูลไปแสดง หน้า, ยังไม่เริ่มจับเวลา(เพราะเพิ่งเข้ามา), ไฟล์ข้อมูลที่เลือก
//    break;
}

function changePage(page, isStartTiming, myJason)
{
let order = getRadioCheckedValue("isOrder");
let autoShowAns =  getRadioCheckedValue("isShowAns");

// alert("order: " + order + "\nisShow: " + autoShowAns);
// alert("data in changePage: " + myJason[1].question);
var notShuffled_json = myJason;

    var btn_next = document.getElementById("btn_next");
    var btn_last = document.getElementById("go_last");
    var btn_prev = document.getElementById("btn_prev");
    var btn_first = document.getElementById("go_first");

    var listing_table = document.getElementById("listingTable");
    var page_span = document.getElementById("page");
	var orderBtn =  document.getElementById("fromStartToEnd");
	var orderBtnLabel =  document.getElementById("fromStartToEndLabel");
	var showAnsDiv = document.getElementById("forBtnShowAns");
//    alert("xxx buy already? " +  is_Bought + " page: " + page);

	if (order == 'no'){
        if(firstQuestion !== myJason_shuffled[0]){ // สลับเพียงครั้งเดียว ต่อการใช้งาน
            shuffle(myJason);  // เอา list ข้อมูล มาสลับเสียใหม่ ไม่ให้เรียงลำดับ
        //    alreadyShuffled = true;
            myJason_shuffled = myJason;
            firstQuestion = myJason_shuffled[0];
        }else{  // ไม่สลับใหม่ แต่ ใช้ที่เคยสลับแล้ว
              myJason = myJason_shuffled;
        }
 //  orderBtn.disabled = true;
 //  orderBtnLabel.style.color = '#a6a6a6';
           //   alert(thisJson[5].id);
	}else{
            myJason.sort(function(a, b) {
                 return parseFloat(a.id) - parseFloat(b.id); // เรียงตาม id จากน้อย ไป มาก
             });
         //    alert(thisJson[5].id);
	//myJason = notShuffled_json
	}

if(autoShowAns == 'no'){
//	alert("current_page: " + current_page);
showItAns()  // แสดงเลย ไม่ต้องคลิก
const ans_btn = document.getElementById('showAnswer_btn');  // เบลอ gray out ปุ่มแสดงคำตอบ
ans_btn.style.display = "none";
}else{
const ans_btn = document.getElementById('showAnswer_btn');  // เบลอ gray out ปุ่มแสดงคำตอบ
ans_btn.style.display = "block";

}

// เวลาจะใช้จริง ให้กำหนดเป็น 15
 //if((is_Bought == "false") && (page >=200)){

 if((is_Bought == "false") && (current_page >=15)){
 // alert("xxxx");
  var ans_btn = document.getElementById('showAnswer_btn');
  ans_btn.disabled = true;
  var ans_div = document.getElementById('showAnswer');
  ans_div.style.display = 'none';
  var msgForNon = document.getElementById('msgForNon-buyers');
  msgForNon.style.display = 'block';

  }



// if (isStartTiming == true)
// {
// countDown(0,02,0)
// }
    // Validate page
if (page < 1) page = 1;
    if (page > numPages()) page = numPages();

    listing_table.innerHTML = "";

//    for (i = (page-1) * records_per_page; i < (page * records_per_page) && i < objJson.length; i++) {
//        listing_table.innerHTML += objJson[i].number  + "<br>";
//    }
//alert("data before iteration i : " + myJason[1].question);
	    for (i = (page-1) * records_per_page; i < (page * records_per_page) && i < myJason.length; i++) {
        listing_table.innerHTML += myJason[i].question  + "<br>";
    }
    page_span.innerHTML = page + "/" + numPages();

    if (page == 1) {
    btn_prev.disabled = true;
    btn_first.disabled = true;
     //   btn_prev.style.visibility = "hidden";
      //  btn_first.style.visibility = "hidden";
    } else {
        btn_prev.disabled = false;
        btn_first.disabled = false;
     //   btn_prev.style.visibility = "visible";
      //  btn_first.style.visibility = "visible";
    }

    if (page == numPages()) {
     btn_next.disabled = true;
     btn_last.disabled = true;
        //btn_next.style.visibility = "hidden";
       // btn_last.style.visibility = "hidden";
    } else {
         btn_next.disabled = false;
         btn_last.disabled = false;
//        btn_next.style.visibility = "visible";
//        btn_last.style.visibility = "visible";
    }
}

function numPages()
{
//    return Math.ceil(objJson.length / records_per_page);
	  return Math.ceil(thisJson.length / records_per_page);
}

function showOptions(){
var options = document.getElementById("nav");
btn = document.getElementById('show_options');
  if (options.style.display === "none") {
    options.style.display = "block";
	btn.textContent = 'ซ่อนตัวเลือกการใช้งาน';
	btn.style.color = "red";
  } else {
    options.style.display = "none";
	btn.textContent = 'แสดงตัวเลือกการใช้งาน';
	btn.style.color = "";
  }
}





/*for timer
var myVar = 0;*/
//var hour,min,sec;
//var isPause=false;
//var css_start = "display = inline; position: relative; top: 1px; font-size: 20px; font-weight: bold; min-width: 70px; min-height: 10px;";
//var pause_btn = "display = inline; position: relative; top: 1px; font-size: 20px; font-weight: bold; color: red; min-width: 70px; min-height: 10px;";
//var css_btns = "display = inline; position: relative; top: 1px; font-size: 20px; font-weight: bold; min-width: 70px; min-height: 10px;";
//var css_disp_none = "display:none; position: relative; top: 1px; font-size: 20px; font-weight: bold; min-width: 70px; min-height: 10px;";
//var css_row = "position: relative; top: 1px;";


//function countDown(h,m,s){

//document.getElementById("start").style.cssText = css_disp_none;
//document.getElementById("pause").style.cssText = pause_btn;
//document.getElementById("reset").style.cssText = css_btns;
// document.getElementById("row").style.cssText = css_row;

//if (isPause==false)
//{
//	hour = 0;
//	min=0;
//	sec=1;
//}

//if (hour >= h && min >= m && sec >=0)
//{
//	hour = 0;
//	min=0;
//	sec=1;
//}

//myVar = setInterval(function(){

  //     document.getElementById("timer").innerHTML = hour +" : " + min +" : " + sec ;
//       sec++;
//		if(hour == h && min == m && sec == (s+1)){
//			document.getElementById("start").style.cssText = css_start;
//			document.getElementById("pause").style.cssText = css_disp_none;
//			document.getElementById("reset").style.cssText = css_btns;
		//	document.getElementById("row").style.cssText = css_row;

			message = "<strong><font color=\"red\">หมดเวลา </font></strong><br>";
			// แสดง feedback ใน id myMessage ของไฟล์ html ที่เรียกใช้งาน
//			document.getElementById("myMessage").innerHTML = message;
//			modal.style.display = "block";


			// alert("time's up");

//			clearInterval(myVar);
//			return;
//		}

//       if(sec == 60)
//       {
 //        min++;
 //        //sec = 60;
//		 sec = 0;
 //        if (min == 60)
   //      {
	//		 hour++;
//			 //min = 60;
//			 min = 0;
//			 if (hour == h)
//			 {
//				 hour = h;
//
//			 }

//         }
 //      }
  //    },1000);
//    }

function shuffle(array) {
  let currentIndex = array.length,  randomIndex;
  // While there remain elements to shuffle.
  while (currentIndex != 0) {
    // Pick a remaining element.
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex--;
    // And swap it with the current element.
    [array[currentIndex], array[randomIndex]] = [
      array[randomIndex], array[currentIndex]];
  }
  return array;
}




function getRadioCheckedValue(radio_name)
{
   var oRadio = document.forms[0].elements[radio_name];

   for(var i = 0; i < oRadio.length; i++)
   {
      if(oRadio[i].checked)
      {
         return oRadio[i].value;
      }
   }
   return '';

}

function shuffle(array) {
  let currentIndex = array.length,  randomIndex;
  // While there remain elements to shuffle.
  while (currentIndex != 0) {
    // Pick a remaining element.
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex--;
    // And swap it with the current element.
    [array[currentIndex], array[randomIndex]] = [
      array[randomIndex], array[currentIndex]];
  }
  return array;
}

function getRadioCheckedValue(radio_name)
{
   var oRadio = document.forms[0].elements[radio_name];

   for(var i = 0; i < oRadio.length; i++)
   {
      if(oRadio[i].checked)
      {
         return oRadio[i].value;
      }
   }
   return '';

}

/*!
 * swiped-events.js - v@version@
 * Pure JavaScript swipe events
 * https://github.com/john-doherty/swiped-events
 * @inspiration https://stackoverflow.com/questions/16348031/disable-scrolling-when-touch-moving-certain-element
 * @author John Doherty <www.johndoherty.info>
 * @license MIT
 */
(function (window, document) {

    'use strict';

    // patch CustomEvent to allow constructor creation (IE/Chrome)
    if (typeof window.CustomEvent !== 'function') {

        window.CustomEvent = function (event, params) {

            params = params || { bubbles: false, cancelable: false, detail: undefined };

            var evt = document.createEvent('CustomEvent');
            evt.initCustomEvent(event, params.bubbles, params.cancelable, params.detail);
            return evt;
        };

        window.CustomEvent.prototype = window.Event.prototype;
    }

    document.addEventListener('touchstart', handleTouchStart, false);
    document.addEventListener('touchmove', handleTouchMove, false);
    document.addEventListener('touchend', handleTouchEnd, false);

    var xDown = null;
    var yDown = null;
    var xDiff = null;
    var yDiff = null;
    var timeDown = null;
    var startEl = null;

    /**
     * Fires swiped event if swipe detected on touchend
     * @param {object} e - browser event object
     * @returns {void}
     */
    function handleTouchEnd(e) {

        // if the user released on a different target, cancel!
        if (startEl !== e.target) return;

        var swipeThreshold = parseInt(getNearestAttribute(startEl, 'data-swipe-threshold', '20'), 10); // default 20px
        var swipeTimeout = parseInt(getNearestAttribute(startEl, 'data-swipe-timeout', '500'), 10);    // default 500ms
        var timeDiff = Date.now() - timeDown;
        var eventType = '';
        var changedTouches = e.changedTouches || e.touches || [];

        if (Math.abs(xDiff) > Math.abs(yDiff)) { // most significant
            if (Math.abs(xDiff) > swipeThreshold && timeDiff < swipeTimeout) {
                if (xDiff > 0) {
                    eventType = 'swiped-left';
                }
                else {
                    eventType = 'swiped-right';
                }
            }
        }
        else if (Math.abs(yDiff) > swipeThreshold && timeDiff < swipeTimeout) {
            if (yDiff > 0) {
                eventType = 'swiped-up';
            }
            else {
                eventType = 'swiped-down';
            }
        }

        if (eventType !== '') {

            var eventData = {
                dir: eventType.replace(/swiped-/, ''),
                touchType: (changedTouches[0] || {}).touchType || 'direct',
                xStart: parseInt(xDown, 10),
                xEnd: parseInt((changedTouches[0] || {}).clientX || -1, 10),
                yStart: parseInt(yDown, 10),
                yEnd: parseInt((changedTouches[0] || {}).clientY || -1, 10)
            };

            // fire `swiped` event event on the element that started the swipe
            startEl.dispatchEvent(new CustomEvent('swiped', { bubbles: true, cancelable: true, detail: eventData }));

            // fire `swiped-dir` event on the element that started the swipe
            startEl.dispatchEvent(new CustomEvent(eventType, { bubbles: true, cancelable: true, detail: eventData }));
        }

        // reset values
        xDown = null;
        yDown = null;
        timeDown = null;
    }

    /**
     * Records current location on touchstart event
     * @param {object} e - browser event object
     * @returns {void}
     */
    function handleTouchStart(e) {

        // if the element has data-swipe-ignore="true" we stop listening for swipe events
        if (e.target.getAttribute('data-swipe-ignore') === 'true') return;

        startEl = e.target;

        timeDown = Date.now();
        xDown = e.touches[0].clientX;
        yDown = e.touches[0].clientY;
        xDiff = 0;
        yDiff = 0;
    }

    /**
     * Records location diff in px on touchmove event
     * @param {object} e - browser event object
     * @returns {void}
     */
    function handleTouchMove(e) {

        if (!xDown || !yDown) return;

        var xUp = e.touches[0].clientX;
        var yUp = e.touches[0].clientY;

        xDiff = xDown - xUp;
        yDiff = yDown - yUp;
    }

    /**
     * Gets attribute off HTML element or nearest parent
     * @param {object} el - HTML element to retrieve attribute from
     * @param {string} attributeName - name of the attribute
     * @param {any} defaultValue - default value to return if no match found
     * @returns {any} attribute value or defaultValue
     */
    function getNearestAttribute(el, attributeName, defaultValue) {

        // walk up the dom tree looking for attributeName
        while (el && el !== document.documentElement) {

            var attributeValue = el.getAttribute(attributeName);

            if (attributeValue) {
                return attributeValue;
            }

            el = el.parentNode;
        }

        return defaultValue;
    }

}(window, document));

//
//document.addEventListener('DOMContentLoaded', () => {
//  const secondDiv = document.getElementById('second_div');
//  console.log(document.getElementById('second_div'));
//  if (secondDiv) {
//    secondDiv.scrollIntoView();
//  }
//});
//
//document.addEventListener('DOMContentLoaded', () => {
//  const firstDiv = document.getElementById('first_div');
//  console.log(document.getElementById('first_div'));
//  if (firstDiv) {
//    firstDiv.scrollIntoView();
//  }
//});
