//var isPremiumVersion = "false";    // ถ้าใช้บน PC เพราะเรียกจาก Android  ไม่ได้ ค่าที่ส่งเข้ามา คือ  true  หรือ  false
 //var isPremiumVersion = Android.getIsFullVersion(); // เรียก method จาก android class ชื่อ JavaScriptInterface    ค่าที่ส่งเข้ามา คือ  true  หรือ  false

// วันนี้เรียนรู้อีกอย่าง เรื่องการรับส่งข้อมูลระหว่าง flutter - javascript
// ประเด็นคือ ต้องอยู่ใน JavascriptChannel เดียวกัน เช่น ไฟล์นี้ full_exam.js
// ส่งข้อมูลไปทาง MessageHandler ก็ต้องสร้างฟังก์ชัน isBuyAndMode เพื่อรับข้อมูล
// จะไปสร้าง is_IsNewClicked เพื่อรับข้อมูลไม่ได้ เพราะอยู่คนละ Channel กัน
// หาอยู่ตั้งนานว่า ผิดตรงไหน เพราะ flutter ไม่บอกว่ามี error เพียงแต่ไม่มีค่าตัวแปรที่ส่งมาให้

var htmlMode; // มืดหรือสว่าง  64
var isPremiumVersion;
var correct_qstns = [];
var not_correct = [];
var skipped_qstns = [];
var message;
var count;
var hour=0;
var min=0;
var sec=0;
var myVar = 0;  // for timer setInterval
var is_Bought;
// ***************


//var numOfQuestions = 10;  // เป็น dummy ว่ามีทั่้งหมด 10 ข้อ
//var currQstnID = "tbl_q10"; // เป็น dummy ว่าทำไปถึงข้อ 10 แล้ว จะได้แสดงเครื่องหมายถูก ว่า ทำหมดแล้ว


var numOfQuestions;  // เป็น dummy ว่ามีทั่้งหมด 10 ข้อ
var currQstnID;   // ทำไปถึงข้อ อะไร แล้ว  "tbl_q" + alreadyDone;
var totalQsntNum;  // สำหรับหาว่า มีทั้งหมดกี่ข้อ จะได้เอามาต่อที่ currQstnID เป็นข้อสุดท้าย



// ตรงนี้ ต้องดูว่า เมื่อคลิกแสดงคำตอบ เก็บข้อของเมนูนี้-หรือเพิ่มข้อที่ทำให้มากขึ้นอีก 1
// เก็บ จำนวนที่ทำทั้งหมด ได้ โดยเอาที่จากใน Pref ที่หามาแล้ว มารวมกัน
// ถ้าเข้ามาครั้งแรก ยังไม่มี คือเป็น 1 หมด ถือว่ายังไม่ได้ทำ


var clickedQstns = "xzcccx11111";
	var btn_pause = document.getElementById("pause");
	var btn_reset = document.getElementById("reset");
	btn_start = document.getElementById("start");



var lastQstnArr; // สำหรับเก็บ ข้อสุดท้ายแบบฝึกหัดที่เคยทำ ซึ่งเก็บไว้ใน sharePref

// คือส่งข้อมูลเพื่อส่งไปยัง WillpopScope ซึ่งจะทำงานตอนคลิกปุ่มลูกศรกลับไปยังหน้าที่แล้วที่เข้ามา
// ข้อมูลที่ส่งไป เอาตามรูปแบบของข้อสอบที่เป็นไฟล์ html ซึ่งประกอบไปด้วย
// จำนวนข้อทั้งหมด, ข้อปัจจุบันที่คลิก, ชื่อ id และ วันที่
// ข้อมูลที่จะเอาไปทำ ไอคอน คือ จำนวนข้อทั้งหมด และข้อที่คลิก ซึ่งเป็นชื่อ id โดยที่ Willpop จะแยกเอาเฉพาะตัวเลข
//  ทำข้อที่ 10 จากจำนวนทั้งหมด 10 ข้อ จึงได้ 100% ได้ไอคอนชื่อ p00.png คือ มีเครื่องหมายถูก แสดงว่า เสร็จแล้ว



// ไปเอาชื่อ id เมนู(ที่นำหน้าด้วย exMenu_ )  จากใน html เพื่อนำมาใส่ array ชื่อ menuIDs สำหรับ เอาไปเป็น
//ข้อมูลเรื่องนั้น ๆ ส่งไป Flutter
var menuIDs = [];
Array.from(
    document.querySelectorAll('[id^="exMenu_"]'))
    .forEach(function (x) {
    //    copyText += x.text + '\n'
		menuIDs.push(x.name);
    }
);
//alert("copyText: " + copyText);


var namesToSend = menuIDs.toString();

// alert("namesToSend: " + namesToSend);
console.log("copyText -- namesToSend: " + namesToSend);

menuNameToFlutter.postMessage(namesToSend);


function isContainValue(val){
    return (val === undefined || val == null || val.length <= 0) ? false : true;
}



// รับข้อมูลมา  การทำข้อสุดท้าย จาก flutter
function getLastQstnNum(myLastQNum){
   // ค่าที่ส่งเข้ามา เช่น normal_cndtngxyz1 fraction_cndtngxyz1 plus_minus_cndtngxyz1 min_max_cndtngxyz1 multi_connection_cndtngxyz1

    lastQstnArr = myLastQNum.split(" "); // แยกออกจากกัน โดยใช้ช่องว่าง เป็นเกณฑ์
  //  alert("lastQstnArr from sharePref: " + lastQstnArr) + "\n\nlastQstnArr[2]: " + lastQstnArr[2];


  // เอาเฉพาะตัวเลขมารวมกัน เพื่อเอาไปคิดเปอร์เซ็นต์ ว่า ทำไปเท่าไรแล้ว

  //แยก แล้วเอาเฉพาะตัวเลข(อยู่ในรูป String)  ที่อยู่หลัง xyz
  var numbers = lastQstnArr.map(function(n){
     return n.split("xyz")[1];
  })

// เปลี่ยน string เป็นตัวเลข จะได้เอาไปบวกกันได้
numbers = numbers.map(Number);
//  alert("numbers: "+ numbers);
  // รวมทั้งหมดเข้าด้วยกัน
  var thisSum = numbers.reduce(add, 0); // with initial value to avoid when the array is empty

function add(accumulator, a) {
    return accumulator + a;
  }

// alert("thisSum: " + thisSum);


// เลขข้อสุดท้าย ยัง undefined อยู่
	if(thisSum <= 5){  // เพราะว่า ตอนแรก ยังไม่ได้ทำ เข้ามาใหม่ ๆ กำหนดให้เป็น ข้อ 1 ใน sharePref มี 4 เมนู
	 alreadyDone = 0;
	}else{
	alreadyDone = thisSum;
	}

    currQstnID = "tbl_q" + alreadyDone;

 //   alert("currQstnID: " + currQstnID);


var msgToSend = numOfQuestions + "xzc" + currQstnID + clickedQstns;  // ข้อมูลที่จะส่งไป Flutter
 messageHandler.postMessage(msgToSend);  // ส่งไป Flutter

}


// จัดการแยกตัวแปรข้อมูล json ออกเป็นตัวแปรย่อย สำหรับเรื่องกฎหมาย

// Initialize three smaller arrays
var metaphor_dat = [

{id:"25660201_RN7795_00_metaphor_Facebook_1", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ปู : เสื่อ  ::  ?  : ?<hr>1) ยิง : ปืน <br>2) ระบาย : สี<<br>3) กาง : เต้นท์ <br>4) เขียน : ปากกา <br>",
 answer:  "กาง : เต้นท์ <br><br>ในบรรดาตัวเลือกทั้งหมด จะเห็นว่า เต้นท์ มีลักษณะเหมือน เสื่อ มากที่สุด<br>"},

{id:"25660201_RN7795_00_metaphor_Facebook_1", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> นักเรียน : เกรด  ::  ?  : ?<hr>1) ห้องเรียน : โรงเรียน <br>2) ตำรวจ : ผู้ร้าย<<br>3) พนักงาน : เงินเดือน <br>4) พืช : สังเคราะห์แสง <br>",
 answer:  "พนักงาน : เงินเดือน<br><br>นักเรียน หวัง เกรด<br>พนักงาน หวัง เงินเดือน<br>"},

{id:"25620101_RN9629_00_metaphor_Max_20", number:"<small>ข้อสอบเสมือนจริง กพ 2562</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> โพล้เพล้ : พลบค่ำ  ::  ?  : ?<hr>1) ทิวา : กลางวัน <br>2) สายัณห์ : กลางคืน<<br>3) ราตรี : เที่ยงคืน <br>4) อรุณ : เช้าตรู่ <br>",
 answer:  "อรุณ: เช้าตรู่ <br><br>วิเคราะห์แบบ ข้ามคู่ <br><br>โพล้เพล้ ตรงข้ามกับ อรุณ<br>พลบค่ำ ตรงข้ามกับ เช้าตรู่   <br><br>ความหมาย<br>โพล้เพล้ - เวลาพลบคํ่า, เวลาจวนคํ่า, เวลาเข้าไต้เข้าไฟ<br>พลบค่ำ - เวลาย่ำค่ำ, เวลาโพล้เพล้, เวลาเข้าไต้เข้าไฟ<br>อรุณ - เวลาใกล้พระอาทิตย์จะขึ้น, เวลายํ่ารุ่ง<br>สายัณห์ - เวลาเย็น <br>เช้าตรู่ - เวลาสาง ๆ, เวลาที่แสงเงินแสงทองขึ้น, รุ่งอรุณ.<br>ทิวา - วัน กลางวัน <br><br>ข้อ 4 ถูกมากกว่า ข้อ 1 เพราะ ข้อ 1 มีความหมายเหมือนกันเหมือนข้อความที่กำหนด แต่ ข้อ 4 นอกจากจะมีความหมายเหมือนกันเหมือนข้อความที่กำหนดแล้ว ยังเป็นช่วงเวลาสั้น ๆ เหมือนกัน และยังมีความหมายในเชิงตรงข้ามกันอีกด้วย<br>"},

{id:"25620101_RN9629_00_metaphor_Max_20", number:"<small>ข้อสอบเสมือนจริง กพ 2562</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> คาน : ตาชั่งจีน ::  ?  : ?<hr>1) สกรู : บันไดเวียน <br>2) ชะแลง : เพลา<<br>3) กระดาษ : ปากกา<br>4) ตะปู : ไม้ <br>",
 answer:  "สกรู: บันไดเวียน<br><br>ลักษณะการทำงานเหมือนกัน  <br>ไม้คาน : ตาชั่งจีน มีลักษณะเป็นคาน เหมือนกัน<br>สกรู : บันไดเวียน มีลักษณะวน ๆ หมุน ๆ เหมือนกัน<br><img style='display: block;  margin-left: auto;  margin-right: auto;  width:100%; max-width:400px;' src='images/chinese_scale.png'><br>"},

{id:"25620101_RN7953_00_metaphor_Max_20", number:"<small>ข้อสอบเสมือนจริง กพ 2562</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ปล่อย : รวบ ::  ?  : ?<hr>1) สะดุด : ล้ม <br>2) นิ่ง : ขยับ<<br>3) ท้าย : ปลาย<br>4) แบก : หาม<br>",
 answer:  "นิ่ง : ขยับ<br><br>ความหมายตรงกันข้าม  <br><br>"},

{id:"25660101_RN7953_00_metaphor_Max_20", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ขมิ้น : ไพล ::  ?  : ?<hr>1) ส้ม  : พลับ <br>2) ฟักทอง :  ทุเรียน<<br>3) มันสำปะหลัง :  หัวไชเท้า<br>4) พริก : กระชาย<br>",
 answer:  "มันสำปะหลัง :  หัวไชเท้า<br><br>เป็นหัวเหมือนกัน  <br><br>"},

{id:"25660101_RN9778_00_metaphor_Max_20", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> มะนาว : มะม่วง ::    : ?<hr>1) ส้ม : มะปราง <br>2) แก้วมังกร : เมล่อน<br>3) องุ่น : แอบเปิ้ล<br>4) ฟักทอง : แตงโม<br>",
 answer:  "ส้ม : มะปราง<br><br>รสเปรี้ยวเหมือนกัน  <br><br>"},

{id:"25640501_RN4739_00_metaphor_Max_19", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>มีด : หั่น ::    : ?<hr>1) ตัด :  กรรไกร <br>2) ขวาน : จาม<br>3) ทุบ : ค้อน<br>4) คีม : เจาะ<br>",
 answer:  "ขวาน : จาม<br><br> สิ่งของ : หน้าที่ <br><br>มีด ใช้ หั่น<br>ขวาน ใช้ จาม<br><br>จาม - ฟันลงไปเต็มที่ เช่น เอาขวานจามหัว."},

{id:"25640501_RN4739_00_metaphor_Max_18", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ป้องกัน : เกราะ ::    : ?<hr>1) เผา :  ไฟ <br>2) ตัก : พลั่ว<br>3) ประเทศ : ทหาร<br>4) ตำรวจ : อาวุธ<br>",
 answer:  "ตัก : พลั่ว<br><br>หน้าที่  :  สิ่งของ<br><br>ป้องกัน ใช้ เกราะ<br>ตัก ใช้ พลั่ว<br>"},

{id:"25640501_RN4739_00_metaphor_Max_17", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ปริญญา : ศึกษา ::    : ?<hr>1) ใบ รบ. : นักเรียน <br>2) ทะเบียนสมรส : สมรส<br>3) ตั๋วโดยสาร : เดินทาง<br>4) ตำรวจ : อาวุธ<br>",
 answer:  "ทะเบียนสมรส : สมรส<br><br>ปริญญา ได้มาจากการ ศึกษา<br>ทะเบียนสมรส ได้มาจากการ สมรส<br><br>ใบ รบ. ก็ได้มาจากการเป็น นักเรียน แต่ คำว่า "นักเรียน" เป็นคำนาม<br>ตัวเลือกข้อ 2 จึงมีความสัมพันธ์มากกว่า ข้อ 1<br>"},

{id:"25640501_RN4739_00_metaphor_Max_16", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>แชมพู : สบู่ ::    : ?<hr>1) ครีมนวดผม :  แปรงผม <br>2) ยาสีฟัน : ครีมทาผิว<br>3) น้ำยาดัดผม : น้ำยาทาเล็บ<br>4) น้ำยาบ้วนปาก : แปรงสีฟัน<br>",
 answer:  "ยาสีฟัน : ครีมทาผิว<br><br>ตำแหน่งที่ใช้ผลิตภัณฑ์<br>ใช้กับใบหน้าและศีรษะ : สิ่งที่ใช้กับลำตัว<br>"},

{id:"25640501_RN1202_00_metaphor_Max_15", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ขิม : ตัว ::    : ?<hr>1) เปียนโน :  อัน <br>2) ระนาด : ราง<br>3) ไวโอลิน : ตัว<br>4) โปงลาง : ตัว<br>",
 answer:  "ระนาด : ราง<br><br>เปียนโน - หลัง<br>ระนาด - ราง<br>ไวโอลิน - คัน<br>โปงลาง - ผืน<br><br>เพิ่มเติม<br>1. ขลุ่ย, ปี่ ลักษณนามคือ เลา<br>2. กีตาร์, ทรัมเป็ต, ทรอมโบน ลักษณนามคือ ตัว<br>3. กระจับปี่, ซอ, ซึง, พิณ ลักษณนามคือ คัน<br>4. แคน ลักษณนามคือ เต้า<br>5. กรับ, ฉิ่ง, ฉาบ ลักษณนามคือ คู่6. เปียโน ลักษณนามคือ หลัง<br>7. หีบเพลงปาก ลักษณนามคือ อัน<br>8. กรับพวง ลักษณนามคือ พวง<br>9. กลอง, ฆ้อง, ตะโพน ลักษณนามคือ ใบ, ลูก<br>10. โปงลาง ลักษณนามคือ ผืน<br> "},

{id:"25640501_RN1202_00_metaphor_Max_14", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>น้ำตาล : อ้อย ::    : ?<hr>1) ถั่วเขียว :  ถั่วงอก <br>2) กะปิ : เคย<br>3) ถั่วเหลือง : ซีอิ๊ว<br>4) เกลือ : น้ำปลา <br>",
 answer:  "กะปิ : เคย<br><br>น้ำตาล ทำจาก อ้อย<br>กะปิ ทำจาก เคย<br><br>ถั่วเขียว ไม่ได้ทำจาก ถั่วงอก<br>ถั่วเหลือง ไม่ได้ทำจาก ซีอิ๊ว<br>เกลือ ไม่ได้ทำจาก น้ำปลา<br><br>ความสัมพันธ์ต้องเรียงลำดับกันให้ถูกต้องด้วย<br>"},

{id:"25640501_RN8137_00_metaphor_Max_12", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ฝนตก : ฟ้าร้อง ::    : ?<hr>1) ขยัน :  ซื่อสัตย์ <br>2) รวย : ขี้เกียจ<br>3) เสียใจ : ร้องไห้<br>4) เข้มแข็ง : อ่อนแอ <br>",
 answer:  "เสียใจ : ร้องไห้ <br><br>สิ่งที่มักจะเกิดขึ้นด้วยกัน<br>ฝนตก กับ ฟ้าร้อง มักจะเกิดขึ้นด้วยกัน (แต่ไม่จำเป็นเสมอไป)<br>เสียใจ กับ ร้องไห้ มักจะเกิดขึ้นด้วยกัน (แต่ไม่จำเป็นเสมอไป)"},

{id:"25640101_RN8167_00_metaphor_Max_11", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>สุริยา : ตะวัน ::    : ?<hr>1) นภา :  ท้องฟ้า <br>2)  ทินกร : อัศดง<br>3) พันแสง : จันทรา<br>4) ดารา : นักร้อง <br>",
 answer:  "สงสาร : อุปการะ <br><br>ความรู้สึก  :  การกระทำ<br>อาสา เพราะมีความเต็มใจ<br>อุปการะ เพราะมีความสงสาร"},

{id:"25640101_RN4183_00_metaphor_Max_10", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เต็มใจ : อาสา ::    : ?<hr>1) เลว :  เจ้าเล่ห์  <br>2)  สงสาร : อุปการะ<br>3) ผิด : ลบ<br>4) สำนึก : ลงโทษ <br>",
 answer:  "สงสาร : อุปการะ <br><br>ความรู้สึก  :  การกระทำ<br>อาสา เพราะมีความเต็มใจ<br>อุปการะ เพราะมีความสงสาร"},

{id:"25640101_RN8860_00_metaphor_Max_09", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ศีรษะ : หมวก :: บ้าน    : ?<hr>1) ประตู  <br>2) หน้าจั่ว <br>3) หลังคา<br>4) ตึก <br>",
 answer:  "หลังคา <br><br>หมวก ปกป้อง ศีรษะ จากแดด<br>หลังคา ปกป้อง บ้าน จากแดด"},

{id:"25640101_RN3144_00_metaphor_Max_08", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ปลา : เรือดำน้ำ :: นก    : ?<hr>1) รถยนต์   <br>2) เครื่องบิน <br>3) ท้องฟ้า<br>4) ก้อนเมฆ <br>",
 answer:  "เครื่องบิน <br><br>สัตว์ : ยานพาหนะ<br>"},

{id:"25640101_RN3263_00_metaphor_Max_07", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>วัด : สงบ :: ห้างสรรพสินค้า    : ?<hr>1) เย็น   <br>2) พลุกพล่าน <br>3) มั่วสุม<br>4) บันเทิง <br>",
 answer:  "พลุกพล่าน <br><br>วัด มีบรรยากาศที่ สงบ<br>ห้างสรรพสินค้า มีบรรยากาศที่ พลุกพล่าน "},

{id:"25650508_RN1589_00_metaphor_SakChai_1", number:"<small>ข้อสอบเสมือนจริง กพ 2564 (สอบ 8  พ.ค. 65)</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้าวต้มมัด : ข้าวหลาม ::     : ?<hr>1) เชือก : กระบอก   <br>2) ไส้กรอก  :  กุนเชียง <br>3) ข้าวเกรียบปากหม้อ  :  ข้าวเหนียวดำ<br>4) ห่อหมก : เยื่อไผ่ <br>",
 answer:  "ไส้กรอก  :  กุนเชียง <br><br>ข้าวต้มมัด มีรูปร่างเหมือน ไส้กรอก คือ มีการห่อ และมีการมัด<br>ข้าวหลาม มีรูปเหมือน กุนเชียง คือ มีลักษณะยาว ๆ<br><br>หรือดูอีกอย่างคือ<br><br>วัตถุดิบที่ใช้เหมือนกัน<br>ข้าวต้มมัด-ข้าวหลาม ใช้ข้าวเหนียว<br>ไส้กรอก-กุนเชียง ใช้เนื้อสัตว์"},

{id:"25640101_RN3343_00_metaphor_Max_06", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ที่ดิน : ตารางวา ::     : ?<hr>1) ไม้บรรทัด : เซ็นติเมตร   <br>2) กิโลเมตรต่อชั่วโมง  :  ความเร็ว <br>3) ของเหลว  :  ซี.ซี. <br>4) ของแข็ง : ก๊าซ <br>",
 answer:  "ของเหลว  :  ซี.ซี. <br><br>ที่ดิน มีหน่วยวัดเป็น ตารางวา<br>ของเหลว  มีหน่วยวัดเป็น  ซี.ซี."},

{id:"25640101_RN7885_00_metaphor_Max_05", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ไฟ : ควัน ::     : ?<hr>1) ฝน : เมฆ   <br>2) เถ้า  :  ถ่าน <br>3) แสง  :  เงา <br>4) รูป : นาม <br>",
 answer:  "แสง  :  เงา <br><br>ไฟ ทำให้เกิด ควัน<br>แสง  ทำให้เกิด  เงา"},

{id:"25640101_RN6617_00_metaphor_Max_04", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>กระทะ : ล้าง ::     : ?<hr>1) แหวน : ขัด   <br>2) ซัก  :  กางเกง <br>3) ตะหลิว  :  ทัพพี <br>4) ช้อน : ส้อม <br>",
 answer:  "แหวน : ขัด <br><br>กระทะ ทำความสะอาดโดยการ ล้าง<br>แหวน ทำความสะอาดโดยการ ขัด"},

{id:"25640101_RN7656_00_metaphor_Max_03", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เศร้า : อารมณ์ :: แหวน : ?<hr>1) เครื่องประดับ    <br>2) เงิน   <br>3) ทอง   <br>4) นิ้ว<br>",
 answer:  "เครื่องประดับ  <br><br>เศร้า เป็น อารมณ์ อย่างหนึ่ง<br>แหวน เป็น เครื่องประดับ อย่างหนึ่ง"},

{id:"25640101_RN6496_00_metaphor_Max_02", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ยาว : สั้น :: ? : ?<hr>1) ดำ : ขาว    <br>2) เดือน : ปี   <br>3) แมว : เสือ   <br>4) งู : ปลาไหล<br>",
 answer:  "ดำ : ขาว  <br><br>ความหมายตรงกันข้าม<br>"},

{id:"25640101_RN6496_00_metaphor_Max_01", number:"<small>ข้อสอบเสมือนจริง กพ 2564</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>อิสรภาพ : นกพิราบ :: ? : ?<hr>1) เสือโคร่ง : กล้าหาญ    <br>2) น่ารัก : หมา   <br>3) ความรุ่งเรือง : มังกร   <br>4) น่ากลัว : ขนลุก<br>",
 answer:  "ความรุ่งเรือง : มังกร  <br><br>นกพิราบ เป็นสัญลักษณ์ของ อิสรภาพ<br>มังกร เป็นสัญลักษณ์ของ ความรุ่งเรือง<br><img style='display: block;  margin-left: auto;  margin-right: auto;  width:100%; max-width:400px;' src='images/dragon.png'><br>富贵兴隆 (Fùguì xīnglóng - ฮู้ก้วยชิงหลง) แปลว่า ความมั่งคั่งและความเจริญรุ่งเรือง"},

{id:"25650101_RN6496_00_metaphor_Note_6", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ประณาม : สรรเสริญ :: ? : ?<hr>1) ท้อแท้ : กล้าหาญ    <br>2) วิตก : กังวล   <br>3) อคติ : คุณธรรม   <br>4) เฉื่อย : กระตือรือร้น<br>",
 answer:  "เฉื่อย : กระตือรือร้น  <br><br>ความหมายตรงข้ามกัน<br>อคติ - มีอคติ แสดงว่าไม่เป็นกลาง<br>คำตรงข้าม ของ อคติ คือ ยุติธรรม"},

{id:"25650101_RN6496_00_metaphor_Note_5", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>สติ : สัมปชัญญะ :: ? : ?<hr>1) โศกเสศร้า : เสียใจ    <br>2) วิตก : วิจารณ์   <br>3) สมัคร : สมาน   <br>4) สนุก : สนาน<br>",
 answer:  "โศกเสศร้า : เสียใจ  <br><br>ความหมายเหมือนกัน หรือ ใกล้เคียงกัน<br>"},

{id:"25620101_RN649_00_metaphor_Note_4", number:"<small>ข้อสอบเสมือนจริง กพ 2562</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พัง : พลาย :: ? : ?<hr>1) กวาง : เนื้อสมัน    <br>2) ฤษี : โยคี   <br>3) แจ้ : โต้ง   <br>4) ภรรยา : สามี<br>",
 answer:  "ภรรยา : สามี  <br><br>เพศเมีย (หญิง)  : เพศผู้ (ชาย)<br>"},

{id:"25610101_RN1282_00_metaphor_Note_3", number:"<small>ข้อสอบเสมือนจริง กพ 2561</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พลังงาน : สันดาป :: ? : ?<hr>1) หนี้สิน : กู้ยืม    <br>2) ประติมากรรม : ภาพวาด   <br>3) รถยนต์ : รถจักรยาน   <br>4) เสียง : เดซิเบล<br>",
 answer:  "หนี้สิน : กู้ยืม   <br><br>พลังงาน เกิดจาก สันดาป<br>หนี้สิน เกิดจาก กู้ยืม"},

{id:"25650101_RN6718_00_metaphor_Note_2", number:"<small>ข้อสอบเสมือนจริง กพ 2565</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ธงชาติ : ผืน :: ? : ?<hr>1) ดวง : ตะเกียง    <br>2) รถไฟ : คัน   <br>3) ผ้าไตร: ผืน   <br>4) ขลุ่ย : เลา <br>",
 answer:  "ขลุ่ย : เลา   <br><br>ลักษณะนาม<br>รถไฟ - ขบวน<br>ผ้าไตร - ไตร"},

{id:"25610101_RN6767_00_metaphor_Note_1", number:"<small>ข้อสอบเสมือนจริง กพ 2561</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ช้อน : ส้อม :: ? : ?<hr>1) หนังสือ : บรรทัด    <br>2) โต๊ะ : เก้าอี้    <br>3) แก้วน้ำ : แจกัน   <br>4) มีด : ทัพพี  <br>",
 answer:  "โต๊ะ : เก้าอี้   <br><br>ของใช้ คู่กัน<br>"},

{id:"25660430_RN2242_00_metaphor_Note_6", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>รก : รังหนู :: ? : ?<hr>1) ใจเสาะ : ปลาสร้อย    <br>2) ดำ : มืด    <br>3) กว้าง : มหาสมุทร   <br>4) เบา : ปุยน่น  <br>",
 answer:  "เบา : ปุยน่น   <br><br>เป็นคำอุปมาอุปไมย<br>รก เป็น รังหนู<br>คำที่ถูก<br>ใจเสาะ เป็น ปลาซิว<br>ดำ เป็น ตอตะโก<br>ใจกว้าง เป็น มหาสมุทร<br>ดู เมนูความสามารถทั่วไป เรื่อง คำอุปมาอุปไมย ที่ควรรู้"},

{id:"25660430_RN4976_00_metaphor_Note_6", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พี่ : น้อง :: ? : ?<hr>1) พ่อ : แม่    <br>2) ฉัน : เธอ    <br>3) น้าสะใภ้ : อาเขย   <br>4) ลุง : ป้า  <br>",
 answer:  "ฉัน : เธอ  <br><br>เพศ อาจเป็นได้ทั้งชายและหญิง<br>พี่-น้อง อาจเป็นได้ทั้งชายและหญิง<br>ฉัน-เธอ อาจเป็นได้ทั้งชายและหญิง<br>"},

{id:"25660430_RN2943_00_metaphor_Note_5", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พี่ : น้อง :: ? : ?<hr>1) พ่อ : แม่    <br>2) แม่ : ฉัน    <br>3) น้าสะใภ้ : อาเขย   <br>4) ลุง : น้า  <br>",
 answer:  "ลุง : น้า  <br><br>อายุ มากกว่า  :  น้อยกว่า<br>พี่ อายุมากกว่า น้อง<br>ลุง อายุมากกว่า น้า<br>"},

{id:"25660430_RN7697_00_metaphor_Note_4", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เตียง : มุ้ง :: ? : ?<hr>1) หมอน : ผ้าปูที่นอน    <br>2) กระท่อม : แคร่    <br>3) ตู้ : กระจก   <br>4) บ้าน : ตึก  <br>",
 answer:  "บ้าน : ตึก <br><br>ลักษณะนาม เหมือนกัน<br>เตียง-มุ้ง -- หลัง<br>บ้าน-ตึก -- หลัง<br>"},

{id:"25660429_RN3023_00_metaphor_Note_3", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ยาบ้า : ยาเสพติด :: ? : ?<hr>1) พี่น้อง : ญาติ    <br>2) วาด : เขียน    <br>3) หนังสือ : คำนำ   <br>4) ย่อความ : เรียงความ  <br>",
 answer:  "พี่น้อง : ญาติ  <br><br>ยาบ้า จัดเป็น ยาเสพติด<br>พี่น้อง จัดเป็น (เครือ)ญาติ<br>"},

{id:"25660430_RN8837_00_metaphor_Note_2", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เหนือ : ใต้ :: ? : ?<hr>1) ภูเขา : ถ้ำ    <br>2) แม่น้ำ : ลำธาร    <br>3) กลางวัน : กลางคืน   <br>4) หิมาลัย : หิมพานต์   <br>",
 answer:  "กลางวัน : กลางคืน <br><br>เหนือ ตรงข้ามกับ ใต้<br>กลางวัน ตรงข้ามกับ กลางคืน<br>"},

{id:"25660404_RN5449_00_metaphor_Note_1", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ครู : นักเรียน :: ? : ?<hr>1) พระ : แม่ชี    <br>2) หมอ : คนไข้    <br>3) ดารา : นักร้อง   <br>4) ตำรวจ : อัยการ   <br>",
 answer:  "หมอ : คนไข้  <br><br>ครู ให้ความรู้ นักเรียน<br>หมด ให้การรักษา คนไข้<br>"},

];

var thaiConditioning_dat = [{id:"25660101_RN8889_00_law_Master_19", number:"<small>เงื่อนไขภาษา ๑ ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เมื่อส่วนราชการได้รับการติดต่อ สอบถามเป็นหนังสือจากประชาชน ให้เป็นหน้าที่ของส่วนราชการ จะต้องตอบคําถามให้ทราบ ภายในกี่วัน?<hr>1) 5 วัน   <br>2)  7  วัน   <br>3)  9   วัน  <br>4) 15 วัน   <br>",
 answer:  "4) 15 วัน   <br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี<br><br><br><br><p class='act-paragraph'>มาตรา ๓๘ เมื่อส่วนราชการใด ได้รับการติดต่อสอบถามเป็นหนังสือ จากประชาชนหรือจาก ส่วนราชการด้วยกัน เกี่ยวกับงานที่อยู่ในอำนาจหน้าที่ของส่วนราชการนั้น <strong>ให้เป็นหน้าที่ของส่วนราชการนั้น ที่จะต้องตอบคำถาม หรือแจ้งการดำเนินการ ให้ทราบภายในสิบห้าวัน</strong> หรือภายในกำหนดเวลาที่กำหนดไว้ ตามมาตรา ๓๗<br>"},

{id:"25660101_RN8889_00_law_Master_18", number:"<small>เงื่อนไขภาษา ๒ ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>การกระจายอำนาจให้แก่เจ้าหน้าที่ เพื่อให้การปฏิบัติราชการ เป็นไปอย่างรวดเร็ว ตรงกับหมวดใด ใน พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ?<hr>1) เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ    <br>2) มีประสิทธิภาพและเกิดความคุ้มค่าในเชิภารกิจของรัฐ    <br>3) ไม่มีขั้นตอนการปฏิบัติงานเกินความจำเป็น   <br>4) มีการประเมินผลการปฏิบัติราชการอย่างสม่ำเสมอ   <br>",
 answer:  "3) ไม่มีขั้นตอนการปฏิบัติงานเกินความจำเป็น<br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><div class='act-center-text'>หมวด ๕<br>การลดขั้นตอนการปฏิบัติงาน<br>--------------<br></div>มาตรา ๒๗ <p class='act-paragraph'>ให้ส่วนราชการจัดให้มีการกระจายอำนาจ การตัดสินใจเกี่ยวกับ การสั่ง การอนุญาต การอนุมัติ การปฏิบัติราชการ หรือการดำเนินการอื่นใด ของผู้ดำรงตำแหน่งใด ให้แก่ผู้ดำรงตำแหน่งที่มี หน้าที่รับผิดชอบ ในการดำเนินการในเรื่องนั้นโดยตรง เพื่อให้เกิดความรวดเร็ว และลดขั้นตอนการปฏิบัติราชการ ทั้งนี้ ในการกระจายอำนาจการตัดสินใจดังกล่าว ต้องมุ่งผล ให้เกิดความสะดวก และรวดเร็ว ในการบริการประชาชน<p class='act-paragraph'>เมื่อได้มีการกระจายอำนาจ การตัดสินใจตามวรรคหนึ่งแล้ว ให้ส่วนราชการกำหนดหลักเกณฑ์ การควบคุม ติดตาม และกำกับดูแลการใช้อำนาจ และความรับผิดชอบ ของผู้รับมอบอำนาจและผู้มอบอำนาจไว้ด้วย หลักเกณฑ์ดังกล่าว ต้องไม่สร้างขั้นตอน หรือการกลั่นกรองงาน ที่ไม่จำเป็นในการปฏิบัติงาน ของข้าราชการ ในการนี้ หากสามารถใช้เทคโนโลยีสารสนเทศ หรือโทรคมนาคม แล้วจะเป็นการลดขั้นตอน เพิ่มประสิทธิภาพ และประหยัดค่าใช้จ่าย รวมทั้งไม่เกิดผลเสียหายแก่ราชการ ให้ส่วนราชการดำเนินการ ให้ข้าราชการ ใช้เทคโนโลยีสารสนเทศ หรือโทรคมนาคม ตามความเหมาะสมและกำลังเงินงบประมาณ<p class='act-paragraph'>เมื่อส่วนราชการใดได้มีการกระจายอำนาจการจัดสินใจตามวรรคหนึ่ง หรือได้มีการใช้เทคโนโลยี สารสนเทศหรือโทรคมนาคมตามวรรคสองแล้ว ให้ส่วนราชการนั้น เผยแพร่ให้ประชาชนทราบ เป็นการทั่วไป <br>"},

{id:"25660101_RN6038_00_law_Master_17", number:"<small>เงื่อนไขภาษา ๓ ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ในกรณีที่เกิดปัญาหรืออุปสรรค ที่เกิดขึ้นจากการดำเนินงาน ให้ส่วนราชการดำเนินการตามข้อใด?<hr>1) ดำเนินการแก้ไขปัญหาและอุปสรรคนั้นโดยเร็ว    <br>2) แจ้งให้ส่วนราการที่เกี่ยวข้องทราบ เพื่อดำเนินการแก้ไข ปรับปรุงโดยเร็วต่อไป    <br>3) แจ้งให้ ก.พ.ร. ทราบ   <br>4)  ถูกทั้ง ข้อ 1 และ ข้อ 2  <br>",
 answer:  "1) ดำเนินการแก้ไขปัญหาและอุปสรรคนั้นโดยเร็ว<br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br>มาตรา ๘ ในการบริหารราชการเพื่อประโยชน์สุขของประชาชน ส่วนราชการจะต้องดำเนินการ โดยถือว่าประชาชนเป็นศูนย์กลางที่จะได้รับการบริการจากรัฐ และจะต้องมีแนวทางการบริหารราชการ ดังต่อไปนี้ <p class='act-paragraph'>(๑) การกำหนดภารกิจของรัฐ และส่วนราชการต้องเป็นไปเพื่อวัตถุประสงค์ตามมาตรา ๗ และสอดคล้องกับแนวนโยบายแห่งรัฐ และนโยบายของคณะรัฐมนตรี ที่แถลงต่อรัฐสภา<p class='act-paragraph'>(๒) การปฏิบัติภารกิจของส่วนราชการ ต้องเป็นไปโดยซื่อสัตย์สุจริต สามารถตรวจสอบได้ และมุ่งให้เกิดประโยชน์สุขแก่ประชาชนทั้งในระด้บประเทศ และท้องถิ่น<p class='act-paragraph'>(๓) ก่อนเริ่มดำเนินการ ส่วนราชการต้องจัดให้มีการศึกษา วิเคราะห์ผลดีและผลเสียให้ครบถ้วน ทุกด้าน กำหนดขั้นตอนการดำเนินการที่โปร่งใส มีกลไกตรวจสอบการดำเนินการ ในแต่ละขั้นตอน ในกรณีที่ภารกิจใดจะมีผลกระทบต่อประชาชน ส่วนราชการต้องดำเนินการรับฟังความคิดเห็นของ ประชาชน หรือชี้แจงทำความเข้าใจ เพื่อให้ประชาชนได้ตระหนักถึงประโยชน์ ที่ส่วนรวมจะได้รับจากภารกิจนั้น<p class='act-paragraph'>(๔) ให้เป็นหน้าที่ของข้าราชการ ที่จะต้องคอยรับฟังความคิดเห็น และความพึงพอใจของสังคม โดยรวม และประชาชนผู้รับบริการ เพื่อปรับปรุง หรือเสนอแนะต่อผู้บังคับบัญชา เพื่อให้มีการปรับปรุง วิธีปฏิบัติราชการให้เหมาะสม<p class='act-paragraph'>(๕) <strong>ในกรณีที่เกิดปัญหาและอุปสรรค จากการดำเนินการ ให้ส่วนราชการดำเนินการแก้ไข ปัญหาและอุปสรรคนั้นโดยเร็ว</strong> ในกรณีที่ปัญหาหรืออุปสรรคนั้น เกิดขึ้นจากส่วนราชการอื่น หรือระเบียบ ข้อบังคับที่ออกโดยส่วนราชการอื่น ให้ส่วนราชการ แจ้งให้ส่วนราชการที่เกี่ยวข้องทราบ เพื่อดำเนินการแก้ไข ปรับปรุงโดยเร็วต่อไป และให้แจ้ง ก.พ.ร. ทราบด้วย"},

{id:"25660101_RN5190_00_law_Master_16", number:"<small>เงื่อนไขภาษา ๔ ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใด<u>ไม่ใช่</u>เป้าหมายการบริหารราชการ ตาม พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี?<hr>1) เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ    <br>2) ไม่มีขั้นตอนการปฏิบัติงานกินความจำเป็น    <br>3) มีประสิทธิภาพ และประหยัดงบประมาณของรัฐ   <br>4) มีการประเมินผลปฏิบัติราชการอย่างสม่ำเสมอ   <br>",
 answer:  "3) มีประสิทธิภาพ และประหยัดงบประมาณของรัฐ <br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><p class='act-paragraph'>มาตรา ๖ การบริหารกิจการบ้านเมืองที่ดี ได้แก่ การบริหารราชการเพื่อบรรลุเป้าหมาย ดังต่อไปนี้<p class='act-paragraph'>(๑) เกิดประโยชน์สุขของประชาชน<p class='act-paragraph'>(๒) เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ<p class='act-paragraph'>(๓) มีประสิทธิภาพ และเกิดความคุ้มค่า ในเชิงภารกิจของรัฐ<p class='act-paragraph'>(๔) ไม่มีขั้นตอนการปฏิบัติงานเกินความจำเป็น<p class='act-paragraph'>(๕) มีการปรับปรุงภารกิจของส่วนราชการ ให้ทันต่อสถานการณ์ <p class='act-paragraph'>(๖) ประชาชนได้รับการอำนวยความสะดวก และได้รับการตอบสนองความต้องการ<p class='act-paragraph'>(๗) มีการประเมินผลการปฏิบัติราชการ อย่างสม่ำเสมอ<br>"},

{id:"25660101_RN7862_00_law_Master_15", number:"<small>เงื่อนไขภาษา ๕ ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>การเปลี่ยนชื่อกระทรวง ต้องตราเป็นกฎหมายใด?<hr>1) พระราชบัญญัติ   <br>2) พระราชกำหนด<br>3)  พระราชกฤษฎีกา <br>4) กฎกระทรวง  <br>",
 answer:  "3)  พระราชกฤษฎีกา<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๗ ให้จัดระเบียบบริหารราชการส่วนกลาง ดังนี้ </p><p class='act-paragraph'>(๑) สำนักนายกรัฐมนตรี </p><p class='act-paragraph'>(๒) กระทรวง หรือทบวงซึ่งมีฐานะเทียบเท่ากระทรวง </p><p class='act-paragraph'>(๓) ทบวง ซึ่งสังกัดสำนักนายกรัฐมนตรีหรือกระทรวง</p><p class='act-paragraph'>(๔) กรม หรือส่วนราชการที่เรียกชื่ออย่างอื่นและมีฐานะเป็นกรม ซึ่งสังกัดหรือไม่สังกัดสำนัก นายกรัฐมนตรี กระทรวงหรือทบวง</p><p class='act-paragraph'>สำนักนายกรัฐมนตรีมีฐานะเป็นกระทรวง</p><p class='act-paragraph'>ส่วนราชการตาม (๑) (๒) (๓) และ (๔) มีฐานะเป็นนิติบุคคล</p><br>...<p class='act-paragraph'>มาตรา ๘ ตรี <strong>การเปลี่ยนชื่อส่วนราชการ ตามมาตรา ๗ ให้ตราเป็นพระราชกฤษฎีกา</strong> และในกรณีที่ชื่อ ตำแหน่งของข้าราชการในส่วนราชการนั้นเปลี่ยนไป ให้ระบุการเปลี่ยนชื่อไว้ในพระราชกฤษฎีกาด้วย</p>"},

{id:"25660101_RN7862_00_law_Master_12", number:"<small>เงื่อนไขภาษา ๖ ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>สภากลาโหม จัดทำประมวลจริยธรรม สำหรับข้อใด?<hr>1) ข้าราชการการเมือง<br>2) ข้าราชการทหาร    <br>3) ข้าราชการพลเรือนกลาโหม   <br>4) ข้อ 2 และ ข้อ 3   <br>",
 answer:  "4) ข้อ 2 และ ข้อ 3 <br><br>พ.ร.บ.มาตรฐานทางจริยธรรม<br><br><p>มาตรา ๖ ให้องค์กรกลางบริหารงานบุคคลของหน่วยงานของรัฐมีหน้าที่จัดทำประมวลจริยธรรมสำหรับเจ้าหน้าที่ของรัฐที่อยู่ในความรับผิดชอบ<p>ในกรณีที่เป็นเจ้าหน้าที่ของรัฐซึ่งไม่มีองค์กรกลางบริหารงานบุคคลที่รับผิดชอบ ให้องค์กรต่อไปนี้เป็นผู้จัดทำประมวลจริยธรรม<p>(๑) คณะรัฐมนตรี สำหรับข้าราชการการเมือง<p>(๒) สภากลาโหม สำหรับข้าราชการทหารและข้าราชการพลเรือนกลาโหม<p>(๓) สำนักงานคณะกรรมการนโยบายรัฐวิสาหกิจ สำหรับผู้บริหารและพนักงานรัฐวิสาหกิจ<p>(๔) คณะกรรมการพัฒนาและส่งเสริมองค์การมหาชน สำหรับผู้บริหาร เจ้าหน้าที่ และผู้ปฏิบัติงานขององค์การมหาชน<p>ในกรณีที่มีปัญหาว่าองค์กรใดเป็นผู้จัดทำประมวลจริยธรรมสำหรับเจ้าหน้าที่ของรัฐประเภทใดให้ ก.ม.จ. เป็นผู้มีอำนาจวินิจฉัย<p>ทั้งนี้ หน่วยงานของรัฐอาจจัดทำข้อกำหนดจริยธรรมเพื่อใช้บังคับกับเจ้าหน้าที่ของรัฐในหน่วยงานนั้นเพิ่มเติมจากประมวลจริยธรรมให้เหมาะสมแก่ภารกิจที่มีลักษณะเฉพาะของหน่วยงานของรัฐนั้นด้วยก็ได้ <p>การจัดทำประมวลจริยธรรมและข้อกำหนดจริยธรรมของหน่วยงานของรัฐต้องเป็นไปตามหลักเกณฑ์ที่ ก.ม.จ. กำหนดตามมาตรา ๑๔ ด้วย"},

{id:"25660101_RN5176_00_law_Master_11", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใด <u>ไม่ใช่</u>การกระทำละเมิดในขณะปฏิบัติหน้าที่?<hr>1) นายอำเภอขับรถราชการออกตรวจราชการในพื้นที่ ขณะขับรถเกิดอุบัติเหตุ ทำให้ประชาชนได้รับความเสียหาย    <br>2) เจ้าหน้าที่พัสดุ ออกจากห้องพัสดุและลืมปิดกุญแจห้องพัสดุ ทำให้พัสดุบางส่วนถูกขโมยไป    <br>3) หัวหน้าราชการไม่ดูแลผู้ใต้บังคับบัญชาให้อยู่ในระเบียบ ทำให้ผู้อยู่ใต้บังคับบัญชาทำการยักยอกทรัพย์ของหน่วยงาน ทำให้หน่วยงานเสียหาย   <br>4) ตำรวจตั้งด่านตรวจ ระหว่างการตรวจได้เกิดปากเสียงกับคนขับรถรายหนึ่ง และเกิดบันดาลโทษะทำรายคนขับรถได้รับบาดเจ็บ   <br>",
 answer:  "4) ตำรวจตั้งด่านตรวจ ระหว่างการตรวจได้เกิดปากเสียงกับคนขับรถ ซึ่งกระทำผิดกฎจราจรรายหนึ่ง และเกิดบันดาลโทสะทำรายคนขับรถได้รับบาดเจ็บ<br><br>กรณีเจ้าหน้าที่ตำรวจตั้งด่านตรวจผู้กระทำผิดกฎจราจร ระหว่างการปฏิบัติหน้าที่ เจ้าหน้าที่ตำรวจเกิดบันดาลโทสะ ทำร้ายร่างกายผู้ถูกกล่าวหาว่ากระทำผิดกฎจราจร ดังนี้ แม้การกระทำละเมิดจะเกิดขึ้นระหว่างการปฏิบัติหน้าที่ แต่ก็มิได้เป็นไปเพื่อประโยชน์ของทางราชการ หากแต่เป็นไปเพื่อบรรลุวัตถุประสงค์ส่วนตัวของเจ้าหน้าที่ผู้นั้น อีกทั้งเจ้าหน้าที่ตำรวจ ก็ไม่มีหน้าที่ในการทำร้ายร่างกายประชาชน จึงถือไม่ได้ว่าการกระทำละเมิดดังกล่าวเป็นการกระทำละเมิดในการปฏิบัติหน้าที่ <br><br>พ.ร.บ.ความรับผิดทางละเมิดของเจ้าหน้าที่ <br><br><strong>การกระทำละเมิดในการปฏิบัติหน้าที่ </strong><br>การพิจารณาว่าการกระทำใดจะเป็นการกระทำละเมิดในการปฏิบัติหน้าที่ของเจ้าหน้าที่ สามารถแยกพิจารณาได้ดังนี้ คือ (ก) มีการกระทำละเมิดเกิดขึ้น  และ (ข) การละเมิดนั้นกระทำโดยเจ้าหน้าที่ในการปฏิบัติหน้าที่ <br>&nbsp;&nbsp;<strong>ก. การกระทำละเมิด</strong><br>การกระทำละเมิดในพระราชบัญญัติความรับผิดทางละเมิดของเจ้าหน้าที่ พ.ศ. ๒๕๓๙ เป็นไปตามมาตรา ๔๒๐ แห่งประมวลกฎหมายแพ่งและพาณิชย์ซึ่งบัญญัติว่า<br>&quot;ผู้ใดจงใจหรือประมาทเลินเล่อทำต่อบุคคลอื่น โดยผิดกฎหมายให้เขาเสียหายถึงแก่ชีวิตก็ดีแก่ร่างกายก็ดี อนามัยก็ดี เสรีภาพก็ดี ทรัพย์สินหรือสิทธิอย่างหนึ่งอย่างใดก็ดี ท่านว่าผู้นั้นทำละเมิดจำต้องใช้ค่าสินไหมทดแทนเพื่อการนั้น&quot;<br>ซึ่งแยกองค์ประกอบได้ดังนี้<br><ol><li>มีการกระทำ หมายถึง การเคลื่อนไหวร่างกายโดยรู้สำนึกในการเคลื่อนไหวนั้น และอยู่ในบังคับของจิตใจผู้กระทำ  และรวมถึงการงดเว้นการกระทำที่ตนมีหน้าที่ตามกฎหมายที่ต้องกระทำ และการงดเว้นนั้นเป็นเหตุให้เกิดความเสียหายขึ้น       <li>โดยจงใจหรือประมาทเลินเล่อ       <ul><li><em>โดยจงใจ </em>หมายถึง รู้สำนึกถึงผลหรือความเสียหายจากการกระทำของตน       <li><em>โดยประมาทเลินเล่อ</em> หมายถึง เป็นการกระทำโดยปราศจากความระมัดระวัง ซึ่งบุคคลในภาวะเช่นนั้น จำต้องมีโดยต้องเปรียบเทียบกับบุคคลที่ต้องมีความระมัดระวังตามพติการณ์ และตามฐานะในสังคมเช่นเดียวกับผู้กระทำความเสียหาย</ul>       <li>โดยผิดกฎหมาย เป็นการกระทำโดยไม่มีอำนาจหรือไม่มีสิทธิหรือโดยมิชอบด้วยกฎหมาย (unlawful) และรวมความถึงการใช้อำนาจที่มีอยู่เกินส่วนหรือใช้อำนาจตามกฎหมายเพื่อกลั่นแกล้งผู้อื่น       <li>เกิดความเสียหายแก่บุคคลอื่น<br>       <ul><li>ความเสียหายนั้นจะเป็นความเสียหายที่เกิดแก่ชีวิต ร่างกาย อนามัยเสรีภาพ ทรัพย์สิน หรือสิทธิอย่างหนึ่งอย่างใดก็ได้ แต่ต้องเป็นความเสียหายที่แน่นอนไม่ว่าจะเกิดขึ้นแล้วในปัจจุบันหรือจะเกิดขึ้นในอนาคตก็จะต้องเป็นความเสียหายที่จะเกิดขึ้นอย่างแน่นอน       <li>ความเสียหายจะต้องเกิดจากผลโดยตรงของผู้กระทำด้วย	   </ul></ol>&nbsp;&nbsp;<strong>ข. โดยเจ้าหน้าที่ในการปฏิบัติหน้าที่ </strong><br>       การกระทำละเมิดตามพระราชบัญญัติความรับผิดทางละเมิดของเจ้าหน้าที่ พ.ศ. ๒๕๓๙  ต้องเป็นการกระทำของเจ้าหน้าที่ในการปฏิบัติหน้าที่ <font color='green'><em>ซึ่งการพิจารณาว่าเป็นการกระทำในการปฏิบัติหน้าที่หรือไม่ มีองค์ประกอบ ๒ ประการ</em></font> ดังนี้<ol>       <li>กระทำการในฐานะเจ้าหน้าที่  มาตรา ๔ วรรคสอง แห่งพระราชบัญญัติความรับผิดทางละเมิดของเจ้าหน้าที่ พ.ศ. ๒๕๓๙ นิยาม &quot;เจ้าหน้าที่&quot; หมายความว่าข้าราชการ พนักงาน ลูกจ้าง หรือผู้ปฏิบัติงานประเภทอื่น ไม่ว่าจะเป็นการแต่งตั้งในฐานะเป็นกรรมการหรือ ฐานะอื่นใด ซึ่งมีความหมายโดยสรุปว่า บุคคลทุกประเภทที่ทำงานให้กับหน่วยงานของรัฐไม่ว่าจะเป็นลูกจ้างประจำ ลูกจ้างชั่วคราว กรรมการ หรือบุคคลที่กฎหมายกำหนดให้เป็นเจ้าหน้าที่ เช่น บุคคลที่ต้องช่วยเหลือเจ้าหน้าที่ตามกฎหมายต่าง ๆ  เป็นต้น เป็นเจ้าหน้าที่ตามบทบัญญัตินี้ และเจ้าหน้าที่นี้ได้กระทำการตามที่กฎหมายให้อำนาจไว้ นอกจากจะมีอำนาจหน้าที่ตามกฎหมายแล้ว การกระทำในทางธุรการ ทั่วไป อาจจะไม่มีกฎหมายกำหนดให้อำนาจไว้เป็นการชัดเจน แต่หน้าที่ดังกล่าวก็อาจเกิดจากระเบียบหรือข้อบังคับหรือคำสั่งของผู้บังคับบัญชาที่ชอบด้วยกฎหมายก็ได้<br>       การกระทำหรือละเว้นการกระทำในหน้าที่ดังกล่าวมาข้างต้นหากเกิดความเสียหายก็เป็นการกระทำละเมิดในการปฏิบัติหน้าที่ เช่น <br>	   <font color='green'><ul><li><em>นายอำเภอขับรถราชการเพื่อไปปฏิบัติหน้าที่ระหว่างทางเกิดอุบัติเหตุทำให้บุคคลอื่นได้รับความเสียหาย </em></li> <li><em>เป็นเจ้าหน้าที่มีหน้าที่ดูแลรับผิดชอบทรัพย์สินของทางราชการปล่อยปละละเลยไม่ดูแลรักษาให้ดี เป็นเหตุให้ทรัพย์สินดังกล่าวสูญหายหรือเสียหาย</em></li>	   <li><em>ผู้บังคับบัญชามีหน้าที่ดูแลให้ผู้ใต้บังคับบัญชาปฏิบัติตามระเบียบแบบแผน ของทางราชการ ละเว้นการปฏิบัติหน้าที่ไม่ดูแลให้ผู้ใต้บังคับบัญชาปฏิบัติหน้าที่ ตามระเบียบเป็นเหตุให้ผู้ใต้บังคับบัญชาทุจริตยักยอกเงินของหน่วยงาน</em> </li>	   </ul></font>	   	   พฤติกรรมเหล่านี้เป็นการกระทำละเมิดในการปฏิบัติหน้าที่       <li>เจ้าหน้าที่นั้นเป็นเจ้าหน้าที่ของหน่วยงานของรัฐ  นอกจากผู้กระทำละเมิดจะต้องอยู่ในฐานะเจ้าหน้าที่แล้วผู้นั้นจำต้องเป็นเจ้าหน้าที่ของหน่วยงานของรัฐตามที่ มาตรา ๔ วรรคสาม ให้ความหมายไว้ว่า <br>&quot;หน่วยงานของรัฐ&quot; หมายความว่า กระทรวง ทบวง กรม หรือส่วนราชการที่เรียกชื่ออย่างอื่นและมีฐานะเป็นกรม ราชการส่วนภูมิภาค ราชการ ส่วนท้องถิ่น และรัฐวิสาหกิจที่ตั้งขึ้นโดยพระราชบัญญัติหรือพระราชกฤษฎีกา และให้หมายรวมถึงหน่วยงานอื่นของรัฐที่มีพระราชกฤษฎีกากำหนดให้เป็นหน่วยงานของรัฐตามพระราชบัญญัตินี้ด้วย</ol>ที่มา สำนักงานคณะกรรมการกฤษฎีกา<br>https://www.krisdika.go.th/data/lawmistake/conlawmis.htm<br>"},

{id:"25660101_RN5906_00_law_Master_10", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>การอุทธรณ์คำสั่งทางปกครองในกรณีที่คำสั่งทางปกครองใดไม่ได้ออกโดยรัฐมนตรี และไม่มีกฎหมายกำหนดขั้นตอนการอุทธรณ์ ภายในฝ่ายปกครองไว้เป็นการเฉพาะ ให้คู่กรณีอุทธรณ์คำสั่งทางปกครองนั้น โดยยื่นต่อใคร?<hr>1) เจ้าหน้าที่ผู้ทำคำสั่งทางปกครอง    <br>2) ผู้ที่ได้รับมอบหมายในการบังคับทางปกครอง    <br>3) ผู้มีอำนาจพิจารณาคำอุทธรณ์   <br>4) ศาลปกครอง   <br>",
 answer:  "1) เจ้าหน้าที่ผู้ทำคำสั่งทางปกครอง <br><br>พ.ร.บ.วิธีปฏิบัติราชการทางปกครอง<br><br><p class='act-paragraph'>มาตรา ๔๔ ภายใต้บังคับมาตรา ๔๘ ในกรณีที่คำสั่งทางปกครองใด ไม่ได้ออกโดยรัฐมนตรี และไม่มีกฎหมาย กำหนดขั้นตอนอุทธรณ์ ภายในฝ่ายปกครอง ไว้เป็นการเฉพาะ ให้คู่กรณีอุทธรณ์ คำสั่งทางปกครองนั้น <strong>โดยยื่นต่อเจ้าหน้าที่ ผู้ทำคำสั่งทางปกครอง</strong>ภายในสิบห้าวัน นับแต่วันที่ตนได้รับแจ้งคำสั่งดังกล่าว"},

{id:"25660101_RN7457_00_law_Master_09", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เจ้าหน้าที่ในข้อใด ทำการพิจารณาทางปกครองได้?<hr>1) เคยเป็นผู้แทนโดยชอบธรรมของคู่กรณี    <br>2) เคยเป็นบุตรบุญธรรมของคู่กรณี   <br>3) เคยเป็นผู้พักอาศัยอยู่ร่วมกับคู่กรณีในสถานที่เดียวกัน ในลักษณะครัวเรือนเดียวกัน   <br>4) เคยเป็นผู้ซึ่งอยู่กินกับคู่กรณีที่เป็นบุคคลเพศเดียวกันโดยกําเนิดในลักษณะ เดียวกัน กับชายหญิงที่อยู่กินกันฉันสามีภริยา   <br>",
 answer:  "3) เคยเป็นผู้พักอาศัยอยู่ร่วมกับคู่กรณีในสถานที่เดียวกัน ในลักษณะครัวเรือนเดียวกัน<br><br>พ.ร.บ.วิธีปฏิบัติราชการทางปกครอง<br><br><p class='act-paragraph'>มาตรา ๑๓ เจ้าหน้าที่ดังต่อไปนี้ จะทำการพิจารณาทางปกครองไม่ได้ <p class='act-paragraph'>(๑) เป็นคู่กรณีเอง<p class='act-paragraph'>(๒) เป็นคู่หมั้นหรือคู่สมรสของคู่กรณี <div style = 'border-radius: 15px; border: 2px solid #73AD21; padding: 5px;margin: 10px'><p class='act-paragraph'>เพิ่มเติม โดยกฎกระทรวง พ.ศ. ๒๕๖๖<p class='act-paragraph'>(๑) เคยเป็นคู่หมั้นหรือคู่สมรสของคู่กรณี <p class='act-paragraph'>(๒) เป็นหรือเคยเป็นผู้ซึ่งอยู่กินกันฉันสามีภริยา โดยมิได้จดทะเบียนสมรสกับคู่กรณี <p class='act-paragraph'>(๓) <strong>เป็นหรือเคยเป็นผู้ซึ่งอยู่กินกับคู่กรณีที่เป็นบุคคลเพศเดียวกันโดยกําเนิดในลักษณะ เดียวกัน กับชายหญิงที่อยู่กินกันฉันสามีภริยา</strong> </div><p class='act-paragraph'>(๓) เป็นญาติของคู่กรณี คือ เป็นบุพการีหรือผู้สืบสันดานไม่ว่าชั้นใด ๆ หรือเป็นพี่น้อง หรือลูกพี่ลูกน้องนับได้เพียงภายในสามชั้น หรือเป็นญาติเกี่ยวพันทางแต่งงานนับได้เพียงสองชั้น<p class='act-paragraph'>(๔) เป็นหรือ<strong>เคยเป็นผู้แทนโดยชอบธรรม</strong> หรือผู้พิทักษ์ หรือผู้แทน หรือตัวแทนของคู่กรณี <div style = 'border-radius: 15px; border: 2px solid #73AD21; padding: 5px;margin: 10px'><p class='act-paragraph'>เพิ่มเติม โดยกฎกระทรวง พ.ศ. ๒๕๖๖<p class='act-paragraph'>(๔) เป็นบุพการีหรือผู้สืบสันดานในความเป็นจริง ไม่ว่าชั้นใด ๆ หรือเป็นพี่น้อง หรือลูกพี่ลูกน้องในความเป็นจริง นับได้เพียงภายในสามชั้นของคู่กรณี <p class='act-paragraph'>(๕) เป็นหรือ<strong>เคยเป็นบุตรบุญธรรมของคู่กรณี </strong>หรือเป็น หรือเคยเป็น ผู้รับคู่กรณีเป็นบุตรบุญธรรม  <p class='act-paragraph'>(๖) เป็นลุง ป้า น้า อา ของคู่กรณี <p class='act-paragraph'>(๗) <strong>เป็นผู้พักอาศัยอยู่ร่วมกับคู่กรณีในสถานที่เดียวกัน ในลักษณะครัวเรือนเดียวกัน</strong> (ถ้าเคยอยู่บ้านเดียวกัน ไม่อยู่ในเงื่อนไขนี้)</div><p class='act-paragraph'>(๕) เป็นเจ้าหนี้ หรือลูกหนี้ หรือเป็นนายจ้างของคู่กรณี<div style = 'border-radius: 15px; border: 2px solid #73AD21; padding: 5px;margin: 10px'><p class='act-paragraph'>เพิ่มเติม โดยกฎกระทรวง พ.ศ. ๒๕๖๖<p class='act-paragraph'>(๘) เป็นลูกจ้างหรือที่ปรึกษาซึ่งได้รับค่าตอบแทนของคู่กรณี </div><p class='act-paragraph'>(๖) กรณีอื่น ตามที่กำหนดในกฎกระทรวง"},

{id:"25660101_RN8450_00_law_Master_08", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ในกรณีที่ภารกิจใด มีความเกี่ยวข้องกับหลายส่วนราชการ หรือเป็นภารกิจที่ใกล้เคียงหรือต่อเนื่องกัน ให้ส่วนราการที่เกี่ยวข้องนั้น กำหนดแนวทางการปฏิบัติราชการ เพื่อให้เกิดการบริหารตามข้อใด เพื่อมุ่งให้เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ?<hr>1) การบริหารราชการเพื่อประโยชน์สุขของประชาชน    <br>2) การบริหารราชการแบบบูรณาการร่วมกัน    <br>3) การประชุมแบบบูรณาการร่วมกัน   <br>4) การจัดทำแผนบูรณาการร่วมกัน   <br>",
 answer:  "2) การบริหารราชการแบบบูรณาการร่วมกัน <br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><p class='act-paragraph'>มาตรา ๑๐ ในกรณีที่ภารกิจใด มีความเกี่ยวข้องกับหลายส่วนราชการ หรือเป็นภารกิจที่ใกล้เคียง หรือต่อเนื่องกัน ให้ส่วนราชการที่เกี่ยวข้องนั้น กำหนดแนวทางการปฏิบัติราชการ เพื่อให้เกิดการบริหารราชการแบบบูรณาการร่วมกัน โดยมุ่งให้เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ<br>"},

{id:"25660101_RN6825_00_law_Master_07", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ในกรณีที่เกิดปัญหาหรืออุปสรรคจากส่วนราชการอื่น หรือระเบียบข้อบังคับที่ออกโดยส่วนราชการอื่น ให้ส่วนราชการดำเนินการตามข้อใด?<hr>1) ให้ดำเนินการแก้ไขปัญหาและอุปสรรคนั้น โดยเร็ว    <br>2) แจ้งให้ส่วนราชการที่เกี่ยวข้องทราบ เพื่อดำเนินการแก้ไขปรับปรุงโดยเร็วต่อไป    <br>3) แจ้งให้ ก.พ.ร. ทราบ   <br>4) ดำเนินการตาม ข้อ 2 และ ข้อ 3   <br>",
 answer:  "4) ดำเนินการตาม ข้อ 2 และ ข้อ 3  <br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><p class='act-paragraph'>มาตรา ๘ ในการบริหารราชการเพื่อประโยชน์สุขของประชาชน ส่วนราชการจะต้องดำเนินการ โดยถือว่าประชาชนเป็นศูนย์กลางที่จะได้รับการบริการจากรัฐ และจะต้องมีแนวทางการบริหารราชการ ดังต่อไปนี้ <p class='act-paragraph'>(๑) การกำหนดภารกิจของรัฐ และส่วนราชการต้องเป็นไปเพื่อวัตถุประสงค์ตามมาตรา ๗ และสอดคล้องกับแนวนโยบายแห่งรัฐ และนโยบายของคณะรัฐมนตรี ที่แถลงต่อรัฐสภา<p class='act-paragraph'>(๒) การปฏิบัติภารกิจของส่วนราชการ ต้องเป็นไปโดยซื่อสัตย์สุจริต สามารถตรวจสอบได้ และมุ่งให้เกิดประโยชน์สุขแก่ประชาชนทั้งในระด้บประเทศ และท้องถิ่น<p class='act-paragraph'>(๓) ก่อนเริ่มดำเนินการ ส่วนราชการต้องจัดให้มีการศึกษา วิเคราะห์ผลดีและผลเสียให้ครบถ้วน ทุกด้าน กำหนดขั้นตอนการดำเนินการที่โปร่งใส มีกลไกตรวจสอบการดำเนินการ ในแต่ละขั้นตอน ในกรณีที่ภารกิจใดจะมีผลกระทบต่อประชาชน ส่วนราชการต้องดำเนินการรับฟังความคิดเห็นของ ประชาชน หรือชี้แจงทำความเข้าใจ เพื่อให้ประชาชนได้ตระหนักถึงประโยชน์ ที่ส่วนรวมจะได้รับจากภารกิจนั้น<p class='act-paragraph'>(๔) ให้เป็นหน้าที่ของข้าราชการ ที่จะต้องคอยรับฟังความคิดเห็น และความพึงพอใจของสังคม โดยรวม และประชาชนผู้รับบริการ เพื่อปรับปรุง หรือเสนอแนะต่อผู้บังคับบัญชา เพื่อให้มีการปรับปรุง วิธีปฏิบัติราชการให้เหมาะสม<p class='act-paragraph'>(๕) ในกรณีที่เกิดปัญหาและอุปสรรค จากการดำเนินการ ให้ส่วนราชการดำเนินการแก้ไข ปัญหาและอุปสรรคนั้นโดยเร็ว <strong>ในกรณีที่ปัญหาหรืออุปสรรคนั้น เกิดขึ้นจากส่วนราชการอื่น หรือระเบียบ ข้อบังคับที่ออกโดยส่วนราชการอื่น ให้ส่วนราชการ แจ้งให้ส่วนราชการที่เกี่ยวข้องทราบ เพื่อดำเนินการแก้ไข ปรับปรุงโดยเร็วต่อไป และให้แจ้ง ก.พ.ร. ทราบด้วย</strong><p class='act-paragraph'>การดำเนินการตามวรรคหนึ่ง ให้ส่วนราชการ กำหนดวิธีปฏิบัติให้เหมาะสมกับภารกิจแต่ละเรื่อง ทั้งนี้ ก.พ.ร. จะกำหนดแนวทางการดำเนินการทั่วไป ให้ส่วนราชการปฏิบัติ ให้เป็นไปตามมาตรานี้ด้วย ก็ได้<br><br>"},

{id:"25660101_RN7040_00_law_Master_05", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ให้ส่วนราชการคำนวณรายจ่ายต่อหน่วยของงานบริการสาธารณะที่อยู่ในความรับผิดชอบ แล้วรายงานให้ให้หน่วยงานใดทราบ?<hr>1) สำนักงบประมาณ    <br>2) กรมบัญชีกลาง    <br>3) ก.พ.ร.   <br>4) ถูกทุกข้อ   <br>",
 answer:  "1) กระทรวงมหาดไทย<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๒๑ ให้ส่วนราชการจัดทำบัญชีต้นทุน ในงานบริการสาธารณะแต่ละประเภทขึ้น ตามหลักเกณฑ์ และวิธีการที่กรมบัญชีกลางกำหนด<p class='act-paragraph'>ให้ส่วนราชการ<strong>คำนวณรายจ่ายต่อหน่วย ของงานบริการสาธารณะ</strong> ที่อยู่ในความรับผิดชอบของ ส่วนราชการนั้น ตามระยะเวลาที่กรมบัญชีกลางกำหนด <strong>และรายงานให้สำนักงบประมาณ กรมบัญชีกลาง และ ก.พ.ร. ทราบ</strong><p class='act-paragraph'>ในกรณีที่รายจ่ายต่อหน่วย ของงานบริการสาธารณะใด ของส่วนราชการใดสูงกว่ารายจ่ายต่อหน่วย ของงานบริการสาธารณะ ประเภทและคุณภาพเดียวกัน หรือคล้ายคลึงกันของส่วนราชการอื่น ให้ส่วนราชการนั้น จัดทำแผนการลดรายจ่าย ต่อหน่วยของงานบริการสาธารณะ ดังกล่าวเสนอสำนักงบประมาณ กรมบัญชีกลาง และ ก.พ.ร. ทราบ และถ้ามิได้มีข้อทักท้วงประการใด ภายในสิบห้าวัน ก็ให้ส่วนราชการดังกล่าวถือปฏิบัติ ตามแผนการลดรายจ่ายนั้นต่อไปได้ "},

{id:"25660101_RN6960_00_law_Master_04", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ผู้ใดเป็นหัวหน้ากลุ่มภารกิจระดับกรม ซึ่งมีหน้าที่รับผิดชอบราชการ และบังคับบัญชาข้าราชการ ของส่วนราชการในกลุ่มภารกิจนั้น?<hr>1) รองปลัดกระทรวง    <br>2) ปลัดกระทรวง    <br>3) อธิบดี   <br>4) ถูกทุกข้อ  <br>",
 answer:  "4) ถูกทุกข้อ<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>ภายในกระทรวงจะออกกฎกระทรวงกำหนดให้ส่วนราชการระดับกรมตั้งแต่สองส่วนราชการขึ้นไปอยู่ ภายใต้กลุ่มภารกิจเดียวกันก็ได้ โดยให<strong>้แต่ละกลุ่มภารกิจมีผู้ดำรงตำแหน่งไม่ตํ่ากว่าอธิบดีคนหนึ่งเป็นหัวหน้ากลุ่ม</strong> ภารกิจรับผิดชอบราชการ และบังคับบัญชาข้าราชการ ของส่วนราชการในกลุ่มภารกิจนั้น โดยปฏิบัติราชการขึ้นตรงต่อปลัดกระทรวง หรือขึ้นตรงต่อรัฐมนตรีตามที่กำหนดโดยกฎกระทรวง และในกรณีที่ขึ้นตรงต่อรัฐมนตรีต้อง รายงานผลการดำเนินงานต่อปลัดกระทรวง ตามที่กำหนดโดยกฎกระทรวง</p><p class='act-paragraph'>ในกรณีที่กระทรวงใดมีการจัดกลุ่มภารกิจ จะให้ม<strong>ีรองปลัดกระทรวงเพิ่มขึ้นเป็นหัวหน้ากลุ่มภารกิจก็ได้ </strong>และให้อำนาจหน้าที่ของปลัดกระทรวงที่เกี่ยวกับราชการของส่วนราชการในกลุ่มภารกิจเป็นอำนาจหน้าที่ของ หัวหน้ากลุ่มภารกิจนั้น ทั้งนี้ เว้นแต่จะมีกฎกระทรวงกำหนดไว้้เป็นอย่างอื่น</p>"},

{id:"25660101_RN8043_00_law_Master_03", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>การยุบส่วนราชการ ให้ตราเป็นกฎหมายใด?<hr>1) พระราชบัญญัติ    <br>2) พระราชกำหนด    <br>3) พระราชกฤษฎีกา   <br>4) กฎกระทรวง   <br>",
 answer:  "3) พระราชกฤษฎีกา <br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br> <p class='act-paragraph'>มาตรา ๘ จัตวา การยุบส่วนราชการตามมาตรา ๗ ให้ตราเป็นพระราชกฤษฎีกา</p> <br>"},

{id:"25660101_RN4958_00_law_Master_02", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>นายอำเภอไกล่เกลี่ยและประนอมข้อพิพาทข้อใด ไม่ได้?<hr>1) ความผิดเกี่ยวกับเพศ    <br>2) ความผิดฐานยักยอกทรัพย์    <br>3) ความผิดอาญาฐานหมิ่นประมาท   <br>4) ความผิดทางแพ่ง<br>",
 answer:  "1) กระทรวงมหาดไทย<br><br>ความผิดตาม 2, 3, 4 ยอมความกันได้ จึงไกล่เกลี่ยได้<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๖๑/๓ บรรดาความผิดที่มีโทษทางอาญา ที่เกิดขึ้นในเขตอำเภอใด หากเป็นความผิดอันยอมความได้ และมิใช่เป็นความผิดเกี่ยวกับเพศ ถ้าผู้เสียหายและผู้ถูกกล่าวหายินยอม หรือแสดงความจำนง ให้ นายอำเภอของอำเภอนั้น หรือปลัดอำเภอที่นายอำเภอดังกล่าว มอบหมายเป็นผู้ไกล่เกลี่ยตามควรแก่กรณี และเมื่อ ผู้เสียหายและผู้ถูกกล่าวหายินยอมเป็นหนังสือตามที่ไกล่เกลี่ยและปฏิบัติตามคำไกล่เกลี่ยดังกล่าวแล้ว ให้คดีอาญา เป็นอันเลิกกันตามประมวลกฎหมายวิธีพิจารณาความอาญา</p><p class='act-paragraph'>ในกรณีที่ผู้เสียหายและผู้ถูกกล่าวหาไม่ยินยอมตามที่ไกล่เกลี่ย ให้จำหน่ายข้อพิพาทนั้น แต่เพื่อ ประโยชน์ในการที่ผู้เสียหายจะไปดำเนินคดีต่อไป อายุความการร้องทุกข์ตามประมวลกฎหมายอาญา ให้เริ่มนับแต่ วันที่จำหน่ายข้อพิพาท </p>"},

{id:"25660101_RN3321_00_law_Master_05", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใดไม่ถูกต้อง ตาม พ.ร.บ.ระเบียบบริหารราชการแผ่นดิน?<hr>1) อำเภอเป็นราชการส่วนภูมิภาค    <br>2)  กระทรวงเป็นราชการส่วนกลาง   <br>3) กรมเป็นราชการส่วนกลาง    <br>4) เทศบาล เป็นราชการส่วนภูมิภาค   <br>",
 answer:  "4) เทศบาล เป็นราชการส่วนภูมิภาค<br><br>เทศบาล เป็นราชการส่วนท้องถิ่น<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br>"},

{id:"25660101_RN..._00_law_Master_04", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>หน่วยงานใด เป็นผู้จัดอัตรากำลังของหน่วยราชการ ตาม พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน?<hr>1) สำนักงานคณะกรรมการข้าราชการพลเรือน   <br>2) คณะกรรมการพัฒนาระบบราชการ    <br>3) สำนักงบประมาณ   <br>4) ข้อ 1 และ 3   <br>",
 answer:  "1) สำนักงานคณะกรรมการข้าราชการพลเรือน<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๘ สัตต  ให้สำนักงานคณะกรรมการข้าราชการพลเรือนและสำนักงบประมาณร่วมกันเสนอ ความเห็นต่อคณะรัฐมนตรี ในการแบ่งส่วนราชการภายใน และในการกำหนดอำนาจหน้าที่ ของแต่ละส่วนราชการ ตามมาตรา ๘ ฉ ในการเสนอความเห็นดังกล่าว <strong>ให้สำนักงานคณะกรรมการข้าราชการพลเรือน จัดอัตรากำลัง</strong> และ สำนักงบประมาณ จัดสรรเงินงบประมาณ ให้สอดคล้องเสนอไปในคราวเดียวกัน</p><br>"},

{id:"25660101_RN2506_00_law_Master_03", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี  กำหนดให้การติดต่อประสานงานระหว่างส่วนราชการด้วยกัน ต้องใช้สิ่งใดต่อไปนี้?<hr>1) แพลตฟอร์มดิจิทัลกลาง    <br>2) หนังสือราชการ    <br>3) โทรสาร   <br>4) ถูกทุกข้อ   <br>",
 answer:  "1) แพลตฟอร์มดิจิทัลกลาง <br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><p class='act-paragraph'>มาตรา ๒๙ ในการปฏิบัติงาน ที่เกี่ยวข้องกับการบริการประชาชน หรือการติดต่อประสานงาน ระหว่างส่วนราชการด้วยกัน ให้ส่วนราชการ แต่ละแห่งจัดทำแผนภูมิ ขั้นตอนและระยะเวลาการดำเนินการ รวมทั้งรายละเอียดอื่น ๆ ที่เกี่ยวข้องในแต่ละขั้นตอน เปิดเผยไว้ ณ ที่ทำการของส่วนราชการ และในระบบเครือข่ายสารสนเทศ ของส่วนราชการ เพื่อให้ประชาชน หรือผู้ที่เกี่ยวข้องเข้าตรวจดูได้ <p class='act-paragraph'><strong>การบริการประชาชนและการติดต่อประสานงานระหว่างส่วนราชการด้วยกัน ต้องกระทำโดยใช้ แพลตฟอร์มดิจิทัลกลาง</strong>ที่สำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน) กำหนดด้วย<br>"},

{id:"25660101_RN8806_00_law_Master_02", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ส่วนราชการ ต้องจัดทำแผนปฏิบัติราชการ ให้สอดคล้องกับสิ่งใด ต่อไปนี้?<hr>1) ยุทธศาสตร์ชาติ    <br>2) แผนนิติบัญญัติ    <br>3) แผนการบริหารราชการแผ่นดิน   <br>4) ถูกทุกข้อ   <br>",
 answer:  "1) ยุทธศาสตร์ชาติ <br><br>แผนการบริหารราชการแผ่นดินและแผนนิติบัญญัติ ถูกยกเลิกแล้ว ตาม พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ฉบับที่ ๒<br><br>"},

];

var sntOrder_dat =[{id:"25660101_RN8450_00_law_Master_11", number:"<small>เรียงประโยค ๑ ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ส่วนราชการใดต่อไปนี้ <u>ไม่ใช่</u>ราชการส่วนกลาง?<hr>1) สำนักนายกรัฐมนตรี    <br>2) สำนักงานการวิจัยแห่งชาติ    <br>3) กระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม   <br>4) ไม่มีข้อใดถูก   <br>",
 answer:  "4) ไม่มีข้อใดถูก <br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๗ ให้จัดระเบียบบริหารราชการส่วนกลาง ดังนี้ </p><p class='act-paragraph'>(๑) สำนักนายกรัฐมนตรี </p><p class='act-paragraph'>(๒) กระทรวง หรือทบวงซึ่งมีฐานะเทียบเท่ากระทรวง </p><p class='act-paragraph'>(๓) ทบวง ซึ่งสังกัดสำนักนายกรัฐมนตรีหรือกระทรวง</p><p class='act-paragraph'>(๔) กรม หรือส่วนราชการที่เรียกชื่ออย่างอื่นและมีฐานะเป็นกรม ซึ่งสังกัดหรือไม่สังกัดสำนักนายกรัฐมนตรี กระทรวงหรือทบวง<em>(สำนักงานการวิจัยแห่งชาติ มีฐานะเป็นกรม ซึ่งไม่สังกัดสำนักนายกรัฐมนตรี กระทรวง หรือทบวง ขึ้นตรงกับประธานสภาวิจัยแห่งชาติ คือนายกรัฐมนตรี) </em></p><p class='act-paragraph'>สำนักนายกรัฐมนตรีมีฐานะเป็นกระทรวง</p><p class='act-paragraph'>ส่วนราชการตาม (๑) (๒) (๓) และ (๔) มีฐานะเป็นนิติบุคคล</p><br>"},

{id:"25660521_RN2300_00_law_LAW_15", number:"<small>เรียงประโยค ๒ ข้อสอบเสมือนจริง กพ (พิเศษ 21 พ.ค. 66)</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>นายดำเป็นครูสอนวิชาพละของโรงเรียนแห่งหนึ่ง ได้สั่งให้นักเรียนวิ่งรอบสนามฟุตบอลจำนวน 3 รอบ ในช่วงเวลาหลังเที่ยงวัน ซึ่งสภาพอากาศร้อนและมีแสงแดดแรง จนเป็นเหตุทำให้เด็กนักเรียนเสียชีวิต กรณีเช่นนี้ผู้ปกครองต้องฟ้องใคร ?<hr>1) ฟ้องนายดำ เพราะเป็นการกระทำโดยประมาท    <br>2) ฟ้องนายดำ เพราะเป็นการละเมิดในการปฏิบัติหน้าที่ตามปกติทั่วไป  <br>3) ฟ้องหน่วยงาน เพราะเป็นการละเมิดในการปฏิบัติหน้าที่   <br>4) ฟ้องหน่วยงาน เพราะขาดความรับผิดชอบ ปล่อยปละละเลย   <br>",
 answer:  "3) ฟ้องหน่วยงาน เพราะเป็นการละเมิดในการปฏิบัติหน้าที่  <br><br>นายดำกระทำละเมิดในขณะปฏิบัติหน้าที่ครู จึงเป็นการละเมิดในขณะปฏิบัติหน้าที่ราชการ จึงต้องฟ้องหน่วยงาน แต่หน่วยงานมีสิทธิไล่เบี้ยกับนายดำภายหลัง ถ้านายดำกระทำละเมิดโดยจงใจ หรือประมาทอย่างร้ายแรง<br><br>พ.ร.บ.ความรับผิดทางละเมิดของเจ้าหน้าที่ <br><br><p class='act-paragraph'>มาตรา ๕ <strong>หน่วยงานของรัฐ ต้องรับผิดต่อผู้เสียหายในผลแห่งละเมิด ที่เจ้าหน้าที่ของตนได้กระทำในการปฏิบัติหน้าที่ </strong>ในกรณีนี้ ผู้เสียหายอาจฟ้องหน่วยงานของรัฐดังกล่าว ได้โดยตรง แต่จะฟ้องเจ้าหน้าที่ไม่ได้ <p class='act-paragraph'>ถ้าการละเมิด เกิดจากเจ้าหน้าที่ ซึ่งไม่ได้สังกัดหน่วยงานของรัฐแห่งใด ให้ถือว่ากระทรวงการคลัง เป็นหน่วยงานของรัฐ ที่ต้องรับผิดตามวรรคหนึ่ง<br><br>"},

{id:"25660219_RN8409_02_law_LAW_14", number:"<small>เรียงประโยค ๓ ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ในคดีที่ผู้เสียหายฟ้องหน่วยงานของรัฐ ถ้าศาลพิพากษายกฟ้อง เพราะเหตุที่หน่วยงานของรัฐ ที่ถูกฟ้องมิใช่ผู้ต้องรับผิด ให้ขยายอายุความฟ้องร้องผู้ที่ต้องรับผิด ซึ่งมิได้ถูกเรียกเข้ามาในคดี ออกไปเท่าไร?<hr>1) 3 เดือน   <br>2) 6 เดือน     <br>3) 9 เดือน    <br>4) 12 เดือน    <br>",
 answer:  "2) 6 เดือน  <br><br>พ.ร.บ.ความรับผิดทางละเมิดของเจ้าหน้าที่<br><br><br><br><p class='act-paragraph'>มาตรา ๗ ในคดีที่ผู้เสียหายฟ้องหน่วยงานของรัฐ ถ้าหน่วยงานของรัฐเห็นว่า เป็นเรื่องที่เจ้าหน้าที่ต้องรับผิด หรือต้องร่วมรับผิด หรือในคดีที่ผู้เสียหายฟ้องเจ้าหน้าที่ ถ้าเจ้าหน้าที่เห็นว่าเป็นเรื่องที่หน่วยงานของรัฐต้องรับผิด หรือต้องร่วมรับผิด หน่วยงานของรัฐ หรือเจ้าหน้าที่ดังกล่าว มีสิทธิขอให้ศาลที่พิจารณาคดีนั้นอยู่ เรียกเจ้าหน้าที่ หรือหน่วยงานของรัฐ แล้วแต่กรณี เข้ามาเป็นคู่ความในคดี<p class='act-paragraph'>ถ้าศาลพิพากษายกฟ้องเพราะเหตุที่หน่วยงานของรัฐหรือเจ้าหน้าที่ ที่ถูกฟ้องมิใช่ผู้ต้องรับผิด <strong>ให้ขยายอายุความฟ้องร้องผู้ที่ต้องรับผิด ซึ่งมิได้ถูกเรียกเข้ามาในคดี ออกไปถึงหกเดือน</strong> นับแต่วันที่คำพิพากษานั้นถึงที่สุด"},

{id:"25660219_RN9793_02_law_LAW_13", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>หน่วยงานใด มีหน้าที่จัดให้มี ระบบเครือข่ายสารสนเทศกลาง ขึ้น เพื่ออำนวยความสะดวกและความรวดเร็ว แก่ประชาชนในการติดต่อประสานกับส่วนราชการ ทุกแห่ง  ?<hr>1) กระทรวงเทคโนโลยีและสารสนเทศเพื่อการสื่อสาร    <br>2) สำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน)    <br>3) กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม <br>4) ทุกกระทรวง   <br>",
 answer:  "3) กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม<br><br>ไม่มี &quot;กระทรวงเทคโนโลยีและสารสนเทศเพื่อการสื่อสาร&quot; มีแต่ &quot;กระทรวงเทคโนโลยีสารสนเทศและการสื่อสาร&quot; ซึ่งต่อมาเปลี่ยนชื่อเป็น  กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม<br><br>พ.ร.บ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><p class='act-paragraph'>มาตรา ๔๐ เพื่ออำนวยความสะดวก และความรวดเร็ว แก่ประชาชนในการติดต่อกับส่วนราชการทุกแห่ง ให้<strong>กระทรวงเทคโนโลยีสารสนเทศและการสื่อสาร จัดให้มีระบบเครือข่ายสารสนเทศกลาง</strong>ขึ้น<p class='act-paragraph'>ในกรณีที่ส่วนราชการใด ไม่อาจจัดให้มีระบบเครือข่ายสารสนเทศ ของส่วนราชการได้ อาจร้องขอ ให้กระทรวงเทคโนโลยีสารสนเทศและการสื่อสาร ดำเนินการจัดทำระบบเครือข่ายสารสนเทศ ของส่วนราชการดังกล่าว ก็ได้ ในการนี้ กระทรวงเทคโนโลยีสารสนเทศและการสื่อสาร จะขอให้ส่วนราชการ ให้ความช่วยเหลือด้านบุคลากร ค่าใช้จ่าย และข้อมูลในการดำเนินการก็ได้ <br><br><p class='act-paragraph'>มาตรา ๔๑ ในกรณีที่ส่วนราชการ ได้รับคำร้องเรียน เสนอแนะ หรือความคิดเห็น เกี่ยวกับวิธีปฏิบัติราชการ อุปสรรค ความยุ่งยาก หรือปัญหาอื่นใด จากบุคคลใด โดยมีข้อมูลและสาระตามสมควร ให้เป็นหน้าที่ของส่วนราชการนั้น ที่จะต้องพิจารณาดำเนินการให้ลุล่วงไป และในกรณีที่มีที่อยู่ของบุคคลนั้น ให้แจ้งให้บุคคลนั้น ทราบผลการดำเนินการด้วย ทั้งนี้ อาจแจ้งให้ทราบ ผ่านทางระบบเครือข่ายสารสนเทศ ของส่วนราชการด้วยก็ได้<p class='act-paragraph'>ในกรณีการแจ้งผ่านทางระบบเครือข่ายสารสนเทศ มิให้เปิดเผย ชื่อหรือที่อยู่ ของผู้ร้องเรียน เสนอแนะ หรือแสดงความคิดเห็น<br>"},

{id:"25660219_RN4398_02_law_LAW_12", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>หน่วยงานตามข้อใด <u>ไม่มีฐานะ</u>เป็น &quot;นิติบุคคล&quot; ตาม พ.ร.บ.ระเบียบบริหารราชการแผ่นดิน ?<hr>1) สำนักนายกรัฐมนตรี    <br>2) สำนักงานรัฐมนตรี   <br>3) กระทรวงมหาดไทย  <br>4) กรมสุขภาพจิต     <br>",
 answer:  "2) สำนักงานรัฐมนตรี <br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๗ ให้จัดระเบียบบริหารราชการส่วนกลาง ดังนี้ </p><p class='act-paragraph'>(๑) สำนักนายกรัฐมนตรี </p><p class='act-paragraph'>(๒) กระทรวง หรือทบวงซึ่งมีฐานะเทียบเท่ากระทรวง </p><p class='act-paragraph'>(๓) ทบวง ซึ่งสังกัดสำนักนายกรัฐมนตรีหรือกระทรวง</p><p class='act-paragraph'>(๔) กรม หรือส่วนราชการที่เรียกชื่ออย่างอื่นและมีฐานะเป็นกรม ซึ่งสังกัดหรือไม่สังกัดสำนัก นายกรัฐมนตรี กระทรวงหรือทบวง</p><p class='act-paragraph'>สำนักนายกรัฐมนตรีมีฐานะเป็นกระทรวง</p><p class='act-paragraph'>ส่วนราชการตาม (๑) (๒) (๓) และ (๔) มีฐานะเป็นนิติบุคคล</p><br>...<p class='act-paragraph'>มาตรา ๑๘ ให้จัดระเบียบราชการของกระทรวง ดังนี้ </p><p class='act-paragraph'>(๑) สำนักงานรัฐมนตรี </p><p class='act-paragraph'>(๒) สำนักงานปลัดกระทรวง</p><p class='act-paragraph'>(๓) กรม หรือส่วนราชการที่เรียกชื่ออย่างอื่น เว้นแต่บางกระทรวงเห็นว่าไม่มีความจำเป็นจะไม่แยกส่วน ราชการตั้งฃึ้นเป็นกรมก็ได้ </p><p class='act-paragraph'>ให้ส่วนราชการตาม (๒) และส่วนราชการที่เรียกชื่ออย่างอื่นตาม (๓) มีฐานะเป็นกรม </p><strong>(สำนักงานรัฐมนตรี ไม่มีฐานะเป็นกรม จึงไม่มีฐานะเป็นนิติบุคคล)</strong><br><br>"},

{id:"25660219_RN9145_02_law_LAW_11", number:"<small>ข้อสอบเสมือนจริง กพ (พิเศษ 19 ก.พ. 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>เมื่อมีการยุบกระทรวง และส่วนราชการของรัฐ ประสงค์จะรับโอนข้าราชการในกระทรวงที่ถูกยุบ ต้องกระทำภายในกี่วัน?<hr>1) 30 วัน    <br>2) 60 วัน     <br>3) 90 วัน     <br>4) 120 วัน    <br>",
 answer:  "1) 30 วัน<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๘ จัตวา<sup>๖</sup> การยุบส่วนราชการตามมาตรา ๗ ให้ตราเป็นพระราชกฤษฎีกา</p><p class='act-paragraph'>เมื่อมีพระราชกฤษฎีกา ยุบส่วนราชการตามวรรคหนึ่งแล้ว ให้งบประมาณรายจ่ายที่เหลืออยู่ของส่วน ราชการนั้นเป็นอันระงับไป สำหรับทรัพย์สินอื่นของส่วนราชการนั้นให้โอนให้แก่ส่วนราชการอื่นหรือหน่วยงานอื่น ของรัฐ ตามที่รัฐมนตรี ซึ่งเป็นผู้รักษาการ ตามพระราชกฤษฎีกาตามวรรคหนึ่งกำหนด โดยความเห็นชอบของ คณะรัฐมนตรี สำหรับวิธีการจัดการกิจการ สิทธิและหนี้สิน ของส่วนราชการนั้น ให้เป็นไปตามที่กำหนดในพระราช กฤษฎีกา</p><p class='act-paragraph'>ข้าราชการหรือลูกจ้างซึ่งต้องพ้นจากราชการเพราะเหตุยุบตำแหน่ง อันเนื่องมาแต่การยุบส่วนราชการ ตามวรรคหนึ่ง นอกเหนือจากสิทธิประโยชน์ ที่พึงได้รับตามกฎหมาย หรือระเบียบข้อบังคับอื่นแล้ว ให้ข้าราชการ หรือลูกจ้างได้รับเงินชดเชย ตามหลักเกณฑ์ และวิธีการที่กำหนด ในพระราชกฤษฎีกาตามวรรคหนึ่งด้วย</p><p class='act-paragraph'>ในกรณีที่ส่วนราชการ รัฐวิสาหกิจหรือหน่วยงานอื่นของรัฐ ประสงค์จะรับโอนข้าราชการหรือลูกจ้างตาม วรรคสาม ก็ให้กระทำได้ โดยมิให้ถือว่าข้าราชการหรือลูกจ้างผู้นั้น ได้พ้นจากราชการตามวรรคสาม <strong>แต่ทั้งนี้ต้อง กระทำภายในสามสิบวัน </strong>นับแต่พระราชกฤษฎีกาตามวรรคหนึ่งมีผลใช้บังคับ</p><br>"},

{id:"25660219_RN7865_02_law_LAW_10", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใด คือ &quot;คณะผู้แทนในต่างประเทศ&quot; ?<hr>1) ข้าราชการฝ่ายพลเรือนประจำการในต่างประเทศ ในสถานกงสุล    <br>2) ข้าราชการฝ่ายทหารประจำการในต่างประเทศ ในสถานเอกอัครราชทูต  <br>3) คณะผู้แทนถาวรไทยประจำองค์การระหว่างประเทศ   <br>4) ถูกทุกข้อ   <br>",
 answer:  "4) ถูกทุกข้อ<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><div class='act-center-text'>หมวด ๗<br>การบริหารราชการในต่างประเทศ<br>--------------</div><br><p class='act-paragraph'>มาตรา ๔๐/๑ ในหมวดนี้</p><p class='act-paragraph'>&quot;คณะผู้แทน&quot; หมายความว่า บรรดาข้าราชการฝ่ายพลเรือน หรือข้าราชการฝ่ายทหารประจำการในต่างประเทศ ซึ่งได้รับแต่งตั้งให้ดำรงตำแหน่ง ในสถานเอกอัครราชทูต สถานกงสุลใหญ่ สถานกงสุล สถานรองกงสุล ส่วนราชการของกระทรวงการต่างประเทศซึ่งเรียกชื่อเป็นอย่างอื่นและปฏิบัติหน้าที่ เช่นเดียวกับสถาน เอกอัครราชทูต หรือสถานกงสุลใหญ่ และคณะผู้แทนถาวรไทยประจำองค์การระหว่างประเทศ</p><p class='act-paragraph'>&quot;หัวหน้าคณะผู้แทน&quot; หมายความว่า ข้าราชการสังกัดกระทรวงการต่างประเทศซึ่งได้รับแต่งตั้งให้ดำรง ตำแหน่งหัวหน้าคณะผู้แทนตามระเบียบพิธีการทูต หรือระเบียบพิธีการกงสุล ในกรณีของคณะผู้แทนถาวรไทย ประจำองค์การระหว่างประเทศ ให้หมายความว่า ข้าราชการสังกัดส่วนราชการ ซึ่งได้รับแต่งตั้งให้ดำรงตำแหน่ง หัวหน้าคณะผู้แทนถาวรไทยประจำองค์การระหว่างประเทศ</p><br>"},

];

var thaiPassage_dat =[{id:"25660219_RN7865_02_law_LAW_09", number:"<small>thaiPassage1 ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>การเพิกถอนคำสั่งทางปกครองที่มีลักษณะเป็นการให้ประโยชน์ ต้องกระทำภายในกี่วัน นับแต่ได้รู้ถึงเหตุที่จะให้ เพิกถอนคำสั่งทางปกครอง?<hr>1) 30 วัน   <br>2) 60  วัน    <br>3) 90 วัน    <br>4) 120 วัน    <br>",
 answer:  "3) 90 วัน <br><br>พ.ร.บ.วิธีปฏิบัติราชการทางปกครอง<br><br><p class='act-paragraph'>มาตรา ๔๙ เจ้าหน้าที่ หรือผู้บังคับบัญชา ของเจ้าหน้าที่ อาจเพิกถอนคำสั่งทางปกครองได้ ตามหลักเกณฑในมาตรา ๕๑ มาตรา ๕๒ และมาตรา ๕๓ ไม่ว่าจะพ้นขั้นตอนการกำหนดให้อุทธรณ์ หรือให้โต้แย้ง ตามกฎหมายนี้ หรือกฎหมายอื่นมาแล้วหรือไม่ <p class='act-paragraph'><strong>การเพิกถอนคำสั่งทางปกครอง ที่มีลักษณะเป็นการให้ประโยชน์ ต้องกระทำภายใน เก้าสิบวัน </strong>นับแต่ได้รู้ถึงเหตุ ที่จะให้เพิกถอน คำสั่งทางปกครองนั้น เว้นแต่คำสั่งทางปกครองจะได้ ทำขึ้นเพราะการแสดงข้อความอันเป็นเท็จ หรือปกปิดข้อความจริง ซึ่งควรบอกให้แจ้งหรือการข่มขู่ หรือการชักจูงใจ โดยการให้ทรัพย์สินหรือประโยชน์อื่นใด ที่มิชอบด้วยกฎหมาย<br><br><p class='act-paragraph'>มาตรา ๕๐ คำสั่งทางปกครอง ที่ไม่ชอบด้วยกฎหมาย อาจถูกเพิกถอนทั้งหมดหรือบางส่วน โดยจะให้มีผลย้อนหลังหรือไม่ย้อนหลัง หรือมีผลในอนาคต ไปถึงขณะใดขณะหนึ่ง ตามที่กำหนดได้ แต่ถ้าคำสั่งนั้น เป็นคำสั่งซึ่งเป็นการให้ประโยชน์แก่ผู้รับ การเพิกถอน ต้องเป็นไปตามบทบัญญัติ มาตรา ๕๑ และมาตรา ๕๒<br><br><p class='act-paragraph'>มาตรา ๕๑ การเพิกถอนคำสั่งทางปกครอง ที่ไม่ชอบด้วยกฎหมาย ซึ่งเป็นการให้เงิน หรือให้ทรัพย์สิน หรือให้ประโยชน์ ที่อาจแบ่งแยกได้ ให้คำนึงถึงความเชื่อโดยสุจริต ของผู้รับประโยชน์ ในความคงอยู่ ของคำสั่งทางปกครองนั้น กับประโยชน์สาธารณะประกอบกัน<p class='act-paragraph'>ความเชื่อโดยสุจริตตามวรรคหนึ่ง จะได้รับความคุ้มครอง ต่อเมื่อผู้รับคำสั่งทางปกครอง ได้ใช้ประโยชน์ อันเกิดจากคำสั่งทางปกครอง หรือได้ดำเนินการ เกี่ยวกับทรัพย์สินไปแล้ว โดยไม่อาจ แก้ไขเปลี่ยนแปลงได้ หรือการเปลี่ยนแปลง จะทำให้ผู้นั้นต้องเสียหายเกินควรแก่กรณี <p class='act-paragraph'>ในกรณีดังต่อไปนี้ ผู้รับคำสั่งทางปกครอง จะอ้างความเชื่อโดยสุจริตไม่ได้ <p class='act-paragraph'>(๑) ผู้นั้นได้แสดงข้อความอันเป็นเท็จ หรือปกปิดข้อความจริง ซึ่งควรบอกให้แจ้ง หรือข่มขู่ หรือชักจูงใจ โดยการให้ทรัพย์สิน หรือให้ประโยชน์อื่นใด ที่มิชอบด้วยกฎหมาย <p class='act-paragraph'>(๒) ผู้นั้นได้ให้ข้อความ ซึ่งไม่ถูกต้อง หรือไม่ครบถ้วนในสาระสำคัญ <p class='act-paragraph'>(๓) ผู้นั้นได้รู้ถึงความไม่ชอบด้วยกฎหมาย ของคำสั่งทางปกครอง ในขณะได้รับคำสั่ง ทางปกครอง หรือการไม่รู้นั้น เป็นไปโดยความประมาทเลินเล่อ อย่างร้ายแรง<p class='act-paragraph'>ในกรณีที่เพิกถอนโดยให้มีผลย้อนหลัง การคืนเงิน ทรัพย์สิน หรือประโยชน์ที่ผู้รับคำสั่งทางปกครองได้ไป ให้นำบทบัญญัติ ว่าด้วยลาภมิควรได้ ในประมวลกฎหมายแพ่งและพาณิชย์ มาใช้บังคับโดยอนุโลม โดยถ้าเมื่อใด ผู้รับคำสั่งทางปกครอง ได้รู้ถึงความไม่ชอบด้วยกฎหมาย ของคำสั่งทางปกครอง หรือควรได้รู้เช่นนั้น หากผู้นั้นมิได้ประมาทเลินเล่ออย่างร้ายแรง ให้ถือว่าผู้นั้นตกอยู่ในฐานะไม่สุจริต ตั้งแต่เวลานั้นเป็นต้นไป และในกรณีตามวรรคสาม ผู้นั้นต้องรับผิดในการคืนเงิน ทรัพย์สิน หรือประโยชน์ที่ได้รับไปเต็มจำนวน<br><br><p class='act-paragraph'>มาตรา ๕๒ คำสั่งทางปกครอง ที่ไม่ชอบด้วยกฎหมาย และไม่อยู่ในบังคับของมาตรา ๕๑ อาจถูกเพิกถอน ทั้งหมดหรือบางส่วนได้ แต่ผู้ใด้รับผลกระทบ จากการเพิกถอนคำสั่งทางปกครองดังกล่าว มีสิทธิได้รับค่าทดแทนความเสียหาย เนื่องจากความเชื่อโดยสุจริต ในความคงอยู่ของคำสั่งทางปกครองได้ และให้นำความในมาตรา ๕๑ วรรคหนึ่ง วรรคสอง และวรรคสาม มาใช้บังคับ โดยอนุโลม แต่ต้องร้องขอค่าทดแทนภายในหนึ่งร้อยแปดสิบวัน นับแต่ได้รับแจ้งให้ทราบถึงการเพิกถอนนั้น<p class='act-paragraph'>ค่าทดแทนความเสียหายตามมาตรานี้ จะต้องไม่สูงกว่าประโยชน์ที่ผู้นั้นอาจได้รับ หากคำสั่งทางปกครองดังกล่าว ไม่ถูกเพิกถอน<br><br><p class='act-paragraph'>มาตรา ๕๓ คำสั่งทางปกครองที่ชอบด้วยกฎหมาย ซึ่งไม่เป็นการให้ประโยชน์แก่ผู้รับคำสั่งทางปกครอง อาจถูกเพิกถอนทั้งหมด หรือบางส่วน โดยให้มีผลตั้งแต่ขณะที่เพิกถอน หรือมีผลในอนาคต ไปถึงขณะใดขณะหนึ่ง ตามที่กำหนดได้ เว้นแต่เป็นกรณีที่คงต้องทำคำสั่งทางปกครอง ที่มีเนื้อหา ทำนองเดียวกันนั้นอีก หรือเป็นกรณีที่การเพิกถอน ไม่อาจกระทำได้เพราะเหตุอื่น ทั้งนี้ให้คำนึง ถึงประโยชน์ของบุคคลภายนอกประกอบด้วย<p class='act-paragraph'>คำสั่งทางปกครองที่ชอบด้วยกฎหมาย ซึ่งเป็นการให้ประโยชน์แก่ผู้รับคำสั่งทางปกครอง อาจถูกเพิกถอน ทั้งหมดหรือบางส่วน โดยให้มีผลตั้งแต่ขณะที่เพิกถอน หรือมีผลในอนาคตไปถึง ขณะใดขณะหนึ่ง ตามที่กำหนดได้ เฉพาะเมื่อมีกรณีดังต่อไปนี้ <p class='act-paragraph'>(๑) มีกฎหมายกำหนดให้เพิกถอนได้ หรือมีข้อสงวนสิทธิ ให้เพิกถอนได้ในคำสั่งทางปกครองนั้นเอง<p class='act-paragraph'>(๒) คำสั่งทางปกครองนั้น มีข้อกำหนดให้ผู้รับประโยชน์ ต้องปฏิบัติ แต่ไม่มีการปฏิบัติภายในเวลาที่กำหนด<p class='act-paragraph'>(๓) ข้อเท็จจริงและพฤติการณ์เปลี่ยนแปลงไป ซึ่งหากมีข้อเท็จจริงและพฤติการณ์เช่นนี้ ในขณะทำคำสั่งทางปกครองแล้ว เจ้าหน้าที่คงจะไม่ทำคำสั่งทางปกครองนั้น และหากไม่เพิกถอน จะก่อให้เกิดความเสียหายต่อประโยชน์สาธารณะได้ <p class='act-paragraph'>(๔) บทกฎหมายเปลี่ยนแปลงไป ซึ่งหากมีบทกฎหมายเช่นนี้ ในขณะทำคำสั่งทางปกครองแล้ว เจ้าหน้าที่คงจะไม่ทำคำสั่งทางปกครองนั้น แต่การเพิกถอนในกรณีนี้ ให้กระทำได้ เท่าที่ผู้รับประโยชน์  ยังไม่ได้ใช้ประโยชน์ หรือยังไม่ได้รับประโยชน์ ตามคำสั่งทางปกครองดังกล่าว และหากไม่เพิกถอน จะก่อให้เกิดความเสียหาย ต่อประโยชน์สาธารณะได้<p class='act-paragraph'>(๕) อาจเกิดความเสียหายอย่างร้ายแรง ต่อประโยชน์สาธารณะ หรือต่อประชาชน อันจำเป็นต้องป้องกัน หรือขจัดเหตุดังกล่าว<p class='act-paragraph'>ในกรณีที่มีการเพิกถอนคำสั่งทางปกครอง เพราะเหตุตามวรรคสอง (๓) (๔) และ (๕) ผู้ได้รับประโยชน์มีสิทธิ ได้รับค่าทดแทนความเสียหาย อันเกิดจากความเชื่อโดยสุจริต ในความคงอยู่ ของคำสั่งทางปกครองได้ และให้นำมาตรา ๕๒ มาใช้บังคับโดยอนุโลม<p class='act-paragraph'>คำสั่งทางปกครองที่ชอบด้วยกฎหมาย ซึ่งเป็นการให้เงิน หรือให้ทรัพย์สิน หรือให้ประโยชน์ที่อาจแบ่งแยกได้ อาจถูกเพิกถอน ทั้งหมดหรือบางส่วน โดยให้มีผลย้อนหลัง หรือไม่มีผลย้อนหลัง หรือมีผลในอนาคต ไปถึงขณะใดขณะหนึ่ง ตามที่กำหนดได้ในกรณีดังต่อไปนี้ <p class='act-paragraph'>(๑) มิได้ปฏิบัติ หรือปฏิบัติล่าช้า ในอันที่จะดำเนินการ ให้เป็นไปตามวัตถุประสงค์ของคำสั่งทางปกครอง<p class='act-paragraph'>(๒) ผู้ได้รับประโยชน์ มิได้ปฏิบัติหรือปฏิบัติล่าช้า ในอันที่จะดำเนินการให้เป็นไป ตามเงื่อนไขของคำสั่งทางปกครอง<p class='act-paragraph'>ทั้งนี้ให้นำความในมาตรา ๕๑ มาใช้บังคับโดยอนุโลม<br>"},

{id:"25660219_RN7865_02_law_LAW_08", number:"<small>thaiPassage 2 ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>หน่วยงานใดมีหน้าที่จัดทำประมวลจริยธรรมสำหรับเจ้าหน้าที่ของรัฐที่อยู่ในความรับผิดชอบ ?<hr>1) สำนักงานคณะกรรมการข้าราชการพลเรือน    <br>2) คณะกรรมการมาตรฐานทางจริยธรรม     <br>3) คณะกรรมการธรรมาภิบาลจังหวัด   <br>4) องค์กรกลางบริหารงานบุคคล   <br>",
 answer:  "4) องค์กรกลางบริหารงานบุคคล<br><br>พ.ร.บ.มาตรฐานทางจริยธรรม<br><br><p>มาตรา ๖ ให้องค์กรกลางบริหารงานบุคคลของหน่วยงานของรัฐมีหน้าที่จัดทำประมวลจริยธรรมสำหรับเจ้าหน้าที่ของรัฐที่อยู่ในความรับผิดชอบ<p>ในกรณีที่เป็นเจ้าหน้าที่ของรัฐซึ่งไม่มีองค์กรกลางบริหารงานบุคคลที่รับผิดชอบ ให้องค์กรต่อไปนี้เป็นผู้จัดทำประมวลจริยธรรม<p>(๑) คณะรัฐมนตรี สำหรับข้าราชการการเมือง<p>(๒) สภากลาโหม สำหรับข้าราชการทหารและข้าราชการพลเรือนกลาโหม<p>(๓) สำนักงานคณะกรรมการนโยบายรัฐวิสาหกิจ สำหรับผู้บริหารและพนักงานรัฐวิสาหกิจ<p>(๔) คณะกรรมการพัฒนาและส่งเสริมองค์การมหาชน สำหรับผู้บริหาร เจ้าหน้าที่ และผู้ปฏิบัติงานขององค์การมหาชน<p>ในกรณีที่มีปัญหาว่าองค์กรใดเป็นผู้จัดทำประมวลจริยธรรมสำหรับเจ้าหน้าที่ของรัฐประเภทใดให้ ก.ม.จ. เป็นผู้มีอำนาจวินิจฉัย<br>"},

{id:"25640101_RN7865_02_law_TJK_00", number:"<small>thaiPassage 3ข้อสอบเสมือนจริง กพ</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>นายปัญญา รับมอบอำนาจจากบริษัทแห่งหนึ่งเข้าแจ้งความที่ สถานีตำรวจภูธร แห่งหนึ่ง ในคดีหลักทรัพย์ แต่เกิดข้อผิดพลาดในการบันทึกข้อมูลของตำรวจ โดยบันทึกเลขบัตรประชาชนของนายปัญญาเป็นผู้ต้องหา แทนที่จะเป็นผู้เสียหายทำให้ นายปัญญา ไม่สามารถสมัครเข้าทำงานที่ใหม่ได้และมีประวัติอาชญากรติดตัว <br><br>กรณีนี้ นายปัญญาจะฟ้องใคร ฟ้องที่ศาลไหน?<hr>1) ฟ้องผู้บันทึกข้อมูล ฟ้องต่อศาลปกครอง    <br>2) ฟ้องผู้บันทึกข้อมูล ฟ้องต่อศาลยุติธรรม     <br>3) ฟ้องหน่วยงาน  ฟ้องต่อศาลปกครอง   <br>4) ฟ้องหน่วยงาน  ฟ้องต่อศาลยุติธรรม <br>",
 answer:  "4) ฟ้องหน่วยงาน  ฟ้องต่อศาลยุติธรรม<br><br>กรณีนี้ เป็นการละเมิดซึ่งกระทำในการปฏิบัติหน้าที่จึงต้องฟ้องหน่วยงาน และการละเมิดเกิดขึ้นในขณะ<strong>การปฏิบัติหน้าที่ตามปกติ </strong>การบันทึกข้อมูลไม่ใช่การใช้อำนาจตามกฎหมาย จึงต้องฟ้องต่อศาลยุติธรรม <br>กรณีนี้ เทียบเคียงได้กับตัวอย่างนายแพทย์ ซึ่งวินิจฉัยโรคไม่ถูกต้อง และทำการผ่าตัดคนไข้ ทำให้ถูกฟ้อง ซึ่งจะฟ้องที่ศาลยุติธรรม ไม่ใช่ศาลปกครอง (ดูรายละเอียดข้างล่าง)<br><br>พ.ร.บ.ความรับผิดทางละเมิดของเจ้าหน้าที่ <br><br><p class='act-paragraph'>มาตรา ๕ หน่วยงานของรัฐ ต้องรับผิดต่อผู้เสียหายในผลแห่งละเมิด ที่เจ้าหน้าที่ของตนได้กระทำในการปฏิบัติหน้าที่ ในกรณีนี้ ผู้เสียหายอาจฟ้องหน่วยงานของรัฐดังกล่าว ได้โดยตรง แต่จะฟ้องเจ้าหน้าที่ไม่ได้ <br><br><font color='red'><strong>จะฟ้องใคร </strong> </font>: บุคคลหรือหน่วยงาน<br><br>ถ้าการละเมิด เป็นการละเมิดในหน้าที่ราชการ ให้ฟ้องหน่วยงาน <br>แต่ถ้าการละเมิด เป็นการละเมิดที่ไม่ใช่หน้าที่ราชการ ให้ฟ้องบุคคล<br><br>ถ้าเป็นการกระทำของเจ้าหน้าที่ ที่มีอำนาจตามกฎหมาย และกระทำในฐานะเจ้าหน้าที่ เช่น ตำรวจล็อคล้อรถที่จอดในที่ห้ามจอด <br><br>นอกจากจะมีอำนาจหน้าที่ตามกฎหมายแล้ว การกระทำของเจ้าหน้าที่อื่น ๆ เช่น ทำงานธุรการทั่วไป อาจจะไม่มีกฎหมายกำหนดให้อำนาจไว้อย่างชัดเจน แต่มีระเบียบ หรือข้อบังคับ หรือคำสั่งของผู้บังคับบัญชาที่ชอบด้วยกฎหมาย อย่างนี้ก็ถือเป็นการปฏิบัติในหน้าที่ราชการเหมือนกัน ถ้ามีการละเมิด ก็จะต้องฟ้องหน่วยงาน จะฟ้องบุคคลไม่ได้<br><br>มีข้อสังเกตว่า การการปฏิบัติหน้าที่ ไม่ผูกติดกับเวลาหรือสถานที่ การปฏิบัติหน้าที่ราชการอาจจะเกิดนอกเวลาราชการ ก็ได้ เช่น ขับรถขณะเดินทางกลับจากการไปราชการนอกสถานที่ ซึ่งเป็นเวลาหลัง 16.30 น. แล้วเกิดอุบัติเหตุ อย่างนี้ก็ถือเป็นการปฏิบัติหน้าที่ราชการเหมือนกัน เจ้าหน้าที่ก็จะได้รับความคุ้มครองตาม พ.ร.บ. นี้ ถ้าผู้เสียหายจะฟ้อง ต้องฟ้องหน่วยงาน ไม่ใช่ฟ้องคนขับรถ<br><br>จะฟ้องต่อบุคคล ก็ต่อเมื่อการกระทำนั้น ไม่เกี่ยวข้องกับการปฏิบัติหน้าที่ หรือผลประโยชน์ของราชการ เช่น เจ้าหน้าที่ไปราชการแล้วเกิดบันดาลโทสะ ทำร้ายผู้อื่นให้บาดเจ็บ อย่างนี้ไม่ใช่การปฏิบัติหน้าที่ราชการ เพราะ ราชการไม่มีกฎ ระเบียบให้เจ้าหน้าที่ไปทำร้ายผู้อื่น หรือ ครูขับรถไปตกปลากับเพื่อนแล้วเกิดอุบัติเหตุ อย่างนี้ก็ต้องฟ้องครู เพราะการไปตกปลาไม่เกี่ยวกับหน้าที่ราชการของครู เป็นต้น<br><br><font color='red'><strong>จะฟ้องใคร </strong> </font>: บุคคลหรือหน่วยงาน<br><br>ถ้าการละเมิด เป็นการละเมิดในหน้าที่ราชการ ให้ฟ้องหน่วยงาน <br>แต่ถ้าการละเมิด เป็นการละเมิดที่ไม่ใช่หน้าที่ราชการ ให้ฟ้องบุคคล<br><br>ถ้าเป็นการกระทำของเจ้าหน้าที่ ที่มีอำนาจตามกฎหมาย และกระทำในฐานะเจ้าหน้าที่ เช่น ตำรวจล็อคล้อรถที่จอดในที่ห้ามจอด <br><br>นอกจากจะมีอำนาจหน้าที่ตามกฎหมายแล้ว การกระทำของเจ้าหน้าที่อื่น ๆ เช่น ทำงานธุรการทั่วไป อาจจะไม่มีกฎหมายกำหนดให้อำนาจไว้อย่างชัดเจน แต่มีระเบียบ หรือข้อบังคับ หรือคำสั่งของผู้บังคับบัญชาที่ชอบด้วยกฎหมาย อย่างนี้ก็ถือเป็นการปฏิบัติในหน้าที่ราชการเหมือนกัน ถ้ามีการละเมิด ก็จะต้องฟ้องหน่วยงาน จะฟ้องบุคคลไม่ได้<br><br>มีข้อสังเกตว่า การการปฏิบัติหน้าที่ ไม่ผูกติดกับเวลาหรือสถานที่ การปฏิบัติหน้าที่ราชการอาจจะเกิดนอกเวลาราชการ ก็ได้ เช่น ขับรถขณะเดินทางกลับจากการไปราชการนอกสถานที่ ซึ่งเป็นเวลาหลัง 16.30 น. แล้วเกิดอุบัติเหตุ อย่างนี้ก็ถือเป็นการปฏิบัติหน้าที่ราชการเหมือนกัน เจ้าหน้าที่ก็จะได้รับความคุ้มครองตาม พ.ร.บ. นี้ ถ้าผู้เสียหายจะฟ้อง ต้องฟ้องหน่วยงาน ไม่ใช่ฟ้องคนขับรถ<br><br>จะฟ้องต่อบุคคล ก็ต่อเมื่อการกระทำนั้น ไม่เกี่ยวข้องกับการปฏิบัติหน้าที่ หรือผลประโยชน์ของราชการ เช่น เจ้าหน้าที่ไปราชการแล้วเกิดบันดาลโทสะ ทำร้ายผู้อื่นให้บาดเจ็บ อย่างนี้ไม่ใช่การปฏิบัติหน้าที่ราชการ เพราะ ราชการไม่มีกฎ ระเบียบให้เจ้าหน้าที่ไปทำร้ายผู้อื่น หรือ ครูขับรถไปตกปลากับเพื่อนแล้วเกิดอุบัติเหตุ อย่างนี้ก็ต้องฟ้องครู เพราะการไปตกปลาไม่เกี่ยวกับหน้าที่ราชการของครู เป็นต้น<br><br><font color='red'><strong>จะฟ้องศาลไหน </strong> </font>: ศาลปกครองหรือศาลยุติธรรม<br><br><strong>กรณีฟ้องต่อศาลปกครอง</strong><br><br><ol><li>เป็นกรณีละเมิดที่เกิดจากการที่เจ้าหน้าที่รัฐ ใช้อำนาจตามกฎหมาย ซึ่งในที่นี้คือ &quot;ปฏิบัติการทางปกครอง&quot; เช่น การที่ตำรวจจราจรใช้อำนาจตามกฎหมาย ล็อคล้อรถยนต์ หรือกรณีที่เจ้าพนักงานท้องถิ่นทำการรื้อถอนอาคารที่สร้างโดยผิดกฎหมาย เป็นต้น<br><br><font color='red'><strong>แต่ถ้า</strong></font>เป็นการกระทำละเมิดของเจ้าหน้าที่ในการปฏิบัติหน้าที่ตามปกติทั่วไป ที่มิได้เกิดจากการใช้อำนาจตามกฎหมาย ก็ไม่อยู่ในอำนาจของศาลปกครอง เช่น<br>&emsp;- การกระทำ ละเมิดของเจ้าหน้าที่ที่เกิดจากการขับรถยนต์ในการปฏิบัติหน้าที่โดยประมาท ซึ่งเป็นการกระทำละเมิดใน<strong>การปฏิบัติหน้าที่ตามปกติทั่วไป</strong> มิใช่เป็นการใช้อำนาจตามกฎหมาย จึงไม่อยู่ในอำนาจของศาลปกครองแต่อยู่ในอำนาจของศาลยุติธรรม<br>&emsp; - การที่แพทย์โรงพยาบาลของรัฐตรวจรักษาผู้ป่วยไม่ถูกต้อง ทำให้อาการป่วยของผู้ป่วยทรุดหนักลง ซึ่งเป็นการปฏิบัติหน้าที่โดยใช้วิชาความรู้ทางการแพทย์ไม่ถูกต้อง มิใช่เป็นการใช้อำนาจตามกฎหมายจึงไม่อยู่ในอำนาจของศาลปกครอง แต่อยู่ในอำนาจของศาลยุติธรรม<br>อ้างอิง<br>สำนักประชาสัมพันธ์ สำนักงานศาลปกครอง. &quot; ข้อควรรู้ก่อนไปศาลปกครอง&quot;. https://admincourt.go.th/ADMINCOURT/upload/webcms/Oldnews/attach/news_attach/2015/02/kor-01-2558-p13.pdf หน้า 21<br></li><li> เป็นกรณีการละเมิดที่เกิดจากการออกกฎ คำสั่งทางปกครอง หรือคำสั่งอื่น กรณีนี้จะต้องเป็นการออกกฎ คำสั่งทางปกครอง หรือคำสั่งอื่นโดยไม่ชอบด้วยกฎหมาย เช่น ไม่มีกฎหมายให้อำนาจในการออก หรือออกมาโดยไม่ถูกต้องตามที่กฎหมายกำหนด กรณีดังกล่าว หากก่อให้เกิดความเสียกายแก่บุคคลใด ก็เป็นการกระทำละเมิดได้ และผู้เสียหายฟ้องคดีต่อศาลปกครองได้ <br>อ้างจาก https://dmcrth.dmcr.go.th/lag/detail/1196/</li><li>กรณีการละเมิดจากการละเลยหน้าที่ตามที่กฎหมายกำหนดให้ต้องปฏิบัติ หรือปฏิบัติหน้าที่ดังกล่าว ล่าช้าเกินสมควร ทำให้บุคคลอื่นได้รับความเสียหาย<br>อ้างจาก https://dmcrth.dmcr.go.th/lag/detail/1196/</li></ol><strong>กรณีฟ้องต่อศาลยุติธรรม</strong><ol><li>เป็นกรณีการกระทำละเมิดของเจ้าหน้าที่ ซึ่งมิใช่การกระทำในการปฏิบัติหน้าที่ หรือ ที่ถือได้ว่า เป็นการกระทำละเมิดในทางส่วนตัวของเจ้าหน้าที่ผู้นั้นเอง ในกรณีนี้ เจ้าหน้าที่ต้องรับผิดเป็นการส่วนตัว หน่วยงานของรัฐไม่ต้องรับผิดการละเมิดที่เกิดขึ้นนั้น<br>ตัวอย่าง<br>กรณีเจ้าหน้าที่ ใช้กำลังทำร้ายร่างกายผู้อื่นโดยเหตุส่วนตัว ย่อมเป็นกรณีที่เจ้าหน้าที่ กระทำไปโดยมีมูลเหตุจูงใจส่วนตัวในการทำร้ายร่างกายผู้อื่น มิใช่เป็นการกระทำในการปฏิบัติหน้าที่ ในฐานะเจ้าหน้าที่ของรัฐ กรณีนี้เจ้าหน้าที่ต้องรับผิดเป็นการส่วนตัว</li><li> เป็นการกระทำละเมิดของเจ้าหน้าที่ ในการปฏิบัติหน้าที่ ซึ่งมิได้เกิดจากการใช้อำนาจตามกฎหมายปกครอง กล่าวคือ <strong>เป็นการปฏิบัติหน้าที่โดยปกติทั่วไป</strong> มิได้เป็นการใช้อำนาจเหนือของฝ่ายปกครอง หรือเป็นการปฏิบัติหน้าที่ซึ่งมิได้เกิดจากการออกกฎ คำสั่งทางปกครอง หรือ คำสั่งอื่น หรือ การละเมิดนั้น มิได้เกิดจากการละเลยต่อหน้าที่ หรือปฏิบัติหน้าที่ตามกฎหมาย ล่าช้าเกินสมควร<br><br>ตัวอย่าง<br>กรณีผู้ป่วยฟ้องแพทย์ผู้ผ่าตัดเนื้องอก แต่ปรากฎว่าเนื้องอกที่แพทย์สันนิษฐานนั้น เป็นทารกอันเกิดจากการตั้งครรภ์ธรรมชาติของผู้ฟ้องคดี การผ่าตัดดังกล่าว ทำให้ผู้ฟ้องคดีเกิดความทุกข์ทรมาน ไม่สามารถทำงานได้ ไม่มีรายได้เลี้ยงชีพ <br>กรณีนี้ ศาลปกครองสูงสุดวินิจฉัยว่า ผู้ถูกฟ้องมิได้ใช้อำนาจตามกฎหมายกระทำต่อผู้ฟ้องคดี แต่เป็นความรับผิดทางละเมิดของหน่วยงานทางปกครอง อันเกิดจากการกระทำ<strong>ในการปฏิบัติหน้าที่ธรรมดาทั่วไปของเจ้าหน้าที่ของรัฐ</strong> ซึ่งอยู่ในอำนาจพิจารณาพิพากษาของ ศาลยุติธรรม<br>(คำวินิจฉัยศาลปกครองสูงสุดที่ อ.๒๒๔/๒๕๕๐)<br></li></ol>"},

{id:"25600101_RN7865_02_law_TJK_00", number:"<small>ข้อสอบเสมือนจริง กพ</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ครูประกอบเป็นครูสอนวิชาพละ ของโรงเรียนแห่งหนึ่ง ลงโทษนักเรียนในขณะสอนวิชาพละ ให้วิ่งรอบสนาม 3 รอบ นักเรียนคนหนึ่งวิ่งได้ 2 รอบแล้วล้มลง ต้องพาส่งโรงพยาบาล <br><br>กรณีนี้ ผู้ปกครองของเด็กนักเรียนจะต้องฟ้องใครและศาลใด ?<hr>1) ฟ้องครูประกอบ ฟ้องต่อศาลปกครอง    <br>2)  ฟ้องครูประกอบ ฟ้องต่อศาลยุติธรรม     <br>3) ฟ้องหน่วยงาน  ฟ้องต่อศาลปกครอง   <br>4) ฟ้องหน่วยงาน  ฟ้องต่อศาลยุติธรรม <br>",
 answer:  "4) ฟ้องหน่วยงาน  ฟ้องต่อศาลยุติธรรม<br><br>กรณีนี้ เป็นการละเมิดซึ่งกระทำในการปฏิบัติหน้าที่จึงต้องฟ้องหน่วยงาน และการละเมิดเกิดขึ้นในขณะ<strong>การปฏิบัติหน้าที่ตามปกติ </strong>ไม่ได้เป็นการใช้อำนาจตามกฎหมาย จึงต้องฟ้องต่อศาลยุติธรรม <br>กรณีนี้ เทียบเคียงได้กับตัวอย่างนายแพทย์ ซึ่งวินิจฉัยโรคไม่ถูกต้อง และทำการผ่าตัดคนไข้ ทำให้ถูกฟ้อง ซึ่งจะฟ้องที่ศาลยุติธรรม ไม่ใช่ศาลปกครอง (ดูรายละเอียดข้างล่าง)<br><br>พ.ร.บ.ความรับผิดทางละเมิดของเจ้าหน้าที่ <br><br><p class='act-paragraph'>มาตรา ๕ หน่วยงานของรัฐ ต้องรับผิดต่อผู้เสียหายในผลแห่งละเมิด ที่เจ้าหน้าที่ของตนได้กระทำในการปฏิบัติหน้าที่ ในกรณีนี้ ผู้เสียหายอาจฟ้องหน่วยงานของรัฐดังกล่าว ได้โดยตรง แต่จะฟ้องเจ้าหน้าที่ไม่ได้ <br><br><font color='red'><strong>จะฟ้องใคร </strong> </font>: บุคคลหรือหน่วยงาน<br><br>ถ้าการละเมิด เป็นการละเมิดในหน้าที่ราชการ ให้ฟ้องหน่วยงาน <br>แต่ถ้าการละเมิด เป็นการละเมิดที่ไม่ใช่หน้าที่ราชการ ให้ฟ้องบุคคล<br><br>ถ้าเป็นการกระทำของเจ้าหน้าที่ ที่มีอำนาจตามกฎหมาย และกระทำในฐานะเจ้าหน้าที่ เช่น ตำรวจล็อคล้อรถที่จอดในที่ห้ามจอด <br><br>นอกจากจะมีอำนาจหน้าที่ตามกฎหมายแล้ว การกระทำของเจ้าหน้าที่อื่น ๆ เช่น ทำงานธุรการทั่วไป อาจจะไม่มีกฎหมายกำหนดให้อำนาจไว้อย่างชัดเจน แต่มีระเบียบ หรือข้อบังคับ หรือคำสั่งของผู้บังคับบัญชาที่ชอบด้วยกฎหมาย อย่างนี้ก็ถือเป็นการปฏิบัติในหน้าที่ราชการเหมือนกัน ถ้ามีการละเมิด ก็จะต้องฟ้องหน่วยงาน จะฟ้องบุคคลไม่ได้<br><br>มีข้อสังเกตว่า การการปฏิบัติหน้าที่ ไม่ผูกติดกับเวลาหรือสถานที่ การปฏิบัติหน้าที่ราชการอาจจะเกิดนอกเวลาราชการ ก็ได้ เช่น ขับรถขณะเดินทางกลับจากการไปราชการนอกสถานที่ ซึ่งเป็นเวลาหลัง 16.30 น. แล้วเกิดอุบัติเหตุ อย่างนี้ก็ถือเป็นการปฏิบัติหน้าที่ราชการเหมือนกัน เจ้าหน้าที่ก็จะได้รับความคุ้มครองตาม พ.ร.บ. นี้ ถ้าผู้เสียหายจะฟ้อง ต้องฟ้องหน่วยงาน ไม่ใช่ฟ้องคนขับรถ<br><br>จะฟ้องต่อบุคคล ก็ต่อเมื่อการกระทำนั้น ไม่เกี่ยวข้องกับการปฏิบัติหน้าที่ หรือผลประโยชน์ของราชการ เช่น เจ้าหน้าที่ไปราชการแล้วเกิดบันดาลโทสะ ทำร้ายผู้อื่นให้บาดเจ็บ อย่างนี้ไม่ใช่การปฏิบัติหน้าที่ราชการ เพราะ ราชการไม่มีกฎ ระเบียบให้เจ้าหน้าที่ไปทำร้ายผู้อื่น หรือ ครูขับรถไปตกปลากับเพื่อนแล้วเกิดอุบัติเหตุ อย่างนี้ก็ต้องฟ้องครู เพราะการไปตกปลาไม่เกี่ยวกับหน้าที่ราชการของครู เป็นต้น<br><br><font color='red'><strong>จะฟ้องศาลไหน </strong> </font>: ศาลปกครองหรือศาลยุติธรรม<br><br><strong>กรณีฟ้องต่อศาลปกครอง</strong><br><br><ol><li>เป็นกรณีละเมิดที่เกิดจากการที่เจ้าหน้าที่รัฐ ใช้อำนาจตามกฎหมาย ซึ่งในที่นี้คือ &quot;ปฏิบัติการทางปกครอง&quot; เช่น การที่ตำรวจจราจรใช้อำนาจตามกฎหมาย ล็อคล้อรถยนต์ หรือกรณีที่เจ้าพนักงานท้องถิ่นทำการรื้อถอนอาคารที่สร้างโดยผิดกฎหมาย เป็นต้น<br><br><font color='red'><strong>แต่ถ้า</strong></font>เป็นการกระทำละเมิดของเจ้าหน้าที่ในการปฏิบัติหน้าที่ตามปกติทั่วไป ที่มิได้เกิดจากการใช้อำนาจตามกฎหมาย ก็ไม่อยู่ในอำนาจของศาลปกครอง เช่น<br>&emsp;- การกระทำ ละเมิดของเจ้าหน้าที่ที่เกิดจากการขับรถยนต์ในการปฏิบัติหน้าที่โดยประมาท ซึ่งเป็นการกระทำละเมิดใน<strong>การปฏิบัติหน้าที่ตามปกติทั่วไป</strong> มิใช่เป็นการใช้อำนาจตามกฎหมาย จึงไม่อยู่ในอำนาจของศาลปกครองแต่อยู่ในอำนาจของศาลยุติธรรม<br>&emsp; - การที่แพทย์โรงพยาบาลของรัฐตรวจรักษาผู้ป่วยไม่ถูกต้อง ทำให้อาการป่วยของผู้ป่วยทรุดหนักลง ซึ่งเป็นการปฏิบัติหน้าที่โดยใช้วิชาความรู้ทางการแพทย์ไม่ถูกต้อง มิใช่เป็นการใช้อำนาจตามกฎหมายจึงไม่อยู่ในอำนาจของศาลปกครอง แต่อยู่ในอำนาจของศาลยุติธรรม<br>อ้างอิง<br>สำนักประชาสัมพันธ์ สำนักงานศาลปกครอง. &quot; ข้อควรรู้ก่อนไปศาลปกครอง&quot;. https://admincourt.go.th/ADMINCOURT/upload/webcms/Oldnews/attach/news_attach/2015/02/kor-01-2558-p13.pdf หน้า 21<br></li><li> เป็นกรณีการละเมิดที่เกิดจากการออกกฎ คำสั่งทางปกครอง หรือคำสั่งอื่น กรณีนี้จะต้องเป็นการออกกฎ คำสั่งทางปกครอง หรือคำสั่งอื่นโดยไม่ชอบด้วยกฎหมาย เช่น ไม่มีกฎหมายให้อำนาจในการออก หรือออกมาโดยไม่ถูกต้องตามที่กฎหมายกำหนด กรณีดังกล่าว หากก่อให้เกิดความเสียกายแก่บุคคลใด ก็เป็นการกระทำละเมิดได้ และผู้เสียหายฟ้องคดีต่อศาลปกครองได้ <br>อ้างจาก https://dmcrth.dmcr.go.th/lag/detail/1196/</li><li>กรณีการละเมิดจากการละเลยหน้าที่ตามที่กฎหมายกำหนดให้ต้องปฏิบัติ หรือปฏิบัติหน้าที่ดังกล่าว ล่าช้าเกินสมควร ทำให้บุคคลอื่นได้รับความเสียหาย<br>อ้างจาก https://dmcrth.dmcr.go.th/lag/detail/1196/</li></ol><strong>กรณีฟ้องต่อศาลยุติธรรม</strong><ol><li>เป็นกรณีการกระทำละเมิดของเจ้าหน้าที่ ซึ่งมิใช่การกระทำในการปฏิบัติหน้าที่ หรือ ที่ถือได้ว่า เป็นการกระทำละเมิดในทางส่วนตัวของเจ้าหน้าที่ผู้นั้นเอง ในกรณีนี้ เจ้าหน้าที่ต้องรับผิดเป็นการส่วนตัว หน่วยงานของรัฐไม่ต้องรับผิดการละเมิดที่เกิดขึ้นนั้น<br>ตัวอย่าง<br>กรณีเจ้าหน้าที่ ใช้กำลังทำร้ายร่างกายผู้อื่นโดยเหตุส่วนตัว ย่อมเป็นกรณีที่เจ้าหน้าที่ กระทำไปโดยมีมูลเหตุจูงใจส่วนตัวในการทำร้ายร่างกายผู้อื่น มิใช่เป็นการกระทำในการปฏิบัติหน้าที่ ในฐานะเจ้าหน้าที่ของรัฐ กรณีนี้เจ้าหน้าที่ต้องรับผิดเป็นการส่วนตัว</li><li> เป็นการกระทำละเมิดของเจ้าหน้าที่ ในการปฏิบัติหน้าที่ ซึ่งมิได้เกิดจากการใช้อำนาจตามกฎหมายปกครอง กล่าวคือ <strong>เป็นการปฏิบัติหน้าที่โดยปกติทั่วไป</strong> มิได้เป็นการใช้อำนาจเหนือของฝ่ายปกครอง หรือเป็นการปฏิบัติหน้าที่ซึ่งมิได้เกิดจากการออกกฎ คำสั่งทางปกครอง หรือ คำสั่งอื่น หรือ การละเมิดนั้น มิได้เกิดจากการละเลยต่อหน้าที่ หรือปฏิบัติหน้าที่ตามกฎหมาย ล่าช้าเกินสมควร<br><br>ตัวอย่าง<br>กรณีผู้ป่วยฟ้องแพทย์ผู้ผ่าตัดเนื้องอก แต่ปรากฎว่าเนื้องอกที่แพทย์สันนิษฐานนั้น เป็นทารกอันเกิดจากการตั้งครรภ์ธรรมชาติของผู้ฟ้องคดี การผ่าตัดดังกล่าว ทำให้ผู้ฟ้องคดีเกิดความทุกข์ทรมาน ไม่สามารถทำงานได้ ไม่มีรายได้เลี้ยงชีพ <br>กรณีนี้ ศาลปกครองสูงสุดวินิจฉัยว่า ผู้ถูกฟ้องมิได้ใช้อำนาจตามกฎหมายกระทำต่อผู้ฟ้องคดี แต่เป็นความรับผิดทางละเมิดของหน่วยงานทางปกครอง อันเกิดจากการกระทำ<strong>ในการปฏิบัติหน้าที่ธรรมดาทั่วไปของเจ้าหน้าที่ของรัฐ</strong> ซึ่งอยู่ในอำนาจพิจารณาพิพากษาของ ศาลยุติธรรม<br>(คำวินิจฉัยศาลปกครองสูงสุดที่ อ.๒๒๔/๒๕๕๐)<br></li></ol>"},

{id:"25660219_RN8806_02_law_LAW_07", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>สุดา เป็นครูสอนวิชาวิทยาศาสตร์ของโรงเรียนแห่งหนึ่ง ในขณะสาธิตเรื่องการต่อวงจรไฟฟ้า นักเรียนคนหนึ่งเกิดอุบัติเหตุ ถูกไฟฟ้าซ็อตเสียชีวิต กรณีนี้ ผู้ปกครองของเด็กจะต้องฟ้องใครและศาลใด ?<hr>1) ฟ้องสุดา ฟ้องต่อศาลปกครอง    <br>2)  ฟ้องสุดา ฟ้องต่อศาลยุติธรรม     <br>3) ฟ้องหน่วยงาน  ฟ้องต่อศาลปกครอง   <br>4) ฟ้องหน่วยงาน  ฟ้องต่อศาลยุติธรรม <br>",
 answer:  "4) ฟ้องหน่วยงาน  ฟ้องต่อศาลยุติธรรม<br><br>กรณีนี้ เป็นการละเมิดซึ่งกระทำในการปฏิบัติหน้าที่จึงต้องฟ้องหน่วยงาน และการละเมิดเกิดขึ้นในขณะการปฏิบัติหน้าที่ตามปกติ ไม่ได้เป็นการใช้อำนาจตามกฎหมาย จึงต้องฟ้องต่อศาลยุติธรรม <br>กรณีนี้ เทียบเคียงได้กับตัวอย่างนายแพทย์ ซึ่งวินิจฉัยโรคไม่ถูกต้อง และทำการผ่าตัดคนไข้ ทำให้ถูกฟ้อง ซึ่งจะฟ้องที่ศาลยุติธรรม ไม่ใช่ศาลปกครอง<br><br>พ.ร.บ.ความรับผิดทางละเมิดของเจ้าหน้าที่ <br><br><p class='act-paragraph'>มาตรา ๕ หน่วยงานของรัฐ ต้องรับผิดต่อผู้เสียหายในผลแห่งละเมิด ที่เจ้าหน้าที่ของตนได้กระทำในการปฏิบัติหน้าที่ ในกรณีนี้ ผู้เสียหายอาจฟ้องหน่วยงานของรัฐดังกล่าว ได้โดยตรง แต่จะฟ้องเจ้าหน้าที่ไม่ได้ <br><br><font color='red'><strong>จะฟ้องใคร </strong> </font>: บุคคลหรือหน่วยงาน<br><br>ถ้าการละเมิด เป็นการละเมิดในหน้าที่ราชการ ให้ฟ้องหน่วยงาน <br>แต่ถ้าการละเมิด เป็นการละเมิดที่ไม่ใช่หน้าที่ราชการ ให้ฟ้องบุคคล<br><br>ถ้าเป็นการกระทำของเจ้าหน้าที่ ที่มีอำนาจตามกฎหมาย และกระทำในฐานะเจ้าหน้าที่ เช่น ตำรวจล็อคล้อรถที่จอดในที่ห้ามจอด <br><br>นอกจากจะมีอำนาจหน้าที่ตามกฎหมายแล้ว การกระทำของเจ้าหน้าที่อื่น ๆ เช่น ทำงานธุรการทั่วไป อาจจะไม่มีกฎหมายกำหนดให้อำนาจไว้อย่างชัดเจน แต่มีระเบียบ หรือข้อบังคับ หรือคำสั่งของผู้บังคับบัญชาที่ชอบด้วยกฎหมาย อย่างนี้ก็ถือเป็นการปฏิบัติในหน้าที่ราชการเหมือนกัน ถ้ามีการละเมิด ก็จะต้องฟ้องหน่วยงาน จะฟ้องบุคคลไม่ได้<br><br>มีข้อสังเกตว่า การการปฏิบัติหน้าที่ ไม่ผูกติดกับเวลาหรือสถานที่ การปฏิบัติหน้าที่ราชการอาจจะเกิดนอกเวลาราชการ ก็ได้ เช่น ขับรถขณะเดินทางกลับจากการไปราชการนอกสถานที่ ซึ่งเป็นเวลาหลัง 16.30 น. แล้วเกิดอุบัติเหตุ อย่างนี้ก็ถือเป็นการปฏิบัติหน้าที่ราชการเหมือนกัน เจ้าหน้าที่ก็จะได้รับความคุ้มครองตาม พ.ร.บ. นี้ ถ้าผู้เสียหายจะฟ้อง ต้องฟ้องหน่วยงาน ไม่ใช่ฟ้องคนขับรถ<br><br>จะฟ้องต่อบุคคล ก็ต่อเมื่อการกระทำนั้น ไม่เกี่ยวข้องกับการปฏิบัติหน้าที่ หรือผลประโยชน์ของราชการ เช่น เจ้าหน้าที่ไปราชการแล้วเกิดบันดาลโทสะ ทำร้ายผู้อื่นให้บาดเจ็บ อย่างนี้ไม่ใช่การปฏิบัติหน้าที่ราชการ เพราะ ราชการไม่มีกฎ ระเบียบให้เจ้าหน้าที่ไปทำร้ายผู้อื่น หรือ ครูขับรถไปตกปลากับเพื่อนแล้วเกิดอุบัติเหตุ อย่างนี้ก็ต้องฟ้องครู เพราะการไปตกปลาไม่เกี่ยวกับหน้าที่ราชการของครู เป็นต้น<br><br><font color='red'><strong>จะฟ้องศาลไหน </strong> </font>: ศาลปกครองหรือศาลยุติธรรม<br><br><strong>กรณีฟ้องต่อศาลปกครอง</strong><br><br><ol><li>เป็นกรณีละเมิดที่เกิดจากการที่เจ้าหน้าที่รัฐ ใช้อำนาจตามกฎหมาย ซึ่งในที่นี้คือ &quot;ปฏิบัติการทางปกครอง&quot; เช่น การที่ตำรวจจราจรใช้อำนาจตามกฎหมาย ล็อคล้อรถยนต์ หรือกรณีที่เจ้าพนักงานท้องถิ่นทำการรื้อถอนอาคารที่สร้างโดยผิดกฎหมาย เป็นต้น<br><br><font color='red'><strong>แต่ถ้า</strong></font>เป็นการกระทำละเมิดของเจ้าหน้าที่ในการปฏิบัติหน้าที่ตามปกติทั่วไป ที่มิได้เกิดจากการใช้อำนาจตามกฎหมาย ก็ไม่อยู่ในอำนาจของศาลปกครอง เช่น<br>&emsp;- การกระทำ ละเมิดของเจ้าหน้าที่ที่เกิดจากการขับรถยนต์ในการปฏิบัติหน้าที่โดยประมาท ซึ่งเป็นการกระทำละเมิดใน<strong>การปฏิบัติหน้าที่ตามปกติทั่วไป</strong> มิใช่เป็นการใช้อำนาจตามกฎหมาย จึงไม่อยู่ในอำนาจของศาลปกครองแต่อยู่ในอำนาจของศาลยุติธรรม<br>&emsp; - การที่แพทย์โรงพยาบาลของรัฐตรวจรักษาผู้ป่วยไม่ถูกต้อง ทำให้อาการป่วยของผู้ป่วยทรุดหนักลง ซึ่งเป็นการปฏิบัติหน้าที่โดยใช้วิชาความรู้ทางการแพทย์ไม่ถูกต้อง มิใช่เป็นการใช้อำนาจตามกฎหมายจึงไม่อยู่ในอำนาจของศาลปกครอง แต่อยู่ในอำนาจของศาลยุติธรรม<br>อ้างอิง<br>สำนักประชาสัมพันธ์ สำนักงานศาลปกครอง. &quot; ข้อควรรู้ก่อนไปศาลปกครอง&quot;. https://admincourt.go.th/ADMINCOURT/upload/webcms/Oldnews/attach/news_attach/2015/02/kor-01-2558-p13.pdf หน้า 21<br></li><li> เป็นกรณีการละเมิดที่เกิดจากการออกกฎ คำสั่งทางปกครอง หรือคำสั่งอื่น กรณีนี้จะต้องเป็นการออกกฎ คำสั่งทางปกครอง หรือคำสั่งอื่นโดยไม่ชอบด้วยกฎหมาย เช่น ไม่มีกฎหมายให้อำนาจในการออก หรือออกมาโดยไม่ถูกต้องตามที่กฎหมายกำหนด กรณีดังกล่าว หากก่อให้เกิดความเสียกายแก่บุคคลใด ก็เป็นการกระทำละเมิดได้ และผู้เสียหายฟ้องคดีต่อศาลปกครองได้ <br>อ้างจาก https://dmcrth.dmcr.go.th/lag/detail/1196/</li><li>กรณีการละเมิดจากการละเลยหน้าที่ตามที่กฎหมายกำหนดให้ต้องปฏิบัติ หรือปฏิบัติหน้าที่ดังกล่าว ล่าช้าเกินสมควร ทำให้บุคคลอื่นได้รับความเสียหาย<br>อ้างจาก https://dmcrth.dmcr.go.th/lag/detail/1196/</li></ol><strong>กรณีฟ้องต่อศาลยุติธรรม</strong><ol><li>เป็นกรณีการกระทำละเมิดของเจ้าหน้าที่ ซึ่งมิใช่การกระทำในการปฏิบัติหน้าที่ หรือ ที่ถือได้ว่า เป็นการกระทำละเมิดในทางส่วนตัวของเจ้าหน้าที่ผู้นั้นเอง ในกรณีนี้ เจ้าหน้าที่ต้องรับผิดเป็นการส่วนตัว หน่วยงานของรัฐไม่ต้องรับผิดการละเมิดที่เกิดขึ้นนั้น<br>ตัวอย่าง<br>กรณีเจ้าหน้าที่ ใช้กำลังทำร้ายร่างกายผู้อื่นโดยเหตุส่วนตัว ย่อมเป็นกรณีที่เจ้าหน้าที่ กระทำไปโดยมีมูลเหตุจูงใจส่วนตัวในการทำร้ายร่างกายผู้อื่น มิใช่เป็นการกระทำในการปฏิบัติหน้าที่ ในฐานะเจ้าหน้าที่ของรัฐ กรณีนี้เจ้าหน้าที่ต้องรับผิดเป็นการส่วนตัว</li><li> เป็นการกระทำละเมิดของเจ้าหน้าที่ ในการปฏิบัติหน้าที่ ซึ่งมิได้เกิดจากการใช้อำนาจตามกฎหมายปกครอง กล่าวคือ <strong>เป็นการปฏิบัติหน้าที่โดยปกติทั่วไป</strong> มิได้เป็นการใช้อำนาจเหนือของฝ่ายปกครอง หรือเป็นการปฏิบัติหน้าที่ซึ่งมิได้เกิดจากการออกกฎ คำสั่งทางปกครอง หรือ คำสั่งอื่น หรือ การละเมิดนั้น มิได้เกิดจากการละเลยต่อหน้าที่ หรือปฏิบัติหน้าที่ตามกฎหมาย ล่าช้าเกินสมควร<br><br>ตัวอย่าง<br>กรณีผู้ป่วยฟ้องแพทย์ผู้ผ่าตัดเนื้องอก แต่ปรากฎว่าเนื้องอกที่แพทย์สันนิษฐานนั้น เป็นทารกอันเกิดจากการตั้งครรภ์ธรรมชาติของผู้ฟ้องคดี การผ่าตัดดังกล่าว ทำให้ผู้ฟ้องคดีเกิดความทุกข์ทรมาน ไม่สามารถทำงานได้ ไม่มีรายได้เลี้ยงชีพ <br>กรณีนี้ ศาลปกครองสูงสุดวินิจฉัยว่า ผู้ถูกฟ้องมิได้ใช้อำนาจตามกฎหมายกระทำต่อผู้ฟ้องคดี แต่เป็นความรับผิดทางละเมิดของหน่วยงานทางปกครอง อันเกิดจากการกระทำ<strong>ในการปฏิบัติหน้าที่ธรรมดาทั่วไปของเจ้าหน้าที่ของรัฐ</strong> ซึ่งอยู่ในอำนาจพิจารณาพิพากษาของ ศาลยุติธรรม<br>(คำวินิจฉัยศาลปกครองสูงสุดที่ อ.๒๒๔/๒๕๕๐)<br></li></ol>"},

{id:"25660219_RN9382_02_law_LAW_06", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใด <u>ไม่ใช่</u>การแบ่งส่วนราชการตาม พ.ร.บ.ระเบียบบริหารราชการแผ่นดิน พ.ศ. 2534?<hr>1) จังหวัด เป็นการแบ่งส่วนราชการส่วนภูมิภาค    <br>2) กรุงเทพมหานครเป็นการแบ่งส่วนราชการส่วนท้องถิ่น     <br>3) สำนักงานรัฐมนตรี เป็นการแบ่งส่วนราชการภายใน สำนักนายกรัฐมนตรี   <br>4) สำนักนายกรัฐมนตรี มีฐานะเป็นกระทรวง   <br>",
 answer:  "3) สำนักงานรัฐมนตรี เป็นการแบ่งส่วนราชการภายใน สำนักนายกรัฐมนตรี  <br><br>สำนักงานรัฐมนตรี มีทุกกระทรวง ไม่ใช่เฉพาะ สำนักนายกรัฐมนตรี เท่านั้น<br><br> พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๗ ให้จัดระเบียบบริหารราชการส่วนกลาง ดังนี้ </p><p class='act-paragraph'>(๑) สำนักนายกรัฐมนตรี </p><p class='act-paragraph'>(๒) กระทรวง หรือทบวงซึ่งมีฐานะเทียบเท่ากระทรวง </p><p class='act-paragraph'>(๓) ทบวง ซึ่งสังกัดสำนักนายกรัฐมนตรีหรือกระทรวง</p><p class='act-paragraph'>(๔) กรม หรือส่วนราชการที่เรียกชื่ออย่างอื่นและมีฐานะเป็นกรม ซึ่งสังกัดหรือไม่สังกัดสำนัก นายกรัฐมนตรี กระทรวงหรือทบวง</p><p class='act-paragraph'><strong>สำนักนายกรัฐมนตรีมีฐานะเป็นกระทรวง</strong></p><p class='act-paragraph'>ส่วนราชการตาม (๑) (๒) (๓) และ (๔) มีฐานะเป็นนิติบุคคล</p><br><p class='act-paragraph'>มาตรา ๑๘ ให้จัดระเบียบราชการของกระทรวง ดังนี้ </p><p class='act-paragraph'>(๑) <strong>สำนักงานรัฐมนตรี</strong> </p><p class='act-paragraph'>(๒) สำนักงานปลัดกระทรวง</p><p class='act-paragraph'>(๓) กรม หรือส่วนราชการที่เรียกชื่ออย่างอื่น เว้นแต่บางกระทรวงเห็นว่าไม่มีความจำเป็นจะไม่แยกส่วน ราชการตั้งฃึ้นเป็นกรมก็ได้ </p><p class='act-paragraph'>ให้ส่วนราชการตาม (๒) และส่วนราชการที่เรียกชื่ออย่างอื่นตาม (๓) มีฐานะเป็นกรม </p>...<p class='act-paragraph'>มาตรา ๕๑ ให้จัดระเบียบบริหารราชการส่วนภูมิภาค ดังนี้ </p><p class='act-paragraph'>(๑) <strong>จังหวัด</strong> </p><p class='act-paragraph'>(๒) อำเภอ</p>...<p class='act-paragraph'>มาตรา ๗๐ ให้จัดระเบียบบริหารราชการส่วนท้องถิ่น ดังนี้ </p><p class='act-paragraph'>(๑) องค์การบริหารส่วนจังหวัด</p> <p class='act-paragraph'>(๒) เทศบาล</p> <p class='act-paragraph'>(๓) สุขาภิบาล</p><p class='act-paragraph'>(๔) <strong>ราชการส่วนท้องถิ่นอื่นตามที่มีกฎหมายกำหนด</strong></p><br><strong>กรุงเทพมหานคร</strong> คือ ราชการส่วนท้องถิ่น ตามพระราชบัญญัติระเบียบบริหารราชการกรุงเทพมหานคร พ.ศ. ๒๕๒๘ เกิดตาม มาตรา ๗๐(๔) แห่ง พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br>"},

{id:"25660219_RN9382_02_law_LAW_05", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใด <u>กล่าวไม่ถูกต้อง</u> เกี่ยวกับหน้าที่ของ ปลัดสำนักนายกรัฐมนตรี ?<hr>1) กำหนดแนวทางและแผนการปฏิบัติราชการ ของสำนักนายกรัฐมนตรี     <br>2) ลำดับความสำคัญ ของแผนการปฏิบัติราชการประจำปี ของส่วนราชการใน สำนักนายกรัฐมนตรี     <br>3) เป็นผู้บังคับบัญชาข้าราชการ ของส่วนราชการในสำนักนายกรัฐมนตรี   <br>4) กำกับ เร่งรัด ติดตามและประเมินผลการ ปฏิบัติราชการ ของส่วนราชการในสำนักนายกรัฐมนตรี    <br>",
 answer:  "3) เป็นผู้บังคับบัญชาข้าราชการ ของส่วนราชการในสำนักนายกรัฐมนตรี   <br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๑๖ สำนักนายกรัฐมนตรี นอกจากมีนายกรัฐมนตรี รองนายกรัฐมนตรีและรัฐมนตรีประจำ สำนักนายกรัฐมนตรี ให้มีปลัดสำนักนายกรัฐมนตรีคนหนึ่งมีอำนาจหน้าที่ดังนี้</p><p class='act-paragraph'>(๑) รับผิดชอบควบคุมราชการประจำในสำนักนายกรัฐมนตรี กำหนดแนวทางและแผนการปฏิบัติราชการ ของสำนักนายกรัฐมนตรี และลำดับความสำคัญ ของแผนการปฏิบัติราชการประจำปี ของส่วนราชการใน สำนักนายกรัฐมนตรี ให้เป็นไปตามนโยบายที่ นายกรัฐมนตรีกำหนด รวมทั้งกำกับ เร่งรัด ติดตามและประเมินผลการ ปฏิบัติราชการ ของส่วนราชการในสำนักนายกรัฐมนตรี </p><p class='act-paragraph'>(๒) <strong>เป็นผู้บังคับบัญชาข้าราชการ ของส่วนราชการในสำนักนายกรัฐมนตรี รองจากนายกรัฐมนตรี รองนายกรัฐมนตรี และรัฐมนตรีประจำสำนักนายกรัฐมนตรี ยกเว้นข้าราชการของส่วนราชการ ซึ่งหัวหน้าส่วนราชการ ขึ้นตรงต่อนายกรัฐมนตรี </strong></p><p class='act-paragraph'>(๓) เป็นผู้บังคับบัญชาข้าราชการ ในสำนักงานปลัดสำนักนายกรัฐมนตรี และรับผิดชอบในการปฏิบัติ ราชการ ของสำนักงานปลัดสำนักนายกรัฐมนตรี </p><br>"},

{id:"25660219_RN9382_02_law_LAW_04", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใด<u>ไม่ใช่หลักการ</u>เกี่ยวกับการจัดซื้อหรือจัดจ้าง ของส่วนราชการ?<hr>1)  เปิดเผยและเที่ยงธรรม   <br>2)  รวดเร็ว มีคุณภาพ และการใช้ประโยชน์ยาวนาน    <br>3) หากมีเหตุที่ต้องคำนึงถึงการดูแลรักษา การจัดซื้อหรือจัดจ้างกระทำโดยไม่ต้องถือราคาต่ำสุดก็ได้    <br>4) ให้พิจารณาถึงประโยชน์และผลเสียทางสังคม   <br>",
 answer:  "2)  รวดเร็ว คุณภาพ และการใช้ประโยชน์ยาวนาน<br><br>ความรวดเร็ว ไม่อยู่ในหลักการที่กำหนด<br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><p class='act-paragraph'>มาตรา ๒๓ ในการจัดซื้อหรือจัดจ้าง ให้ส่วนราชการดำเนินการ โดย<strong>เปิดเผยและเที่ยงธรรม</strong> โดยพิจารณาถึง<strong>ประโยชน์ และผลเสียทางสังคม </strong>ภาระต่อประชาชน คุณภาพ วัตถุประสงค์ที่จะใช้ ราคา และประโยชน์ระยะยาว ของส่วนราชการที่จะได้รับประกอบกัน<p class='act-paragraph'>ในกรณีที่วัตถุประสงค์ในการใช้ เป็นเหตุให้ต้องคำนึงถึงคุณภาพ และการดูแลรักษาเป็นสำคัญ ให้สามารถกระทำได้ โดย<strong>ไม่ต้องถือราคาตํ่าสุด</strong>ในการเสนอซื้อ หรือจ้างเสมอไป<br>"},

{id:"25660219_RN..._02_law_LAW_03", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>บุคคลใด เป็นผู้รักษาราชการแทน ในกรณีที่ผู้ว่าราชการจังหวัดไม่สามารถปฏิบัติราชการได้ ?<hr>1) รัฐมนตรีว่าการกระทรวงมหาดไทย แต่งตั้งอธิบดีคนหนึ่งปฏิบัติราชการแทน     <br>2) รองผู้ว่าราชการจังหวัด    <br>3) นายอำเภอที่มีอาวุโสสูงสุด   <br>4) หัวหน้าส่วนจังหวัด ที่มีอาวุโสสูงสุด โดยความเห็นชอบของ คณะกรมการจังหวัด  <br>",
 answer:  "2) รองผู้ว่าราชการจังหวัด <br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๕๖ ในกรณีที่ไม่มีผู้ดำรงตำแหน่งผู้ว่าราชการจังหวัด หรือมี แต่ไม่อาจปฏิบัติราชการได้ให้ <strong>รองผู้ว่าราชการจังหวัด เป็นผู้รักษาราชการแทน </strong>ถ้าไม่มีผู้ดำรงตำแหน่งรองผู้ว่าราชการจังหวัด หรือมีแต่ไม่อาจปฏิบัติ ราชการได้ ให้ผู้ช่วยผู้ว่าราชการจังหวัด เป็นผู้รักษาราชการแทน ถ้าไม่มีผู้ดำรงตำแหน่งผู้ช่วยผู้ว่าราชการจังหวัด หรือมีแต่ไม่อาจปฏิบัติราชการได้ ให้ปลัดจังหวัดเป็นผู้รักษาราชการแทน ถ้ามีรองผู้ว่าราชการจังหวัด ผู้ช่วยผู้ว่าราชการจังหวัด หรือปลัดจังหวัดหลายคน ให้ปลัดกระทรวงแต่งตั้งรองผู้ว่าราชการจังหวัด ผู้ช่วยผู้ว่าราชการ จังหวัด หรือปลัดจังหวัดคนใดคนหนึ่ง แล้วแต่กรณี เป็นผู้รักษาราชการแทน ถ้าไม่มีทั้งผู้ดำรงตำแหน่งรองผู้ว่าราชการจังหวัด ผู้ช่วยผู้ว่าราชการจังหวัด และปลัดจังหวัด หรือมีแต่ไม่อาจปฏิบัติราชการได้ ให้หัวหน้าส่วน ราชการประจำจังหวัด ซึ่งมีอาวุโสตามระเบียบแบบแผน ของทางราชการเป็นผู้รักษาราชการแทน</p><br>"},

{id:"25660219_RN1357_02_law_LAW_02", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>บุคคลตามข้อใด อาจเป็นคู่กรณีในการพิจารณาทางปกครองได้ หากสิทธิของตนถูกกระทบกระเทือน?<hr>1) บุคคลธรรมดา    <br>2) คณะบุคคล    <br>3) นิติบุคคล   <br>4) ถูกทุกข้อ   <br>",
 answer:  "4) ถูกทุกข้อ <br><br>พ.ร.บ.วิธีปฏิบัติราชการทางปกครอง<br><br><p class='act-paragraph'>มาตรา ๒๑ <strong>บุคคลธรรมดา คณะบุคคล หรือนิติบุคคล</strong> อาจเป็นคู่กรณีในการพิจารณา ทางปกครองได้ตามขอบเขตที่สิทธิของตนถูกกระทบกระเทือน หรืออาจถูกกระทบกระเทือน โดยมิอาจหลีกเลี่ยงได้ "},

{id:"25660219_RN1782_02_law_LAW_01", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>หน่วยงานตามข้อใด <u>ไม่ใช่</u>ส่วนราชการตาม พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี พ.ศ. 2546?<hr>1) สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน    <br>2) สำนักงานคณะกรรมการคุ้มครองผู้บริโภค    <br>3) สำนักงานคณะกรรมการการเลือกตั้ง   <br>4) องค์การบริหารส่วนจังหวัดสงขลา   <br>",
 answer:  "4) องค์การบริหารส่วนจังหวัดสงขลา<br><br><ul><li>สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน สังกัดกระทรวงศึกษาธิการ<li>สำนักงานคณะกรรมการคุ้มครองผู้บริโภค เป็นหน่วยงานในสังกัด สำนักนายกรัฐมนตรี </li><li>สำนักงานคณะกรรมการการเลือกตั้ง เป็นหน่วยงานของรัฐ มีฐานะเป็นนิติบุคคล</li><li>องค์การบริหารส่วนจังหวัดสงขลา เป็นองค์ปกครองส่วนท้องถิ่น ไม่อยู่ในบังคับของ พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี </li></ul>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><p class='act-paragraph'>มาตรา ๔ ในพระราชกฤษฎีกานี้ <p class='act-paragraph'>&quot;ส่วนราชการ&quot; หมายความว่า ส่วนราชการตามกฎหมายว่าด้วยการปรับปรุง กระทรวง ทบวง กรม และหน่วยงานอื่นของรัฐ ที่อยู่ในกำกับของราชการฝ่ายบริหาร <strong>แต่ไม่รวมถึงองค์กรปกครองส่วนท้องถิ่น</strong><p class='act-paragraph'>&quot;รัฐวิสาหกิจ&quot; หมายความว่า รัฐวิสาหกิจที่จัดตั้งขั้นโดยพระราชบัญญัติหรือพระราชกฤษฎีกา <p class='act-paragraph'>&quot;ข้าราชการ&quot; หมายความรวมถึงพนักงาน ลูกจ้าง หรือผู้ปฏิบัติงานในส่วนราชการ "},

{id:"25660702_RN1782_02_law_LAW_61", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>&quot;การสํารวจความคิดเห็นของประชาชนเพื่อปรับปรุงวิธีปฏิบัติราชการ&quot;  อยู่ในเป้าหมายใด ตาม พ.ร.ฎ.?<hr>1) มีการปรับปรุงภารกิจของส่วนราชการ ให้ทันต่อสถานการณ์    <br>2)  มีการประเมินผลการปฏิบัติราชการ อย่างสม่ำเสมอ    <br>3) การบริหารราชการ เพื่อประโยชน์สุขของประชาชน    <br>4) มีประสิทธิภาพ และเกิดความคุ้มค่า ในเชิงภารกิจของรัฐ   <br>",
 answer:  "3) การบริหารราชการ เพื่อประโยชน์สุขของประชาชน <br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><p class='act-paragraph'>มาตรา ๗ การบริหารราชการ เพื่อประโยชน์สุขของประชาชน หมายถึง การปฏิบัติราชการ ที่มีเป้าหมายเพื่อให้เกิดความผาสุก และความเป็นอยู่ที่ดีของประชาชน ความสงบและปลอดภัยของ สังคมส่วนรวม ตลอดจนประโยชน์สูงสุดของประเทศมาตรา ๘ ในการบริหารราชการเพื่อประโยชน์สุขของประชาชน ส่วนราชการจะต้องดำเนินการ โดยถือว่าประชาชนเป็นศูนย์กลางที่จะได้รับการบริการจากรัฐ และจะต้องมีแนวทางการบริหารราชการ ดังต่อไปนี้ <p class='act-paragraph'>(๑) การกำหนดภารกิจของรัฐ และส่วนราชการต้องเป็นไปเพื่อวัตถุประสงค์ตามมาตรา ๗ และสอดคล้องกับแนวนโยบายแห่งรัฐ และนโยบายของคณะรัฐมนตรี ที่แถลงต่อรัฐสภา<p class='act-paragraph'>(๒) การปฏิบัติภารกิจของส่วนราชการ ต้องเป็นไปโดยซื่อสัตย์สุจริต สามารถตรวจสอบได้ และมุ่งให้เกิดประโยชน์สุขแก่ประชาชนทั้งในระด้บประเทศ และท้องถิ่น<p class='act-paragraph'>(๓) ก่อนเริ่มดำเนินการ ส่วนราชการต้องจัดให้มีการศึกษา วิเคราะห์ผลดีและผลเสียให้ครบถ้วน ทุกด้าน กำหนดขั้นตอนการดำเนินการที่โปร่งใส มีกลไกตรวจสอบการดำเนินการ ในแต่ละขั้นตอน ในกรณีที่ภารกิจใดจะมีผลกระทบต่อประชาชน ส่วนราชการต้องดำเนินการรับฟังความคิดเห็นของ ประชาชน หรือชี้แจงทำความเข้าใจ เพื่อให้ประชาชนได้ตระหนักถึงประโยชน์ ที่ส่วนรวมจะได้รับจากภารกิจนั้น<p class='act-paragraph'>(๔) ให้เป็นหน้าที่ของข้าราชการ ที่จะต้อง<strong>คอยรับฟังความคิดเห็น และความพึงพอใจของสังคม</strong> โดยรวม และประชาชนผู้รับบริการ เพื่อปรับปรุง หรือเสนอแนะต่อผู้บังคับบัญชา <strong>เพื่อให้มีการปรับปรุง วิธีปฏิบัติราชการ</strong>ให้เหมาะสม<p class='act-paragraph'>(๕) ในกรณีที่เกิดปัญหาและอุปสรรค จากการดำเนินการ ให้ส่วนราชการดำเนินการแก้ไข ปัญหาและอุปสรรคนั้นโดยเร็ว ในกรณีที่ปัญหาหรืออุปสรรคนั้น เกิดขึ้นจากส่วนราชการอื่น หรือระเบียบ ข้อบังคับที่ออกโดยส่วนราชการอื่น ให้ส่วนราชการ แจ้งให้ส่วนราชการที่เกี่ยวข้องทราบ เพื่อดำเนินการแก้ไข ปรับปรุงโดยเร็วต่อไป และให้แจ้ง ก.พ.ร. ทราบด้วย<p class='act-paragraph'>การดำเนินการตามวรรคหนึ่ง ให้ส่วนราชการ กำหนดวิธีปฏิบัติให้เหมาะสมกับภารกิจแต่ละเรื่อง ทั้งนี้ ก.พ.ร. จะกำหนดแนวทางการดำเนินการทั่วไป ให้ส่วนราชการปฏิบัติ ให้เป็นไปตามมาตรานี้ด้วย ก็ได้<br><br>"},

{id:"25660702_RN7662_02_law_LAW_60", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> ข้อใดกล่าว<u>ไม่ถูกต้อง</u>เกี่ยวกับจังหวัด?<hr>1) จังหวัดมีฐานะเป็นนิติบุคคล    <br>2) คณะกรรมการจังหวัด ทำหน้าที่เป็นที่ปรึกษาของผู้ว่าราชการจังหวัด    <br>3) การเปลี่ยนแปลงเขตจังหวัด ตราเป็นพระราชกฤษฎีกา   <br>4) แผนพัฒนาท้องถิ่น ขององค์กรปกครองส่วนท้องถิ่น ต้องสอดคล้องกับแผนพัฒนาจังหวัด   <br>",
 answer:  "2) คณะกรรมการจังหวัด ทำหน้าที่เป็นที่ปรึกษาของผู้ว่าราชการจังหวัด <br><br>ที่ถูกคือ คณะ<u>กรมการ</u>จังหวัด<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๕๒ ให้รวมท้องที่หลาย ๆ อำเภอตั้งขึ้นเป็น<strong>จังหวัดมีฐานะเป็นนิติบุคคล</strong></p> <p class='act-paragraph'><strong>การตั้ง ยุบ และเปลี่ยนแปลงเขตจังหวัด ให้ตราเป็นพระราชบัญญัติ</strong> </p><p class='act-paragraph'>เพื่อประโยชน์ในการบริหารงานแบบบูรณาการในจังหวัด หรือกลุ่มจังหวัด ให้จังหวัดหรือกลุ่มจังหวัดยื่น คำขอจัดตั้งงบประมาณได้ ทั้งนี้ ตามหลักเกณฑ์ วิธีการ และเงื่อนไขที่กำหนดในพระราชกฤษฎีกา ในกรณีนี้ ให้ถือว่า จังหวัดหรือกลุ่มจังหวัด เป็นส่วนราชการ ตามกฎหมายว่าด้วยวิธีการงบประมาณ </p><br><p class='act-paragraph'>มาตรา ๕๓ ในจังหวัดหนึ่งให้มี<strong>คณะกรมการจังหวัด ทำหน้าที่เป็นที่ปรึกษาของผู้ว่าราชการจังหวัด</strong>ในการบริหารราชการแผ่นดินในจังหวัดนั้น กับปฏิบัติหน้าที่อื่น ตามที่กฎหมายหรือมติของคณะรัฐมนตรีกำหนด</p><p class='act-paragraph'><strong>คณะกรมการจังหวัด</strong>ประกอบด้วย ผู้ว่าราชการจังหวัดเป็นประธาน รองผู้ว่าราชการจังหวัดหนึ่งคน ตามที่ผู้ว่าราชการจังหวัดมอบหมาย ปลัดจังหวัด อัยการจังหวัดซึ่งเป็นหัวหน้าที่ทำการอัยการจังหวัด ผู้บังคับการตำรวจภูธรจังหวัด และหัวหน้าส่วนราชการประจำจังหวัด จากกระทรวงและทบวงต่าง ๆ เว้นแต่ กระทรวงมหาดไทย ซึ่งประจำอยู่ในจังหวัด กระทรวง หรือทบวงละหนึ่งคน เป็นกรมการจังหวัด และหัวหน้า สำนักงานจังหวัดเป็นกรมการจังหวัดและเลขานุการ</p><p class='act-paragraph'>มาตรา ๕๓/๑ ให้จังหวัดจัดทำแผนพัฒนาจังหวัด ให้สอดคล้องกับแนวทางการพัฒนาเศรษฐกิจและ สังคมในระดับชาติ และความต้องการของประชาชน ในห้องถิ่น ในจังหวัด</p><p class='act-paragraph'>ในการจัดทำแผนพัฒนาจังหวัดตามวรรคหนึ่ง ให้ผู้ว่าราชการจังหวัด จัดให้มีการประชุมปรึกษาหารือ ร่วมกันระหว่างหัวหน้าส่วนราชการ ที่มีสถานที่ตั้งทำการอยู่ในจังหวัด ไม่ว่าจะเป็นราชการบริหารส่วนภูมิภาคหรือ ราชการบริหารส่วนกลาง และผู้บริหารองค์กรปกครองส่วนท้องถิ่นทั้งหมด ในจังหวัด รวมทั้งผู้แทนภาคประชาสังคม และผู้แทนภาคธุรกิจเอกชน</p><br><p class='act-paragraph'>การจัดทำแผนพัฒนาจังหวัดตามวรรคหนึ่ง จำนวนและวิธีการสรรหาผู้แทนภาคประชาสังคม และผู้แทน ภาคธุรกิจเอกชนตามวรรคสอง ให้เป็นไปตามหลักเกณฑ์ และวิธีการที่กำหนดในพระราซกฤษฎีกา</p><p class='act-paragraph'>เมื่อประกาศใซ้แผนพัฒนาจังหวัดแล้ว การจัดทำ<strong>แผนพัฒนาท้องถิ่น ขององค์กรปกครองส่วนท้องถิ่น</strong> และการดำเนินกิจการของส่วนราชการ และหน่วยงานอื่นของรัฐทั้งปวงที่กระทำในพื้นที่จังหวัด<strong>ต้องสอดคล้องกับแผนพัฒนาจังหวัด</strong>ดังกล่าว</p><br>"},
];

var remaining_dat = [{id:"25660702_RN7662_02_law_LAW_59", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใดกล่าว<u>ไม่ถูกต้อง</u>เกี่ยวกับ &quot;ศูนย์บริการร่วม&quot;?<hr>1) การยื่นคำร้อง หรือคำขอ ต่อศูนย์บริการร่วม  ให้ถือว่าเป็นการยื่นต่อส่วนราชการ ที่เกี่ยวข้องทั้งหมด    <br>2) ศูนย์บริการร่วม อาจจะตั้งอยู่ ณ ศาลากลางจังหวัด หรือ ที่ว่าการอำเภอ หรือสถานที่อื่นตามที่เห็นสมควร ก็ได้ แต่ต้องประกาศให้ประชาชนทราบ    <br>3) ศูนย์บริการร่วม ต้องจัดพิมพ์รายละเอียด เอกสารหลักฐาน แบบฟอร์ม ที่ประชาชนจะต้องจัดหามา ในการขออนุมัติหรือขออนุญาต ในแต่ละเรื่อง <br>4) ให้เป็นหน้าที่ของปลัดกระทรวง ที่จะต้องจัดให้ส่วนราชการภายในกระทรวง ที่รับผิดชอบ ปฏิบัติงานเกี่ยวกับการบริการประชาชน ร่วมกันจัดตั้งศูนย์บริการร่วม   <br>",
 answer:  "3) ศูนย์บริการร่วม ต้องจัดพิมพ์รายละเอียด เอกสารหลักฐาน ตลอดจนแบบฟอร์มต่าง ๆ  ที่ประชาชนจะต้องจัดหามา ในการขออนุมัติหรือขออนุญาต ในแต่ละเรื่อง <br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><p class='act-paragraph'>มาตรา ๓๐ ในกระทรวงหนึ่ง ให้เป็นหน้าที่ของปลัดกระทรวง ที่จะต้องจัดให้ส่วนราชการภายในกระทรวง ที่รับผิดชอบ ปฏิบัติงานเกี่ยวกับการบริการประชาชน ร่วมกันจัดตั้งศูนย์บริการร่วม เพื่ออำนวยความ สะดวกแก่ประชาชน ในการที่จะต้องปฏิบัติตามกฎหมาย หรือกฎอื่นใด ทั้งนี้ เพื่อให้ประชาชนสามารถติดต่อ สอบถาม ขอทราบข้อมูล ขออนุญาต หรือขออนุมัติในเรื่องใด ๆ ที่เป็นอำนาจหน้าที่ของส่วนราชการ ในกระทรวงเดียวกัน โดยติดต่อเจ้าหน้าที่ ณ ศูนย์บริการร่วมเพียงแห่งเดียว<br><br><p class='act-paragraph'>มาตรา ๓๑ ในศูนย์บริการร่วมตามมาตรา ๓๐ ให้จัดให้มีเจ้าหน้าที่ รับเรื่องราวต่างๆ และ ดำเนินการส่งต่อให้เจ้าหน้าที่ของส่วนราชการที่เกี่ยวข้อง เพื่อดำเนินการต่อไป โดยให้มีข้อมูลและเอกสาร ที่เกี่ยวข้องกับอำนาจหน้าที่ของทุกส่วนราชการในกระทรวง รวมทั้งแบบคำขอต่าง ๆ ไว้ให้พร้อมที่จะบริการประชาชนได้ ณ ศูนย์บริการร่วม<p class='act-paragraph'><strong>ให้เป็นหน้าที่ส่วนราชการที่เกี่ยวข้อง ที่จะต้องจัดพิมพ์รายละเอียด ของเอกสารหลักฐาน ที่ประชาชน จะต้องจัดหามา ในการขออนุมัติหรือขออนุญาต ในแต่ละเรื่อง มอบให้แก่เจ้าหน้าที่ของศูนย์บริการร่วม</strong> และให้เป็นหน้าที่ของเจ้าหน้าที่ศูนย์บริการร่วม ที่จะต้องแจ้งให้ประชาชนที่มาติดต่อ ได้ทราบในครั้งแรกที่มาติดต่อ และตรวจสอบว่า เอกสารหลักฐานที่จำเป็นดังกล่าวนั้น ประชาชนได้ยื่นมาครบถ้วนหรือไม่ พร้อมทั้งแจ้ง ให้ทราบถึงระยะเวลา ที่จะต้องใช้ดำเนินการ ในเรื่องนั้น<p class='act-paragraph'>ในการยื่นคำร้อง หรือคำขอ ต่อศูนย์บริการร่วม ตามมาตรา ๓๐ ให้ถือว่าเป็นการยื่นต่อส่วนราชการ ที่เกี่ยวข้องทั้งหมด ตามที่ระบุไว้ในกฎหมายหรือกฎแล้ว<p class='act-paragraph'>ในการดำเนินการตามวรรคหนึ่ง หากมีปัญหาหรืออุปสรรค ในการปฏิบัติราชการ ให้เป็นไปตาม หลักเกณฑ์และวิธีการที่กำหนดในกฎหมาย หรือกฎในเรื่องใด ให้ส่วนราชการที่เกี่ยวข้อง แจ้งให้ ก.พ.ร. ทราบ เพื่อดำเนินการเสนอคณะรัฐมนตรี ให้มีการปรับปรุงหลักเกณฑ์ และวิธีการตามกฎหมาย หรือกฎนั้นต่อไป<br><br><p class='act-paragraph'>มาตรา ๓๒ ให้ผู้ว่าราชการจังหวัด นายอำเภอ และปลัดอำเภอ ผู้เป็นหัวหน้าประจำกิ่งอำเภอ จัดให้ส่วนราชการ ที่รับผิดชอบ ดำเนินการเกี่ยวกับการบริการประชาชน ในเรื่องเดียวกัน หรือต่อเนื่องกันในจังหวัด อำเภอ หรือกิ่งอำเภอนั้น ร่วมกันจัดตั้งศูนย์บริการร่วมไว้ ณ ศาลากลางจังหวัด ที่ว่าการอำเภอ หรือที่ว่าการกิ่งอำเภอ หรือสถานที่อื่นตามที่เห็นสมควร โดยประกาศให้ประชาชนทราบ และให้นำความในมาตรา ๓๐ และมาตรา ๓๑ มาใช้บังคับด้วย โดยอนุโลม<br><br>"},

{id:"25660702_RN7662_02_law_LAW_58", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใด<u>ไม่ใช่</u> &quot;องค์กรกลางบริหารงานบุคคล&quot;?<hr>1) คณะกรรมการข้าราชการพลเรือน    <br>2) คณะกรรมการข้าราชการครูและบุคลากรทางการศึกษา    <br>3) คณะกรรมการมาตรฐานการบริหารงานบุคคลส่วนท้องถิ่น   <br>4) คณะกรรมการพัฒนาและส่งเสริมองค์การมหาชน   <br>",
 answer:  "4) คณะกรรมการพัฒนาและส่งเสริมองค์การมหาชน <br><br>พ.ร.บ.มาตรฐานทางจริยธรรม<br><br><p>มาตรา ๓ ในพระราชบัญญัตินี้<p>“หน่วยงานของรัฐ” หมายความว่า กระทรวง ทบวง กรม ส่วนราชการที่เรียกชื่ออย่างอื่นและมีฐานะเป็นกรม ราชการส่วนท้องถิ่น รัฐวิสาหกิจ องค์การมหาชน หรือหน่วยงานอื่นของรัฐในฝ่ายบริหาร แต่ไม่หมายความรวมถึง หน่วยงานธุรการของรัฐสภา องค์กรอิสระ ศาล และองค์กรอัยการ<p>“เจ้าหน้าที่ของรัฐ” หมายความว่า ข้าราชการ พนักงาน ลูกจ้าง หรือผู้ปฏิบัติงานอื่นในหน่วยงานของรัฐ<p>“องค์กรกลางบริหารงานบุคคล” หมายความว่า <strong>คณะกรรมการข้าราชการพลเรือน</strong> คณะกรรมการข้าราชการพลเรือนในสถาบันอุดมศึกษา <strong>คณะกรรมการข้าราชการครูและบุคลากรทางการศึกษา</strong>และคณะกรรมการข้าราชการตำรวจ ตามกฎหมายว่าด้วยระเบียบข้าราชการประเภทนั้น รวมทั้งคณะกรรมการกลางบริหารงานบุคคลของเจ้าหน้าที่ของรัฐในฝ่ายบริหาร และ<strong>คณะกรรมการมาตรฐานการบริหารงานบุคคลส่วนท้องถิ่น</strong>ตามกฎหมายว่าด้วยระเบียบบริหารงานบุคคลส่วนท้องถิ่น<p>“กรรมการ” หมายความว่า กรรมการมาตรฐานทางจริยธรรม<br><br><p>มาตรา ๖ ให้องค์กรกลางบริหารงานบุคคลของหน่วยงานของรัฐมีหน้าที่จัดทำประมวลจริยธรรมสำหรับเจ้าหน้าที่ของรัฐที่อยู่ในความรับผิดชอบ<p>ในกรณีที่เป็นเจ้าหน้าที่ของรัฐซึ่งไม่มีองค์กรกลางบริหารงานบุคคลที่รับผิดชอบ ให้องค์กรต่อไปนี้เป็นผู้จัดทำประมวลจริยธรรม (<font color='green'>องค์กรต่อไปนี้ ไม่ใช่ &quot;องค์กรกลางบริหารงานบุคคล&quot; เพียงแต่ถูกกำหนดให้เป็นผู้จัดทำประมวลจริยธรรม</font>)<p>(๑) คณะรัฐมนตรี สำหรับข้าราชการการเมือง<p>(๒) สภากลาโหม สำหรับข้าราชการทหารและข้าราชการพลเรือนกลาโหม<p>(๓) สำนักงานคณะกรรมการนโยบายรัฐวิสาหกิจ สำหรับผู้บริหารและพนักงานรัฐวิสาหกิจ<p>(๔) <strong>คณะกรรมการพัฒนาและส่งเสริมองค์การมหาชน</strong> สำหรับผู้บริหาร เจ้าหน้าที่ และผู้ปฏิบัติงานขององค์การมหาชน"},

{id:"25660702_RN3311_02_law_LAW_57", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใด มิใช่เป้าหมายในการบริหารกิจการบ้านเมืองที่ดี ?<hr>1) เกิดผลสัมฤทธิ์ต่อภารกิจของหน่วยงานของรัฐ    <br>2) มีการปรับปรุงภารกิจของส่วนราชการ ให้ทันต่อสถานการณ์     <br>3) มีการประเมินผลการปฏิบัติราชการ อย่างสม่ำเสมอ   <br>4) มีประสิทธิภาพ และเกิดความคุ้มค่า ในเชิงภารกิจของรัฐ   <br>",
 answer:  "1) เกิดผลสัมฤทธิ์ต่อภารกิจของหน่วยงานของรัฐ <br><br>ที่ถูกคือ &quot;เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ&quot;<br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี <br><br><p class='act-paragraph'>มาตรา ๖ การบริหารกิจการบ้านเมืองที่ดี ได้แก่ การบริหารราชการเพื่อบรรลุเป้าหมาย ดังต่อไปนี้<p class='act-paragraph'>(๑) เกิดประโยชน์สุขของประชาชน<p class='act-paragraph'>(๒) เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ<p class='act-paragraph'>(๓) มีประสิทธิภาพ และเกิดความคุ้มค่า ในเชิงภารกิจของรัฐ<p class='act-paragraph'>(๔) ไม่มีขั้นตอนการปฏิบัติงานเกินความจำเป็น<p class='act-paragraph'>(๕) มีการปรับปรุงภารกิจของส่วนราชการ ให้ทันต่อสถานการณ์ <p class='act-paragraph'>(๖) ประชาชนได้รับการอำนวยความสะดวก และได้รับการตอบสนองความต้องการ<p class='act-paragraph'>(๗) มีการประเมินผลการปฏิบัติราชการ อย่างสม่ำเสมอ<br>"},

{id:"25660702_RN7322_02_law_LAW_53", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>พระราชกฤษฎีกาว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี พ.ศ. 2546 เกิดจากกฎหมายตามข้อใด?<hr>1) พ.ร.บ.วิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙    <br>2) พ.ร.บ.ระเบียบบริหารราชการแผ่นดิน พ.ศ. ๒๕๓๔    <br>3) พ.ร.บ.มาตรฐานทางจริยธรรม   <br>4) ถูกทุกข้อ  <br>",
 answer:  "2) พ.ร.บ.ระเบียบ บริหารราชการ แผ่นดิน พ.ศ. ๒๕๓๔ <br><br>พ.ร.ฎ.ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี มีต้นกำเนิดจาก มาตรา ๓/๑ พ.ร.บ. ระเบียบ บริหารราชการ แผ่นดิน ซึ่งบัญญัติไว้ว่า การกำหนดกลไก ในการปฏิบัติราชการ ต้องตราเป็น พระราชกฤษฎีกา<br>"},

{id:"25660702_RN4883_02_law_LAW_52", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใดกล่าวถูกต้องเกี่ยวกับการยื่นอุทธรณ์?<hr>1) การยื่นคําอุทธรณ์ให้ยื่นต่อเจ้าหน้าที่ผู้ทําคําสั่งทางปกครอง ภายใน 15 วัน นับแต่ได้รับแจ้งคําสั่งทางปกครองนั้น    <br>2) เมื่อมีการยื่นคำอุทธรณ์ ให้เจ้าหน้าที่ รายงานการอุทธรณ์พร้อมความเห็นของเจ้าหน้าที่ ไปยังผู้มีอำนาจพิจารณาคำอุทธรณ์ โดยไม่ชักช้า แต่ต้องไม่เกินสามสิบวัน นับแต่วันที่ได้รับอุทธรณ์ <br>3) เมื่อมีการยื่นคำอุทธรณ์ ให้ผู้มีอำนาจพิจารณาคำอุทธรณ์ ทุเลาการบังคับคำสั่งทางปกครองไว้ก่อน   <br>4) ถ้ามีเหตุจำเป็น ผู้มีอำนาจพิจารณาอุทธรณ์ ไม่อาจพิจารณาให้แล้วเสร็จภายในระยะเวลาที่กำหนด สามารถขยาย ระยะเวลาพิจารณาอุทธรณ์ ออกไปได้อีกไม่เกินยี่สิบวัน  <br>",
 answer:  "1) การยื่นคําอุทธรณ์ให้ยื่นต่อเจ้าหน้าที่ผู้ทําคําสั่งทางปกครอง ภายใน 15 วัน นับแต่ได้รับแจ้งคําสั่งทางปกครองนั้น <br><br><ul><li>ข้อ 2 เมื่อได้รับคำอุทธรณ์ เจ้าหน้าที่สามารถพิจารณาได้ด้วยตนเอง ถ้าเห็นชอบกับคำอุทธรณ์ ก็สามารถเปลี่ยนแปลงคำสั่งทางปกครองได้ทันที</li><li>ข้อ 3 ขัดแย้งกับ พ.ร.บ.</li><li>ข้อ 4 ขยายเวลาได้ไม่เกิน 30 วัน</li></ul>พ.ร.บ.วิธีปฏิบัติราชการทางปกครอง<br><br><p class='act-paragraph'>มาตรา ๔๔ ภายใต้บังคับมาตรา ๔๘ ในกรณีที่คำสั่งทางปกครองใด ไม่ได้ออกโดยรัฐมนตรี และไม่มีกฎหมาย กำหนดขั้นตอนอุทธรณ์ ภายในฝ่ายปกครอง ไว้เป็นการเฉพาะ ให้คู่กรณีอุทธรณ์ คำสั่งทางปกครองนั้น โดย<strong>ยื่นต่อเจ้าหน้าที่ ผู้ทำคำสั่งทางปกครองภายในสิบห้าวัน </strong>นับแต่วันที่ตนได้รับแจ้งคำสั่งดังกล่าว<br><p class='act-paragraph'>คำอุทธรณ์ต้องทำเป็นหนังสือ โดยระบุข้อโต้แย้ง และข้อเท็จจริง หรือข้อกฎหมายที่อ้างอิง ประกอบด้วย<p class='act-paragraph'><strong>การอุทธรณ์ไม่เป็นเหตุให้ทุเลาการบังคับตามคำสั่งทางปกครอง</strong>  เว้นแต่จะมีการสั่งให้ทุเลาการบังคับตามมาตรา  ๖๓/๒  วรรคหนึ่ง <br><p class='act-paragraph'>มาตรา ๔๕ <strong>ให้เจ้าหน้าที่ตามมาตรา ๔๔ วรรคหนึ่ง พิจารณาคำอุทธรณ์ และแจ้งผู้อุทธรณ์ โดยไม่ชักช้า แต่ต้องไม่เกินสามสิบวัน นับแต่วันที่ได้รับอุทธรณ์ </strong>ในกรณีที่เห็นด้วยกับคำอุทธรณ์ ไม่ว่าทั้งหมดหรือบางส่วน ก็ให้ดำเนินการเปลี่ยนแปลง คำสั่งทางปกครอง ตามความเห็นของตน ภายในกำหนดเวลาดังกล่าวด้วย<p class='act-paragraph'>ถ้าเจ้าหน้าที่ตามมาตรา ๔๔ วรรคหนึ่ง ไม่เห็นด้วยกับคำอุทธรณ์ ไม่ว่าทั้งหมดหรือบางส่วน ก็ให้เร่งรายงานความเห็น พร้อมเหตุผลไปยัง ผู้มีอำนาจพิจารณาคำอุทธรณ์ ภายในกำหนดเวลาตามวรรคหนึ่ง ให้ผู้มีอำนาจพิจารณาคำอุทธรณ์ พิจารณาให้แล้วเสร็จภายในสามสิบวัน นับแต่วันที่ตน ได้รับรายงาน ถ้ามีเหตุจำเป็น ไม่อาจพิจารณาให้แล้วเสร็จภายในระยะเวลาดังกล่าว ให้ผู้มีอำนาจ พิจารณาอุทธรณ์ มีหนังสือแจ้งให้ผู้อุทธรณ์ทราบ ก่อนครบกำหนดเวลาดังกล่าว <strong>ในการนี้ให้ขยาย ระยะเวลาพิจารณาอุทธรณ์ ออกไปได้ไม่เกินสามสิบวัน </strong>นับแต่วันที่ครบกำหนดเวลาดังกล่าว"},

{id:"25660702_RN9666_02_law_LAW_51", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใดกล่าวถูกต้อง กรณีการใช้มาตรการบังคับทางปกครองแก่บุคคลใด และบุคคลนั้นถึงแก่ความตาย?<hr>1) มาตรการบังคับทางปกครองนั้นถือว่าสิ้นสุดลง    <br>2) ให้ดําเนินการบังคับทางปกครองต่อไปได้ ถ้าบุคคลนั้นมีทายาทผู้รับมรดกให้ถือว่าทายาทผู้นั้นเป็นผู้อยู่ในบังคับของมาตรการบังคับทางปกครองนั้น    <br>3) ให้ทุเลาการบังคับมาตรการทางปกครองไว้ก่อน จนกว่าจะพิสูจน์ได้ว่าบุคคลนั้นไม่มีทายาทผู้จัดการมรดก จึงยกเลิกคําสั่งทางปกครอง   <br>4) ให้แจ้งมาตรการบังคับทางปกครอง ไปยังทายาทผู้รับมรดก หรือผู้จัดการมรดก  แล้วแต่กรณี  โดยยังคงให้ระยะเวลาอุทธรณ์ดำเนินต่อไปอย่างต่อเนื่อง <br>",
 answer:  "2) ให้ดําเนินการบังคับทางปกครองต่อไปได้ ถ้าบุคคลนั้นมีทายาทผู้รับมรดกให้ถือว่าทายาทผู้นั้นเป็นผู้อยู่ในบังคับของมาตรการบังคับทางปกครองนั้น <br><br>พ.ร.บ.วิธีปฏิบัติราชการทางปกครอง<br><br><p class='act-paragraph'>มาตรา ๖๓/๔ ในการใช้มาตรการบังคับทางปกครองแก่บุคคลใด  หากบุคคลนั้นถึงแก่ความตาย ให้ดำเนินการบังคับทางปกครองต่อไปได้  ถ้าบุคคลนั้นมีทายาทผู้รับมรดก หรือผู้จัดการมรดก  ให้ถือว่าทายาทผู้รับมรดก หรือผู้จัดการมรดกเป็นผู้อยู่ในบังคับของมาตรการบังคับทางปกครองนั้น<p class='act-paragraph'>ในกรณีที่ผู้อยู่ในบังคับของมาตรการบังคับทางปกครองตาย  ให้แจ้งมาตรการบังคับทางปกครอง ไปยังทายาทผู้รับมรดก หรือผู้จัดการมรดก  แล้วแต่กรณี  โดยให้ระยะเวลาอุทธรณ์การใช้มาตรการบังคับทางปกครอง เริ่ม นับใหม่ตั้งแต่วันที่ทายาทผู้รับมรดก หรือผู้จัดการมรดกได้รับแจ้ง เมื่อปรากฏว่า<p class='act-paragraph'>(๑) ผู้อยู่ในบังคับของมาตรการบังคับทางปกครองตายก่อนสิ้นสุดระยะเวลาอุทธรณ์การใช้มาตรการบังคับทางปกครอง และไม่ได้ยื่นอุทธรณ์การใช้มาตรการบังคับทางปกครอง<p class='act-paragraph'>(๒) ผู้อยู่ในบังคับของมาตรการบังคับทางปกครองตาย หลังสิ้นสุดระยะเวลาอุทธรณ์การใช้ มาตรการบังคับทางปกครอง และไม่ได้ยื่นอุทธรณ์การใช้มาตรการบังคับทางปกครอง เนื่องจากมีพฤติการณ์ที่จำเป็น อันมิได้เกิดจากความผิดของผู้นั้น<p class='act-paragraph'>ในกรณีที่เป็นการใช้มาตรการบังคับทางปกครองแก่นิติบุคคลใด  หากนิติบุคคลนั้นสิ้นสภาพ  โอนกิจการ  หรือควบรวมกิจการ  ให้ดำเนินการบังคับทางปกครองต่อไปได้ โดยให้แจ้งมาตรการบังคับทางปกครองไปยังผู้ชำระบัญชี หรือนิติบุคคลที่รับโอนกิจการ หรือเกิดจากการควบรวมกิจการ  แล้วแต่กรณี ทั้งนี้  โดยไม่จำต้องออกคำสั่งทางปกครองใหม่ แก่บุคคลหรือนิติบุคคลดังกล่าวอีก  และให้นำหลักเกณฑ์ เรื่องระยะเวลาในการอุทธรณ์ตามวรรคสอง มาใช้บังคับด้วยโดยอนุโลม<br>"},

{id:"25660702_RN9745_02_law_LAW_50", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>การมอบอำนาจให้ปฏิบัติราชการแทน ผู้มอบอํานาจต้องคํานึงถึงสิ่งใด?<hr>1) ความรวดเร็วในการปฏิบัติราชการ    <br>2) ความประหยัด คุ้มค่า    <br>3) ความมีประสิทธิภาพของงาน   <br>4) ปริมาณงานที่เหมาะสม   <br>",
 answer:  "1) ความรวดเร็วในการปฏิบัติราชการ<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๔๐  ในการมอบอำนาจ ให้ผู้มอบอำนาจพิจารณาถึงการอำนวยความสะดวกแก่ประชาชน <strong>ความรวดเร็วในการปฏิบัติราชการ</strong> การกระจายความรับผิดชอบตามสภาพของตำแหน่งของผู้รับมอบอำนาจ และ ผู้รับมอบอำนาจต้องปฏิบัติหน้าที่ที่ได้รับมอบอำนาจตามวัตถุประสงค์ของการมอบอำนาจดังกล่าว</p><p class='act-paragraph'>เมื่อได้มอบอำนาจแล้ว ผู้มอบอำนาจมีหน้าที่กำกับดูแลและติดตามผลการปฏิบัติราชการของผู้รับมอบ อำนาจ และให้มีอำนาจแนะนำหรือแก้ไขการปฏิบัติราชการของผู้รับมอบอำนาจได้ </p><br>"},

{id:"25660702_RN3787_02_law_LAW_45", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใด เป็นการกระทําละเมิดของเจ้าหน้าที่ ซึ่งต้องรับผิดเป็นการเฉพาะตัว?<hr>1) ปลัดอำเภอ ไปราชการตรวจท้องที่ ขณะรับประทานอาหารกลางวันที่ร้านอาหาร เกิดทะเลาะวิวาท ทำร้ายร่างกายผู้อื่นได้รับบาดเจ็บ    <br>2) ลูกจ้างชั่วคราวของ อบต. ตัดหญ้าในสนามหญ้า ตามคําสั่งของผู้บังคับบัญชา และเศษก้อนหินกระเด็นโดนกระจกหน้าต่างของสํานักงานแตก    <br>3) ตํารวจจราจร ปฏิบัติหน้าที่และได้ล็อคล้อรถยนต์ที่จอดบริเวณห้ามจอด ทำให้้ล้อรถยนต์เกิดรอยขูดขีด    <br>4) พนักงานขับรถราชการ ไปราชการต่างจังหวัด ขณะขับรถตามปกติ เกิดอุบัติเหตุ ตัวเองได้รับบาดเจ็บ และรถของทางราชการเสียหาย   <br>",
 answer:  "1) ปลัดอำเภอ ไปราชการตรวจท้องที่ ขณะรับประทานอาหารกลางวันที่ร้านอาหาร เกิดทะเลาะวิวาท ทำร้ายร่างกายผู้อื่นได้รับบาดเจ็บ  <br><br>การทะเลาะวิวาท ทำร้ายร่างกายผู้อื่นได้รับบาดเจ็บ ไม่ใช่การปฏิบัติหน้าที่ราชการ จึงต้องรับผิดเป็นการเฉพาะตัว ถ้าจะฟ้อง ต้องฟ้องที่ศาลยุติธรรม<br><br>พ.ร.บ.ความรับผิดทางละเมิดของเจ้าหน้าที่ <br><br><p class='act-paragraph'>มาตรา ๖ ถ้าการกระทำละเมิดของเจ้าหน้าที่ มิใช่การกระทำในการปฏิบัติหน้าที่ เจ้าหน้าที่ต้องรับผิด ในการนั้นเป็นการเฉพาะตัว ในกรณีนี้ ผู้เสียหายอาจฟ้องเจ้าหน้าที่ได้โดยตรง แต่จะฟ้องหน่วยงานของรัฐไม่ได้ "},

{id:"25660702_RN5464_02_law_LAW_44", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ระเบียบซึ่งออกโดย ค.ร.ม. ที่กำหนดให้เจ้าหน้าที่ ผู้กระทำละเมิด สามารถผ่อนชำระเงิน แก่หน่วยงานของรัฐได้นั้น มีการคํานึงถึงสิ่งใดบ้าง?<hr>1) ฐานะครอบครัว    <br>2) ความรับผิดชอบ   <br>3) พฤติการณ์แห่งกรณี   <br>4) ถูกทุกข้อ   <br>",
 answer:  "4) ถูกทุกข้อ <br><br>พ.ร.บ.ความรับผิดทางละเมิดของเจ้าหน้าที่ <br><br>มาตรา ๑๓ ให้คณะรัฐมนตรี จัดให้มีระเบียบ เพื่อให้เจ้าหน้าที่ ซึ่งต้องรับผิดตามมาตรา ๘ และมาตรา ๑๐ สามารถผ่อนชำระเงิน ที่จะต้องรับผิดนั้นได้ โดยคำนึงถึงรายได้ ฐานะครอบครัว และความรับผิดชอบ และพฤติการณ์แห่งกรณีประกอบด้วย<br><br><p class='act-paragraph'>มาตรา ๘ ในกรณีที่หน่วยงานของรัฐ ต้องรับผิดใช้ค่าสินไหมทดแทนแก่ผู้เสียหาย เพื่อการละเมิดของ เจ้าหน้าที่ ให้หน่วยงานของรัฐ มีสิทธิเรียกให้เจ้าหน้าที่ ผู้ทำละเมิด ชดใช้ค่าสินไหมทดแทนดังกล่าว แก่หน่วยงานของรัฐได้ ถ้าเจ้าหน้าที่ได้กระทำการนั้นไปด้วยความจงใจ หรือประมาทเลินเล่ออย่างร้ายแรง<br><br><p class='act-paragraph'>มาตรา ๑๐ ในกรณีที่เจ้าหน้าที่ เป็นผู้กระทำละเมิดต่อหน่วยงานของรัฐ ไม่ว่าจะเป็นหน่วยงานของรัฐ ที่ผู้นั้นอยู่ในสังกัดหรือไม่ ถ้าเป็นการกระทำ ในการปฏิบัติหน้าที่ การเรียกร้องค่าสินไหมทดแทน จากเจ้าหน้าที่ ให้นำ บทบัญญัติมาตรา ๘ มาใช้บังคับโดยอนุโลม แต่ถ้ามิใช่การกระทำ ในการปฏิบัติหน้าที่ ให้บังคับตามบทบัญญัติแห่ง ประมวลกฎหมายแพ่งและพาณิชย์ <br>"},

{id:"25660702_RN5358_02_law_LAW_43", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ข้อใด มิได้ถูกกล่าวถึงในพระราชบัญญัติวิธีปฏิบัติราชการทางปกครอง พ.ศ.2539?<hr>1) การพิจารณาทางปกครอง    <br>2) การเพิกถอนคําสั่งทางปกครอง    <br>3) สํานักงานคณะกรรมการกฤษฎีกา    <br>4) การปรับปรุงภารกิจของส่วนราชการ   <br>",
 answer:  "4) การปรับปรุงภารกิจของส่วนราชการ<br><br>&quot;การปรับปรุงภารกิจของส่วนราชการ&quot; เป็นเรื่องของ การบริหารกิจการบ้านเมืองที่ดี <br><br>การพิจารณาทางปกครอง และการเพิกถอนคําสั่งทางปกครอง เป็นวิธีปฏิบัติราชการทางปกครองที่ชัดเจนอยู่แล้ว ส่วนสํานักงานคณะกรรมการกฤษฎีกา พ.ร.ฎ ฉบับนี้ กำหนดให้ทำหน้าที่เป็น สำนักงานเลขานุการ ของคณะกรรมการวิธีปฏิบัติราชการทางปกครอง<br><br>พ.ร.บ.วิธีปฏิบัติราชการทางปกครอง<br><br><p class='act-paragraph'>มาตรา ๕ ในพระราชบัญญัตินี้ <p class='act-paragraph'>&quot;การพิจารณาทางปกครอง&quot; หมายความว่า การเตรียมการและการดำเนินการของเจ้าหน้าที่ เพื่อจัดให้มีคำสั่งทางปกครอง<br><p class='act-paragraph'>มาตรา ๑๐ ให้สำนักงานคณะกรรมการกฤษฎีกา ทำหน้าที่เป็นสำนักงานเลขานุการ ของคณะกรรมการวิธีปฏิบัติราชการทางปกครอง รับผิดชอบงานธุรการ งานประชุม การศึกษา หาข้อมูลและกิจการต่าง ๆ ที่เกี่ยวกับงาน ของคณะกรรมการวิธีปฏิบัติราชการทางปกครอง<br><p class='act-paragraph'>มาตรา ๔๙ เจ้าหน้าที่ หรือผู้บังคับบัญชา ของเจ้าหน้าที่ อาจเพิกถอนคำสั่งทางปกครองได้ ตามหลักเกณฑในมาตรา ๕๑ มาตรา ๕๒ และมาตรา ๕๓ ไม่ว่าจะพ้นขั้นตอนการกำหนดให้อุทธรณ์ หรือให้โต้แย้ง ตามกฎหมายนี้ หรือกฎหมายอื่นมาแล้วหรือไม่ <br>"},

{id:"25660702_RN9262_02_law_LAW_42", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br>ผู้ใดจัดทําบัญชีรายชื่อบุคคลผู้ทําหน้าที่ี่ไกล่เกลี่ยและประนอมข้อพิพาทของประชาชน ในเขตอําเภอ?<hr>1) นายอําเภอโดยความเห็นชอบของผู้ว่าราชการจังหวัด    <br>2) นายอําเภอโดยความเห็นชอบของคณะกรมการจังหวัด    <br>3) หัวหน้าส่วนราชการประจำอำเภอ    <br>4) ปลัดอำเภอ โดยความเห็นชอบของนายอำเภอ   <br>",
 answer:  "2) นายอําเภอโดยความเห็นชอบของคณะกรมการจังหวัด<br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>ให้<strong>นายอำเภอโดยความเห็นชอบของคณะกรมการจังหวัด</strong> จัดทำบัญชีรายชื่อบุคคล ที่จะทำหน้าที่เป็นคณะ บุคคลผู้ทำหน้าที่ไกล่เกลี่ย และประนอมข้อพิพาท โดยคัดเลือกจากบุคคลที่มีความรู้ หรือมีประสบการณ์เหมาะสม กับการทำหน้าที่ไกล่เกลี่ยข้อพิพาท</p>"},

{id:"25660702_RN4209_02_law_LAW_41", number:"<small>ข้อสอบเสมือนจริง กพ 2566</small><br>คำสั่ง: ให้ท่านเลือกตัวเลือกที่ถูกต้องที่สุด<br><br> เมื่อมีการยุบกระทรวง ในกรณีที่ส่วนราชการ ประสงค์จะรับโอนข้าราชการ ใน กระทรวงที่ถูกยุบต้องกระทําภายในกี่วัน นับตั้งแต่พระราชกฤษฎีกาการยุบกระทรวงมีผลบังคับใช้ ?<hr>1) 15 วัน    <br>2) 30 วัน      <br>3) 60 วัน     <br>4)  90 วัน    <br>",
 answer:  "2) 30 วัน <br><br>พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน<br><br><p class='act-paragraph'>มาตรา ๘ จัตวา การยุบส่วนราชการตามมาตรา ๗ ให้ตราเป็นพระราชกฤษฎีกา</p>...<p class='act-paragraph'>ข้าราชการหรือลูกจ้างซึ่งต้องพ้นจากราชการเพราะเหตุยุบตำแหน่ง อันเนื่องมาแต่การยุบส่วนราชการ ตามวรรคหนึ่ง นอกเหนือจากสิทธิประโยชน์ ที่พึงได้รับตามกฎหมาย หรือระเบียบข้อบังคับอื่นแล้ว ให้ข้าราชการ หรือลูกจ้างได้รับเงินชดเชย ตามหลักเกณฑ์ และวิธีการที่กำหนด ในพระราชกฤษฎีกาตามวรรคหนึ่งด้วย</p><p class='act-paragraph'>ในกรณีที่ส่วนราชการ รัฐวิสาหกิจหรือหน่วยงานอื่นของรัฐ ประสงค์จะรับโอนข้าราชการหรือลูกจ้างตาม วรรคสาม ก็ให้กระทำได้ โดยมิให้ถือว่าข้าราชการหรือลูกจ้างผู้นั้น ได้พ้นจากราชการตามวรรคสาม <strong>แต่ทั้งนี้ต้อง กระทำภายในสามสิบวัน </strong>นับแต่พระราชกฤษฎีกาตามวรรคหนึ่งมีผลใช้บังคับ</p><br>"},
];

const stateAdminPattern = /ระเบียบบริหารราชการแผ่นดิน/;
const goodGovPattern = /หลักเกณฑ์และวิธีการบริหารกิจการบ้านเมือง/;
const adminProcedurePattern = /วิธีปฏิบัติราชการทางปกครอง/;
const violatePattern = /ความรับผิดทางละเมิด/;
const ethicsPattern = /พ.ร.บ.มาตรฐานทางจริยธรรม/;
const crimePattern = /ประมวลกฎหมายอาญา/;

/*
// Loop through the allOfThemLaw_dat
for (let i = 0; i < thaiPassage_dat.length; i++) {
  const item = thaiPassage_dat[i];

  // Check if the 'answer' property contains "aaaa" and push to arr01

  if (stateAdminPattern.test(item.answer)) {
  console.log("check_stateAdminPattern: ", item.answer);
  metaphor_dat.push(item);
  console.log("check_metaphor_dat_length:", metaphor_dat.length);
  }
    if (goodGovPattern.test(item.answer)) {
    thaiConditioning_dat.push(item);
    }
      if (adminProcedurePattern.test(item.answer)) {
      sntOrder_dat.push(item);
      }

      if (violatePattern.test(item.answer) || ethicsPattern.test(item.answer) || crimePattern.test(item.answer)){
      remaining_dat.push(item);
      }

}  // end of for (let i = 0; i < thaiPassage_dat.length; i++) {
*/

console.log("metaphor_dat_length:", metaphor_dat.length);
console.log("thaiConditioning_dat_length:", thaiConditioning_dat.length);
console.log("sntOrder_dat_length", sntOrder_dat.length);
console.log("remaining_dat_length:", remaining_dat.length);
console.log("thaiPassage_dat_length:", thaiPassage_dat.length);

// Output the smaller arrays  // อันนี้ แสดง เป็น object Object บน Android Studio แต่ถ้าใช้ CodePen ก็จะแสดงเป็นข้อมูลให้เห็น
//console.log("arr01:", arr01);
//console.log("arr02:", arr02);
//console.log("arr03:", arr03);

// Output the smaller arrays // ไม่แสดงอะไร ต้องไปใช้ใน CodePen จึงจะเห็น
//console.log("arr01:", arr01.map(item => item.answer));
//console.log("arr02:", arr02.map(item => item.answer));
//console.log("arr03:", arr03.map(item => item.answer));


// รับข้อมูลมาจาก flutter
function isBuyAndMode(myDat){
var inComingData = myDat;

var isPremium; // ซื้อแล้ว
var is_darkMode;
// var htmlMode; // มืดหรือสว่าง

var element = document.body; // สำหรับเปลี่ยนโหมด มืด-สว่าง โดยเปลี่ยนสี background และ ตัวหนังสือ
var hex = ("#00FF00");  // สำหรับเปลี่ยนสีลิงค์

 // alert("buy already?");

// แยก การซื้อ และโหมด ที่ส่งเข้ามา คั่นด้วย xyz
// เรื่องซื้อ ไม่ต้องเชค เพราะกันไว้แล้วว่า ถ้ายังไม่ซื้อ ไม่ให้เข้ามาทำข้อสอบที่นี
datArr = myDat.split("xyz");   //datArr[0] คือ ซื้อแล้วหรือยัง true=ซื้อแล้ว  datArr[1] คือ โหมดมือหรือไม่  true=ใช่โหมดมืด  false=ไม่ใช่โหมดมืด

is_Bought = datArr[0];

// alert("datArr buy already? " +  is_Bought);


classRoundedCorner = document.getElementsByClassName('rcorners1');
if (classRoundedCorner.length >= 1) {
    for (var i = 0; i < classRoundedCorner.length; i++){
        classRoundedCorner[i].style.borderColor = '#FDEAB3';
    };
 };
classBigBlue  = document.getElementsByClassName('big_blue');
if (classBigBlue.length >= 1) {
    for (var i = 0; i < classBigBlue.length; i++){
        classBigBlue[i].style.color = '#FBD052';
    };
};
classBigRed = document.getElementsByClassName('big_red');
if (classBigRed.length >= 1) {
    for (var i = 0; i < classBigRed.length; i++){
        classBigRed[i].style.color = '#FFC300';
    };
};
//

// ปรับโหมด มืด-สว่าง
is_darkMode = datArr[1];

// alert("is_darkMode \n(true = โหมดมืด, false = โหมดสว่าง) :" + is_darkMode);

if (is_darkMode == "true"){
    htmlMode = "dark";
 }else{
         htmlMode = "light";
     }
// alert("htmlMode: "+ htmlMode);


if (htmlMode=="dark"){ // ถ้าอยู่ในโหมด มืด
element.style.backgroundColor = 'black';
element.style.color = 'white';

var fraction_line =  document.getElementsByClassName("bottom");
    if(fraction_line !== null){
        for(var i = 0; i < fraction_line.length; i++){
            fraction_line.style.borderTop='thin solid #0000FF';
        }

    }

 // กรอบล้อมรอบ คำถาม
 var tableBorder = document.getElementById("listingTable");
 tableBorder.style.borderColor = "gray";

 // กรอบล้อมรอบ คำตอบ
  var show_Answer = document.getElementById("showAnswer");
  show_Answer.style.borderColor = "gray";

// เส้นคั่น ระหว่าง เศษ และ ส่วน

var frac_line = document.getElementsByClassName('span.bottom');
  for (var i = 0; i < frac_line.length; i++) {
    frac_line[i].style.color = 'white';
  }

// ถ้าอยู่ในโหมดมืด เปลี่ยนสีลิงค์ ให้สว่างขึ้น
    var links = document.getElementsByTagName("a");
    if(links !== null){
    for(var i=0;i<links.length;i++)
    {
        if(links[i].href)
        {
            links[i].style.color = hex;
        }
    }
    } // end of if(links !==

//  เปลี่ยนพื้นหลัง modal-content ที่แสดงผลการทำข้อสอบ
var modalContent = document.getElementsByClassName("modal-content")[0];
//  alert("modalContent: " + modalContent);
modalContent.style.backgroundColor = '#808080';

 // change background color of timer wraper
var timerWrapper = document.getElementsByClassName("timer_wrapper");
if (timerWrapper.length >= 1) {
    for (var i = 0; i < timerWrapper.length; i++){
        timerWrapper[i].style.backgroundColor = '#808080';
    };
    // change timer font color from red to white
    var time = document.getElementById("timer");
    time.style.color = '#FFFFFF';
 };
//  เปลี่ยนสีพื้นตาราง ไม่เสถียร เลยไม่เปลี่ยน แก้เป็นสีน้ำตาลใน css แทน ใช้ทั้งสองโหมด
// ไม่เสถียร เพราะ ตอน run ครั้งแรก javascript ทำงานก่อน จึงไม่เจอตาราง ต้องเอา javascript ไปไว้ตอนท้าย เพื่อให้ทั้งหน้า load ให้เสร็จเรียบร้อยเสียก่อน
//// // qstn-div
var qstn_div = document.getElementsByClassName("qstn-div");
//   alert("qstn_div length: " + qstn_div.length);
 if (qstn_div.length >= 1) {
     for (var i = 0; i < qstn_div.length; i++){
  //   alert("qstn_div number: " + i);
         qstn_div[i].style.backgroundColor = '#4f4f4f';
     };
  };


//
  var tableElements = document.getElementsByTagName("table");
 // alert("tableElements length: " + tableElements.length);
  for(var i = 0; i < tableElements.length; i++){
      var thisTable = tableElements[i] ;
      var rows = thisTable.getElementsByTagName("tr") ;
  		for (var j=0; j<rows.length; j++) {
  		 if (j % 2 == 0){
                rows[j].style.backgroundColor = "#818181";;
            }else{
                rows[j].style.backgroundColor = "#6a6a6a ";
  			//	rows[j].style.backgroundColor = "#818181";
  			//	rows[j].style.backgroundColor = "red";
  			}
  		}
  	}
}else{  // ถ้าอยู่ในโหมด สว่าง
element.style.backgroundColor = 'white';
element.style.color = 'black';


}
}  // end of  isBuyAndMode(myDat)



// ***********************

function result() {
  var score = 0;
  not_correct.length = 0;
  correct_qstns.length = 0;
  skipped_qstns.length = 0;

	count = 0;

var node_list = document.getElementsByTagName('input');
 var count  = 0;
for (var i = 0; i < node_list.length; i++) {

 // หา node ที่เป็น radio button และที่ถูกเลือกด้วย
 if (node_list[i].type == 'radio' && node_list[i].checked) {
            count++;
        }
    }

var node_quiz = document.getElementsByClassName("quiz");
var this_qstn_score;

var num_of_qstns = node_quiz.length;
for (var i = 0; i < num_of_qstns; i++) {

checkForSkipped("q"+(i+1));

this_qstn_score =parseInt(getSelectedRadioValue("q"+(i+1))) || 0;
score += this_qstn_score;
 }




// จำนวนข้อที่ไม่ได้ทำ
var notChecked = num_of_qstns - count;

if(not_correct.length !== 0)
	{
	/*
	message = "คะแนนของท่าน: " + score + "  คะแนน หรือเท่ากับ  " + parseFloat((score /num_of_qstns)*100).toFixed(2) + " &#37; <br>ข้อที่ทำถูก: " + correct_qstns.toString() + "<br>ข้อที่ทำผิด: " + not_correct.toString();
	*/
	message = "คะแนนของท่าน: " + score + "  คะแนน หรือเท่ากับ  " + parseFloat((score /num_of_qstns)*100).toFixed(2) + " &#37;<br>ข้อที่ทำผิด: " + not_correct.toString();

	}else{
    message = "คะแนนของท่าน: " + score + "  คะแนน หรือเท่ากับ   " + parseFloat((score /num_of_qstns)*100).toFixed(2) + " &#37;"
	};

// ถ้ามีการไม่ทำบางข้อ ให้แสดงข้อมูลใน feedback ด้วย
	if (notChecked > 0)
	{
		message = message + "<br><br>ไม่ได้ทำข้อสอบ จำนวน " + notChecked + " ข้อ ได้แก่ " + skipped_qstns.toString() + "<br><br>ท่านสามารถปิดหน้าจอนี้ เพื่อกลับไปแก้ข้อผิด หรือทำต่อให้ครบ แล้วกดปุ่ม ส่งคำตอบ อีกครั้ง"
	}

// หยุดการจับเวลา
		pauseCountDown();

if (min > 0 && hour == 0)
{
	message = message +"<br><br>ใช้เวลาทำข้อสอบ " + min + " นาที";
}

if (min > 0 && hour > 0)
{
	message = message +"<br><br>ใช้เวลาทำข้อสอบ " + hour + " ช.ม. " + min + " นาที";
}

// แสดง feedback ใน id myMessage ของไฟล์ html ที่เรียกใช้งาน
		document.getElementById("myMessage").innerHTML = message;
		modal.style.display = "block";

//alert (message);

// ป้องกันไม่ให้หน้าจอเลื่อนไปข้างบน
 return false;
}

function checkForSkipped(name){
  var is_skipped=0;

  var radios = document.getElementsByName(name);

 var thisQstn = " ข้อ " + name.substr(1);

    for (var i = 0; i < radios.length; i++) {
			if (radios[i].checked){  //ถ้าไม่มีการเลือกข้อนี้
			is_skipped++; // เก็บข้อมูลข้อที่ข้าม ไม่ได้ทำ
	}	}

   if (is_skipped==0){  //ถ้าไม่มีการเลือกข้อนี้
			skipped_qstns.push(thisQstn); // เก็บข้อมูลข้อที่ข้าม ไม่ได้ทำ
	}
}


function getSelectedRadioValue(name) {
  var radios = document.getElementsByName(name);
  var thisQstn = " ข้อ " + name.substr(1);

  for (var i = 0; i < radios.length; i++) {

    if (radios[i].checked) {
		if(radios[i].value==0){
			// เก็บข้อที่ทำผิดไว้ใน array ชื่อ not_correct เพื่อจะนำไปแสดงใน feedback ด้วย
			not_correct.push(thisQstn);
		}else{
			// เก็บข้อที่ทำถูกไว้ใน array ชื่อ	correct_qstns เพื่อจะนำไปแสดงใน feedback ด้วย
			correct_qstns.push(thisQstn);
		}




      return radios[i].value;
    }

  }
}

/* for sequential numbers */
//
//var current = document.getElementById('default');
//
//  function highlite(el)
//  {
//     if (current != null)
//     {
//         current.className = "";
//     }
//     el.className = "highlite";
//     current = el;
//  }
//


var current_page;  // หน้าปัจจุบัน แต่ละเมนูต้องมาเปลี่ยน ตัวแปรนี้ด้วย เพราะเอาไปใช้กับ ปุ่มต่อไป - กลับ
var records_per_page = 1;
var jsonName = ""; // สำหรับเก็บชื่อตัวแปร json เพื่อส่งไปยัง Android เพื่อเก็บลงฐานข้อมูล เวลากลับมาอีกครั้ง จะได้รู้ว่า ทำอะไร ไปถึงข้ออะไร
var thisJson = [];

// from: https://stackoverflow.com/questions/2264072/detect-a-finger-swipe-through-javascript-on-the-iphone-and-android
document.addEventListener('swiped', function(e) {
    console.log(e.target); // the element that was swiped
    console.log(e.detail.dir); // swiped direction
});

document.addEventListener('swiped-left', function(e) {
  //  console.log(e.target); // the element that was swiped
//	alert('swiped left!')
	nextPage();
});

document.addEventListener('swiped-right', function(e) {
   // console.log(e.target); // the element that was swiped
	//alert('swiped right!')
	prevPage();
});


var clicks = 0;
var timer, timeout = 350; // time between each click

var doubleClick = function(e) {
  console.log('doubleClick!!');
  goToPage('start', thisJson);
}

var tripleClick = function(e) {
  console.log('tripleClick!!');
  goToPage('end', thisJson);
}

// click timer
document.addEventListener('click', function(e) {
  clearTimeout(timer);
  clicks++;
  var evt = e;
  timer = setTimeout(function() {
    if(clicks==2) doubleClick(evt);
    if(clicks==3) tripleClick(evt);
    clicks = 0;
  }, timeout);
});


//
//document.addEventListener('swiped-up', function(e) {
//		goToPage('end', thisJson);
//});
//
//document.addEventListener('swiped-down', function(e) {
//		goToPage('start', thisJson);
//});
//

//
//
//var thaiConditioning_dat = [
//
//{id:"01_25660702_02_งข_paper_poy_04", number:"<small>ข้อสอบเสมือนจริง 2 ก.ค. 66 บ่าย</small><br>ทุกตัวอักษรเป็นเลขจำนวนนับ<br>3P = (Q + R) < (M + N) < X<br><span class='frac'>W<span class='symbol'>/</span><span class='bottom'>7</span></span> ≥ <span class='frac'>X<span class='symbol'>/</span><span class='bottom'>6</span></span> ≥ <span class='frac'>4Y<span class='symbol'>/</span><span class='bottom'>5</span></span> > <span class='frac'>2Z<span class='symbol'>/</span><span class='bottom'>3</span></span><br><br><hr>ข้อสรุปที่ 1: W &gt; M + N<br>ข้อสรุปที่ 2: (X + Q + R) < (3P + Y)<br>",
// answer:  "ข้อสรุปที่ 1: W &gt; M + N  --  จริง<br>ข้อสรุปที่ 2: (X + Q + R) < (3P + Y)  --  เท็จ<br>ตอบข้อ 1<br><br>ทำตัวเชื่อมให้เท่ากัน โดยใช้ 6 คูณตลอดเงื่อนไขบรรทัดล่าง<span class='frac'>6W<span class='symbol'>/</span><span class='bottom'>7</span></span> ≥ <span class='frac'>6X<span class='symbol'>/</span><span class='bottom'>6</span></span> ≥ <span class='frac'>6x4Y<span class='symbol'>/</span><span class='bottom'>5</span></span> &gt; <span class='frac'>6x2Z<span class='symbol'>/</span><span class='bottom'>3</span></span><br><span class='frac'>6W<span class='symbol'>/</span><span class='bottom'>7</span></span> ≥ X ≥ <span class='frac'>24Y<span class='symbol'>/</span><span class='bottom'>5</span></span> &gt; 4Z<br>ข้อสรุปที่ 1: W &gt; M + N<br>จาก W ไปหา M + N ผ่านตัวเชื่อม X คือ<br><span class='frac'>6W<span class='symbol'>/</span><span class='bottom'>7</span></span> &gt; X &gt; (M + N)<br>ยุบรวม<br><span class='frac'>6W<span class='symbol'>/</span><span class='bottom'>7</span></span> &gt; (M + N)<br>เหมือนข้อสรุปข้างหนึ่งแล้ว เอา  W มาเทียบอีกข้างหนึ่งได้ <br><span class='frac'>6W<span class='symbol'>/</span><span class='bottom'>7</span></span> = 0.7W จึงน้อยกว่า W<br>ดังนั้น<br>W &gt; <span class='frac'>6W<span class='symbol'>/</span><span class='bottom'>7</span></span> &gt; (M + N)<br>ยุบรวม<br>W &gt; (M + N)<br>เหมือนข้อสรุปที่ 1<br>ดังนั้น ข้อสรุปที่ 1 เป็นจริง<br><br>ข้อสรุปที่ 2: (X + Q + R) < (3P + Y) <br>พิจารณาจากข้อสรุปและเงื่อนไข จะเห็นว่า (Q + R) กับ 3P มีค่าเท่ากัน และ X กับ Y ก็เปรียบเทียบกันได้<br>ถ้าเราสร้าง 2 อสมการ โดยที่ข้างหนึ่ง มี (Q + R) และ อีกข้างหนึ่งมี 3P <br>กับอีก อสมการหนึ่ง ที่ข้างหนึ่งมี  X และอีกข้างหนึ่ง มี Y <br>จากนั้น เอาสองอสมการ มารวมกัน ก็จะได้ตามข้อสรุป<br><br>อสมการที่ 1<br>Q + R = 3P<br>อสมการที่ 2<br>X ≥ <span class='frac'>24Y<span class='symbol'>/</span><span class='bottom'>5</span></span><br>เราต้องการ Y เพื่อเอาไปรวมกัน ให้เหมือนข้อสรุป<br>ได้ X ข้างหนึ่งแล้ว เอา Y มาเทียบอีกข้างได้<br><span class='frac'>24Y<span class='symbol'>/</span><span class='bottom'>5</span></span> = 4<span class='frac'>4Y<span class='symbol'>/</span><span class='bottom'>5</span></span> จึงมากกว่า Y ตัวเดียว<br>X ≥ <span class='frac'>24Y<span class='symbol'>/</span><span class='bottom'>5</span></span> &gt; Y<br>ยุบรวม<br>X &gt; Y<br><br>อสมการที่ 1 + อสมการที่ 2<br>ระหว่างเครื่องหมาย = และ &gt; เครื่องหมาย &gt; ลำดับความสำคัญสูงกว่า รวมกันได้เครื่องหมาย &gt;<br><br>X + Q + R &gt; 3P + Y<br>ได้ผลตรงข้ามกับข้อสรุป<br>ข้อสรุปที่ 2 เป็นเท็จ<br><br>ข้อสรุปที่ 1 เป็นจริง<br>ข้อสรุปที่ 2 เป็นเท็จ<br>ตัวเลือก ข้อ 4 ถูกต้อง มีผลการสรุปต่างกัน"},
//
//{id:"01_25660702_02_งข_paper_poy_05", number:"<small>ข้อสอบเสมือนจริง 2 ก.ค. 66 บ่าย</small><br>ทุกตัวอักษรเป็นเลขจำนวนนับ<br>3P = (Q + R) < (M + N) < X<br><span class='frac'>W<span class='symbol'>/</span><span class='bottom'>7</span></span> ≥ <span class='frac'>X<span class='symbol'>/</span><span class='bottom'>6</span></span> ≥ <span class='frac'>4Y<span class='symbol'>/</span><span class='bottom'>5</span></span> &gt; <span class='frac'>2Z<span class='symbol'>/</span><span class='bottom'>3</span></span><br><br><hr>ข้อสรุปที่ 1: (M + N + X) &gt; (Q + R + Z)<br>ข้อสรุปที่ 2: 24Y > 10Z<br>",
// answer:  "ข้อสรุปที่ 1:  (M + N + X)  &gt; (Q + R + Z) --  จริง<br>ข้อสรุปที่ 2: 24Y > 10Z  --  จริง<br>ตอบข้อ 1<br><br>ทำตัวเชื่อมให้เท่ากัน โดยใช้ 6 คูณตลอดเงื่อนไขบรรทัดล่าง<span class='frac'>6W<span class='symbol'>/</span><span class='bottom'>7</span></span> ≥ <span class='frac'>6X<span class='symbol'>/</span><span class='bottom'>6</span></span> ≥ <span class='frac'>6x4Y<span class='symbol'>/</span><span class='bottom'>5</span></span> &gt; <span class='frac'>6x2Z<span class='symbol'>/</span><span class='bottom'>3</span></span><br><span class='frac'>6W<span class='symbol'>/</span><span class='bottom'>7</span></span> ≥ X ≥ <span class='frac'>24Y<span class='symbol'>/</span><span class='bottom'>5</span></span> &gt; 4Z<br>ข้อสรุปที่ 1: (M + N + X) &gt;  (Q + R + Z) <br>แนวทางการพิสูจน์<br>จะเห็นว่า ในเงื่อนไขมี (M + N), (Q + R), X และ Z<br>ในข้อสรุป มี (M + N), X อยู่ข้างเดียวกัน และบวกกัน<br>ในข้อสรุป มี (Q + R), Z อยู่ข้างเดียวกัน และบวกกัน<br>ดังนั้น ถ้าเราสร้าง อสมการ 2 อสมการ แล้วเอามาบวกกัน ก็จะได้ตามข้อสรุป<br><br>อสมการที่ 1<br>จากเงื่อนไข<br>(M + N) &gt; (Q + R)<br><br>อสมการที่ 2<br>X ≥ <span class='frac'>24Y<span class='symbol'>/</span><span class='bottom'>5</span></span> &gt; 4Z<br>ยุบรวม<br>X &gt; 4Z<br>เราต้องการ Z เพื่อเอาไปรวมกับ อสมการที่ 1<br>ได้ X เหมือนข้อสรุปข้างหนึ่งแล้ว เอา Z มาเทียบอีกข้างหนึ่งได้ <br>X &gt; 4Z &gt; Z<br>ยุบรวม<br>X &gt; Z<br><br>อสมการที่ 1 + อสมการที่ 2<br>(M + N) + X &gt; (Q + R) + Z<br>M + N + X &gt; Q + R + Z<br>ข้อสรุปที่ 2 เป็นจริง<br><br>ข้อสรุปที่ 1 เป็นจริง<br>ข้อสรุปที่ 2 เป็นจริง<br><br>ตอบ ข้อ 1 ถูกต้อง ข้อสรุปเป็นจริงทั้งสองข้อ"},
//
//    ]
//
//var allOfThemLaw_dat =[
// {number:"เงื่อนไข: สมการ สมการ สมการ <br>ทุกตัวอักษรมีค่ามากกว่าศูนย์<br>A &gt; B &gt; C &gt; D <hr>ข้อสรุป<br>D มีค่ามากที่สุด",
// answer: "เป็นเท็จ<br>A &gt; B &gt; C &gt; D <br>D จึงมีค่าน้อยที่สุด"},
//
// {number:"เงื่อนไข:<br>ทุกตัวอักษรมีค่ามากกว่าศูนย์<br>A &lt; B &#x2264; C<hr>ข้อสรุป<br>A มีค่ามากน้อยที่สุด",
// answer: "เป็นจริง<br>A น้อยกว่า B ซึ่ง B อาจจะเท่ากับ C หรือน้อยกว่า C ก็ได้<br>A จึงมีค่าน้อยที่สุด"},
//
// {number:"เงื่อนไข:<br>ทุกตัวอักษรมีค่ามากกว่าศูนย์<br>P = Q + R<br>4S = 5Q &lt; U &lt; V &lt; R <hr>ข้อสรุป<br>Q มีค่าน้อยที่สุด",
// answer: "เป็นจริง<br>ข้อนี้คิดในใจได้<br>บรรทัดบน Q น้อยที่สุด เพราะ น้อยกว่า Q + R อยู่แล้ว<br>บรรทัดล่าง Q ก็น้อยที่สุดเหมือนกัน<br>เพราะ 5Q = 4S คือ ต้องมี Q จำนวน 5 ตัว จึงจะเท่ากับ S จำนวน 4 ตัว<br>ตัว Q จึงน้อยกว่า ตัว S <br>ทั้งสองบรรทัด Q น้อยที่สุด จึงน้อยที่สุดด้วย"},
//
//]
//
//
//var remaining_dat = [
//                   {number:"เงื่อนไข:<br>ทุกตัวอักษรมีค่ามากกว่าศูนย์<br>B &lt; A &gt; 3 = (C + D) &#x2270; E<hr>ข้อสรุป<br>C &lt; E",
//                   answer:  "ไม่แน่ชัด<br>ต้องเปลี่ยนเครื่องหมาย ไม่น้อยกว่าหรือเท่ากับ เป็น มากกว่า<br> B &lt; A &gt; 3 = (C + D) &gt E<br><br>ตามเงื่อนไข จาก C ไป E คือ<br>(C + D) &gt E<br>ได้ข้างหนึ่งเหมือนข้อสรุปแล้ว เอา C มาเทียบเป็น<br>C &lt; (C + D) &gt E<br>สรุปได้ไม่แน่นอน เพราะพบว่ามีเครื่องหมายสวนทางกัน"},
//                   ]
//
//
//var stateAdmin_dat = [
//
//{id:"02_25660301_02_อน_e-Exam_ocscExamPrep_11", number:"<small>ข้อสอบเสมือนจริง กพ. e-Exam มี.ค. 2566</small><br>คำสั่ง:<br>จงเติมตัวเลขที่ขาดหายไป<br>112 &ensp;  56 &ensp;  14 &ensp;  <span class='frac'>7<span class='symbol'>/</span><span class='bottom'>3</span></span>........ <br><hr>1) <span class='frac'>7<span class='symbol'>/</span><span class='bottom'>24</span></span> &ensp;   &ensp;   &ensp;&ensp;&ensp;&ensp;&ensp;&ensp;               2) <span class='frac'>17<span class='symbol'>/</span><span class='bottom'>23</span></span> &ensp;   &ensp;  <br>3) <span class='frac'>14<span class='symbol'>/</span><span class='bottom'>56</span></span> &ensp;   &ensp;  &ensp;&ensp;&ensp;&ensp;&ensp;&ensp;              4) <span class='frac'>46<span class='symbol'>/</span><span class='bottom'>53</span></span> &ensp;   &ensp;  <br>",
// answer:  "ตอบ: 1) <span class='frac'>7<span class='symbol'>/</span><span class='bottom'>24</span></span><br>วิธีทำ:<br><br>มีเศษส่วน <br>ตัวเลขลดลงตลอด น่าจะมีการลบ หรือ หาร<br>ลองแฉก (หลัง &#xf7; หน้า) <br>112 &#xf7; 56 = 2<br>56 &#xf7; 14 = 3<br>14  &#xf7;  <span class='frac'>7<span class='symbol'>/</span><span class='bottom'>3</span></span> = 14 x <span class='frac'>3<span class='symbol'>/</span><span class='bottom'>7</span></span> = 6<br>2,3,6 ห่างกันช่วงละ 2<br>ตัวต่อไป คือ 8<br><span class='frac'>7<span class='symbol'>/</span><span class='bottom'>3</span></span>   &#xf7;  8 = <span class='frac'>7<span class='symbol'>/</span><span class='bottom'>3</span></span> x <span class='frac'>1<span class='symbol'>/</span><span class='bottom'>8</span></span>  = <span class='frac'>7<span class='symbol'>/</span><span class='bottom'>24</span></span><br><br>ดังภาพ<br><br><img src = 'images/real_112561473.png'>"},
//
//{id:"02_25660301_02_อน_e-Exam_ocscExamPrep_10", number:"<small>ข้อสอบเสมือนจริง กพ. e-Exam มี.ค. 2566</small><br>คำสั่ง:<br>จงเติมตัวเลขที่ขาดหายไป<br>5 &ensp;  6 &ensp;  10 &ensp;  19 &ensp;  35 &ensp;  60 &ensp;  ........ <br><hr>1) 82 &ensp;   &ensp;   &ensp;&ensp;&ensp;&ensp;&ensp;&ensp;               2) 96 &ensp;   &ensp;  <br>3) 100 &ensp;   &ensp;  &ensp;&ensp;&ensp;&ensp;&ensp;&ensp;              4) 112 &ensp;   &ensp;  <br>",
// answer:  "ตอบ: 2) 96<br>วิธีทำ:<br><br>ตัวเลขมีเพิ่มขึ้นไม่มาก <br>ลองเชคแบบสะสม -- ไม่น่าจะใช่<br>ลองเชคแบบอนุกรมซ้อน -- ไม่น่าจะใช่<br><br>ลองตีแฉก (หน้า-หลัง)<br>6 - 5 = 1<br>10 - 6 = 4<br>19 - 10 = 9<br>35 - 19 = 16<br><br>เลข 1, 4 ,9, 16 คือเลขยกกำลัง 2 ของ 1, 2, 3, 4 <br>1<sup>2</sup> = 1, 2<sup>2</sup> = 4, 3<sup>2</sup> = 9, 4<sup>2</sup> = 16<br><br>ดังภาพ<br><br><img src = 'images/5610193560.png'>"},
//
//{id:"02_25660301_02_อน_e-Exam_ocscExamPrep_09", number:"<small>ข้อสอบเสมือนจริง กพ. e-Exam มี.ค. 2566</small><br>คำสั่ง:<br>จงเติมตัวเลขที่ขาดหายไป<br>50 &ensp;  7 &ensp;  65 &ensp;  9 &ensp;  80 &ensp;  11 &ensp;  95 &ensp;  13 &ensp;  ........ <br><hr>1) 72 &ensp;   &ensp;   &ensp;&ensp;&ensp;&ensp;&ensp;&ensp;               2) 86 &ensp;   &ensp;  <br>3) 110 &ensp;   &ensp;  &ensp;&ensp;&ensp;&ensp;&ensp;&ensp;              4) 112 &ensp;   &ensp;  <br>",
// answer:  "ตอบ: 3) 110<br>วิธีทำ:<br><br>มีหลายจำนวน ตัวเลขมีเพิ่มขึ้น มีลดลง สลับกัน ลักษณะนี้น่าจะมี 2 ชุด ซ้อนกันอยู่ <br>50 - 65 - 80 - 95 ห่างกันช่วงละ 15<br>7 - 9 - 11- 13 ห่างกันช่วงละ 2<br><br>คำตอบคือ ชุดแรก 95 + 15 = 110 ดังภาพ<br><br><img src = 'images/50765980119513.png'>"},
//
//{id:"02_25660301_02_อน_e-Exam_ocscExamPrep_08", number:"<small>ข้อสอบเสมือนจริง กพ. e-Exam มี.ค. 2566</small><br>คำสั่ง:<br>จงเติมตัวเลขที่ขาดหายไป<br>5 &ensp;  17 &ensp;  41 &ensp;  77 &ensp;  125 &ensp;  185 &ensp;  ........ <br><hr>1) 157 &ensp;   &ensp;   &ensp;&ensp;&ensp;&ensp;&ensp;&ensp;               2) 241 &ensp;   &ensp;  <br>3) 249 &ensp;   &ensp;  &ensp;&ensp;&ensp;&ensp;&ensp;&ensp;              4) 257 &ensp;   &ensp;  <br>",
// answer:  "ตอบ: 4) 257<br>วิธีทำ:<br><br>มีหลายจำนวน ตัวเลขมีเพิ่มตลอด ลักษณะนี้น่าจะมีการบวกกัน อาจจะมีการยกกำลัง หรือการคูณด้วยก็ได้ เพราะเลขเพิ่มห่างกันพอประมาณ<br>ลองเชคแบบสะสม -- ไม่ใช่แบบสะสม<br><br>ลองตีแฉก(หลัง-หน้า)ดู<br>17-5 = 12, 41-17 = 24, 77-41 = 36<br>เลข 12, 24, 36 คือ สูตรคูณแม่ 12 <br>จบแค่นี้ ก็ได้ รู้ว่า ตัวที่ต้องการคือ 72<br><br>หรือจะทำต่ออีกชั้น ก็ได้ ดังภาพ<br><br><img src = 'images/5174177125185.png'>"},
//
//]
//
//

var objJsonSimple = [
{ number: "2&#160;&#160;&#160;7&#160;&#160;&#160;12&#160;&#160;&#160;17&#160;&#160;&#160;22&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    27"},
{ number: "3&#160;&#160;&#160;6&#160;&#160;&#160;9&#160;&#160;&#160;12&#160;&#160;&#160;15&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    18"},
{ number: "3&#160;&#160;&#160;6&#160;&#160;&#160;9&#160;&#160;&#160;12&#160;&#160;&#160;15&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    18"},
{ number: "15&#160;&#160;&#160;18&#160;&#160;&#160;21&#160;&#160;&#160;24&#160;&#160;&#160;27&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    30"},
{ number: "17&#160;&#160;&#160;21&#160;&#160;&#160;25&#160;&#160;&#160;29&#160;&#160;&#160;33&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    37"},
{ number: "52&#160;&#160;&#160;49&#160;&#160;&#160;46&#160;&#160;&#160;43&#160;&#160;&#160;40&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    37"},
{ number: "41&#160;&#160;&#160;47&#160;&#160;&#160;53&#160;&#160;&#160;59&#160;&#160;&#160;65&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    71"},
{ number: "23&#160;&#160;&#160;28&#160;&#160;&#160;33&#160;&#160;&#160;38&#160;&#160;&#160;43&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    48"},
{ number: "12&#160;&#160;&#160;15&#160;&#160;&#160;18&#160;&#160;&#160;21&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    24"},
{ number: "18&#160;&#160;&#160;20&#160;&#160;&#160;22&#160;&#160;&#160;24&#160;&#160;&#160;26&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    28"},
{ number: "14&#160;&#160;&#160;19&#160;&#160;&#160;24&#160;&#160;&#160;29&#160;&#160;&#160;34&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    39"},
{ number: "19&#160;&#160;&#160;16&#160;&#160;&#160;19&#160;&#160;&#160;22&#160;&#160;&#160;25&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    28"},
{ number: "23&#160;&#160;&#160;31&#160;&#160;&#160;39&#160;&#160;&#160;47&#160;&#160;&#160;55&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    63"},
{ number: "12&#160;&#160;&#160;6&#160;&#160;&#160;0&#160;&#160;&#160;-6&#160;&#160;&#160;-12&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    -18"},
{ number: "43&#160;&#160;&#160;47&#160;&#160;&#160;51&#160;&#160;&#160;55&#160;&#160;&#160;59&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    63"},
{ number: "22&#160;&#160;&#160;19&#160;&#160;&#160;16&#160;&#160;&#160;13&#160;&#160;&#160;10&#160;&#160;&#160;.....",  answer: "เพิ่ม-ลด เท่ากัน <br>ตอบ    7"},
]; // Can be obtained from another source, such as your objJson variable



/*

// จะเอาข้อมูลที่สลับกันไปใส่ใน sharePrefs แต่ยุ่งยากมาก เลยไม่เอาดีกว่า
// ทำแบบ manual คือ เอาตัวแปรมารวมกัน แล้วเอาไปใส่ในตารางของ Word แล้วคัดลอกมาเป็น
//ตัวแปร ชื่อ misedArr จะได้เรียกใช้ใน mixed และมีการจำข้อไว้ เมื่อกลับมาจะได้ทำต่อได้

*/


// หาจำนวนข้อทั้งหมด เพื่อเอาไปคิดเป็น เปอร์เซ็นต์ จะได้เอาไปแสดงเป็นวงกลมหน้าเมนู

 numOfQuestions = (sntOrder_dat.length + thaiConditioning_dat.length + metaphor_dat.length + thaiPassage_dat.length + remaining_dat.length);
// numOfQuestions =  thaiPassage_dat.length;  // เอาเฉพาะจำนวนข้อจริง ไม่รวมที่แยกไปตามประเภทต่าง ๆ




function prevPage()
{
var showIt = document.getElementById("showAnswer");
showIt.style.display = 'none';
//var showMsg = document.getElementById("myMessage");
//showMsg.style.display = 'none';
resetCountDown();
// // document.getElementById('myInput').value = '';
// countDown(0,00,05)
    if (current_page > 1) {
        current_page--;
        changePage(current_page, true,thisJson);
    }
}

function nextPage()
{
var showIt = document.getElementById("showAnswer");
showIt.style.display = 'none';
//var showMsg = document.getElementById("myMessage");
//showMsg.style.display = 'none';
// countDown(0,00,05)
resetCountDown();
// // document.getElementById('myInput').value = '';
    if (current_page < numPages()) {
        current_page++;
        changePage(current_page, true, thisJson);
    }
}


function addBkg(what_element){
what_element.classList.add('curr'); // Add class
var thisMenu = document.getElementsByClassName("myMenu");
for (var i = 0; i < thisMenu.length; i++) {
	//alert(thisMenu.item(i).textContent);
	if(what_element.textContent !== thisMenu.item(i).textContent){
		thisMenu.item(i).classList.remove('curr');
	}
  }
/*
if(htmlMode !=="dark"){

var myMenuBkg = document.getElementsByClassName('curr'); // get all elements

console.log("test myMenuBkg not dark : " + myMenuBkg.length);

	for(var i = 0; i < myMenuBkg.length; i++){
	console.log("test myMenuBkg: " + myMenuBkg.length);
		myMenuBkg[i].style.backgroundColor = "#BEC3C6";
	}
}
*/
} // end of addBkg()




function showItAns()
{
	pauseCountDown();

		//disable answer button
    var shBttn = document.getElementById("showAnswer_btn");
    shBttn.disabled = true;

//var current_page = 1;
//var records_per_page = 1;
//var jsonName = "";

//  alert("เรื่อง: " + jsonName + "\nหน้าปัจจุบัน: " + current_page + "\nจำนวนข้อทั้งหมด: " + numPages());

var name = jsonName;
var currQstnNum = current_page;
var totalNum = numPages();
var exerciseMsg = name+"xzc"+currQstnNum+"xzc"+totalNum;

// numOfQuestions = totalNum
// currQstnID = "tbl_q" + currQstnNum;
// alert ("exerciseMsg: " + exerciseMsg);
// ส่งข้อมูลไป Android  ว่าทำเรื่องอะไร ข้อสุดท้ายที่ทำคือข้ออะไร และ เรื่องนี้มีทั้งหมดกี่ข้อ เพื่อเก็บลงฐานข้อมูล
exerciseData.postMessage(exerciseMsg);

// ปรับข้อมูล หน้าปัจจุบัน ใน ตัวแปร Array ที่เก็บหน้าปัจจุบันไว้ทั้งหมด ซึ่งจะเอามาใช้ตอนคลิกเมนู ด้วย
// ไม่งั้น ไปเมนูอื่น แล้วกลับมา จะไม่กลับมาหน้าเดิมที่ออกไป


// หาตำแหน่งของชื่อเมนูนี้ ใน ตัวแปร ที่เก็บข้อสุดท้าย เพื่อจะได้ปรับข้อมูลใหม่ให้เป็นปัจจุบัน เมื่อคลิกปุ่มตรวจ
var thisPos = lastQstnArr.findIndex(element => element.includes(name));
// alert ("lastQstnArr จะหาชื่อ: " + lastQstnArr + "\nname จะหาชื่อ: " + name + "\nthisPos: " + thisPos);
// alert ("name จะหาชื่อ: " + name);
// alert ("thisPos: " + thisPos);

// ไปเอาข้อมูลเก่ามาเพื่อเปลี่ยน ข้อใหม่แทนข้อเก่า
//ข้อใหม่คือ currQstnNum ที่ได้มาจากการคลิกตรวจ ซึ่งมีการเลื่อนหน้าแล้ว ในตัวแปร current_page
console.log("name: " + name + " lastQstnArr: " +  lastQstnArr[0]);
var thisStringName = lastQstnArr.find(element => element.includes(name));
 // alert ("thisStringName: " + thisStringName);

var thisStringNameArr = thisStringName.split("xyz");
//เอาเฉพาะ ชื่อ
var thisName =  thisStringNameArr[0]; // ตัวที่ 1 คือ ชื่อเมนู
// alert ("thisName: " + thisName);

// ปรับใหม่ เปลี่ยนเป็นหน้าปัจจุบัน (ใหม่)
var newStringName = thisName + "xyz" + currQstnNum;

// ปรับข้อมูล ใน lastQstnArr

 // alert("thisStringName: " + thisStringName);
 console.log("thisStringName: " + thisStringName);
  console.log("current_page: " + current_page);

  if(current_page < 1){ // กรณีเข้ามาครั้งแรก จะเป็น 0 เพราะส่งมาจาก Flutter โดยไปเอามาจาก sharePref ซึ่งครั้งแรก
                                     // จะมีค่าเป็น 0 เลยต้องทำให้เป็น 1 เพื่อให้แสดงหน้าแรก ไม่งั้น หาไม่เจอ
  current_page = 1;
  }

lastQstnArr[thisPos] = newStringName;


// alert("thisJson[current_page-1].answer: " + thisJson[current_page-1].answer);  // normal_cndtngxyz1


//alert("lastQstnArr: " + lastQstnArr +"\n\nthisStringName: " + thisStringName + "\n\nthisPos: " + thisPos);

// alert("name: " + name + "\ncurrQstnNum: " + currQstnNum);

// var thisNameArr = thisStringName.split("xyz");
 //       thisName =  thisLNumberArr[0]; // ตัวที่ 1 คือ ชื่อเมนู
  //      thisLNumber = thisLNumberArr[1]; // ตัวที่ 2 คือ ข้อสุดท้าย

 // รวมกันเพื่อส่งกลับไปปรับค่าใน  lastQstnArr
// var newCurrItemNum = thisName + "xyz" +

 //แสดงคำตอบ โดยไปเอามาจากใน Json ในตำแหน่งของข้อนี้
    var showIt = document.getElementById("showAnswer");
//	showIt.innerHTML =  "คำตอบคือ: " + thisJson[current_page-1].answer + "<br>";
	showIt.innerHTML = thisJson[current_page-1].answer + "<br>";
	showIt.style.display = 'block';
}

//
//// รับข้อมูลมาจาก flutter
//function getLastQstnNumFromAndroid(myLastQNum){
//    var thisLNumber = myLastQNum;
//    alert("thisNumber: " + thisNumber);
//}

function changeData(myJason){
// var lastQstn;
// ส่งไป Flutter
// menuNameToSend = myJason+"_cndtng";
// fetchMenuData.postMessage(menuNameToSend);  // ส่งชื่อเมนู ไป Javascript Channel ชื่อ fetchMenuData   ข้อมูลที่ส่ง คือ normal_cndtng หรือ plus_minus_cndtng หรือ fraction_cndtng หรือ min_max_cndtng หรือ multi_connection_cndtng อย่างใดอย่างหนึ่ง ขึ้นอยู่กับการคลิกเมนู



	// เฉพาะ PC ---------------------------
//	var aa="aa";
 //   getExerciseDatFromAndroid();
  //  จบ เฉพาะ PC ---------------------------
	/*
	const current = 0;
for (var i = 0; i < document.links.length; i++) {
    if (document.links[i].href === document.URL) {
        current = i;
    }
}
*/
// highlite(this);
//document.links[current].className = 'current';

// alert("bought already???? " + is_Bought);
//alert("myJason: " + myJason);
switch (myJason) {

case "math_intro":
// ทำให้ปุ่มจับเวลาทำงาน เพราะ disable ตอน อ่านวิธีทำ
	btn_pause.disabled = true;
	btn_reset.disabled = true;
	btn_start.disabled = true;
	resetCountDown();

	document.getElementById('showAnswer').style.display ='none';  // ซ่อนเฉลยที่ปรากฎอยู่ ถ้ามาจากหน้าที่มีเฉลย
    // ไฟล์ html อธิบายวิธีทำ ทั้งไฟล์เอามาใส่ในตัวแปรเลยตรง ๆ ถ้าจะแก้ ให้คัดลอก ไปแก้ใน editPlus เอา \n เพิ่มต่อจาก <br> เพื่อให้ขึ้นบรรทัดใหม่ และเวลาจะเอามาไว้ที่นี่ ให้ตัด \n ออกก่อน
thisJson = "<!DOCTYPE html><html lang='th'> <head>    <meta charset='UTF-8'>    <meta name='viewport' content='width=device-width, initial-scale=1'>     <link rel='stylesheet' type='text/css' href='my_style.css'>    <link rel='stylesheet' type='text/css' href='symbol_cndtng_exercise.css'>	<style>table {border-collapse: collapse; border-spacing: 0; width: 100%;border: 1px solid #ddd;} tr:nth-child(even) {background-color: #B2BEB5;}  tr:nth-child(odd) {background-color: #A9A9A9;}.fraction {  display: inline-block;  position: relative;  vertical-align: middle;   letter-spacing: 0.001em;  text-align: center;  font-size: 12px;  }.fraction > span {   display: block;   padding: 0.1em;   }.fraction span.fdn {border-top: thin solid black;}.fraction span.bar {display: none;}    body {        font-size: 16px;    }/* ให้เส้นคั่น ห่างจากขอบซ้าย นิดนึง*/ hr{margin-left:30;} .equal-width td { width: 50%; } ol{  padding-left:15px;}/* Second Level */ol ol{  padding-left:17px;}/* Third Level */ol ol ol{  padding-left:18px;}ul{  padding-left:15px;}/* Second Level */ul ul{  padding-left:17px;}/* Third Level */ul ul ul{  padding-left:18px;}</style>		<title>Document</title></style>  <title>how_to</title> </head> <body>แบบฝึกนี้มุ่งเน้น การฝึกทำข้อสอบในเวลาจำกัด เพื่อฝึกประสบการณ์ในสภาพเสมือนจริง ประกอบด้วยข้อสอบตั้งแต่ปี 2563 เป็นต้นมา จนถึงปีปัจจุบัน ข้อสอบที่นำมาฝึก เป็นข้อสอบเสมือนจริงที่มีผู้เข้าสอบจดจำมาจากห้องสอบ ซึ่งมีความคลาดเคลื่อนจากข้อสอบจริงไปบ้าง อีกทั้งยังมีการตกแต่งเติมในข้อคำถามและตัวเลือกเพิ่มเติม เพื่อให้มีความสมบูรณ์ หรือปรับเปลี่ยนไปตามกฎหมายที่เปลี่ยนแปลง เป็นต้น จึงเป็นแต่เพียงเสมือนจริงเท่านั้น<br><br>ข้อสอบแบ่งออกตามลักษณะของกฎหมาย แต่มีเมนูสุดท้าย ที่เป็นการรวมทุกฎหมายปะปนกัน <br><br>เนื่องจากมีข้อสอบจำนวนมาก คิดว่าไม่น่าจะทำเสร็จเพียงครั้งเดียว ดังนั้นจึงมีการจดจำการทำครั้งสุดท้ายเอาไว้ เมื่อเข้ามาฝึกทำต่อ จะได้ทำต่อเนื่องกันไปจากเมื่อครั้งก่อน<br><br>สำหรับเรื่องคะแนน ในส่วนนี้จะไม่เก็บคะแนน เพราะสามารถเลือกคำตอบได้หลายครั้ง ถ้าต้องการทราบผลคะแนน ให้เลือกทำในส่วนสุดท้าย ซึ่งคำนวนคะแนนให้จริง หลังจากกดปุ่มส่งคำตอบแล้วเท่านั้น </body></html>";    show_how_to(1, false, thisJson);  // แสดงหน้าคำอธิบาย
    break;



case "metaphor":

// alert("lastQstnArr : " + lastQstnArr)

// แยกข้อมูลที่มาจาก Flutter เอาเฉพาะเมนู fraction
var thisNumDat = lastQstnArr.find(element => element.includes("metaphor"));
// alert("thisNumDat: " + thisNumDat);  // fraction_cndtngxyz1

var thisLNumberArr = thisNumDat.split(":xyz:");
        thisLNumber = thisLNumberArr[1]; // ตัวที่ 2 คือ ข้อสุดท้าย


  	// clear input field
    // document.getElementById('myInput').value = '';
	// ทำให้ปุ่มจับเวลาทำงาน เพราะ disable ตอน อ่านวิธีทำ
	btn_pause.disabled = false;
	btn_reset.disabled = false;
	btn_start.disabled = false;
    document.getElementById('showAnswer').style.display ='none';
  //  shuffle(add_increment_base_const_power);

// alert("metaphor_dat: " + metaphor_dat );

     // เรียงตาม id มากไปน้อย
        metaphor_dat = metaphor_dat.sort((a, b) => {
          if (a.id < b.id) {
          return -1;
          }
      });



    thisJson = metaphor_dat;
    current_page = thisLNumber;
    jsonName = "metaphor_thai_exer";  // ส่งชื่อตัวแปร json เพื่อจะได้เอาไปเก็บไว้ใน ฐานข้อมูล

    changePage(thisLNumber, false, thisJson);
    break;

// symblCon -> thaiConditioning
case  "thaiConditioning":

// alert("lastQstnArr inside case=normal: " + lastQstnArr)

// แยกข้อมูลที่มาจาก Flutter เอาเฉพาะเมนู normal
// https://stackoverflow.com/questions/4556099/how-do-you-search-an-array-for-a-substring-match
var thisNumDat = lastQstnArr.find(element => element.includes("thaiConditioning"));


// alert("thisNumDat: " + thisNumDat);  // normal_cndtngxyz1

var thisLNumberArr = thisNumDat.split(":xyz:");
        thisLNumber = thisLNumberArr[1]; // ตัวที่ 2 คือ ข้อสุดท้าย
    //    alert("thisLNumber: " + thisLNumber);


// ทำให้ปุ่มจับเวลาทำงาน เพราะ disable ตอน อ่านวิธีทำ

	btn_pause.disabled = false;
	btn_reset.disabled = false;
	btn_start.disabled = false;
  	// clear input field
    // document.getElementById('myInput').value = '';
	document.getElementById('showAnswer').style.display ='none';
    //	shuffle(sectmented);

    // เรียงตาม id
    thaiConditioning_dat = thaiConditioning_dat.sort((a, b) => {
        if (a.id < b.id) {
        return -1;
        }
    });

    thisJson = thaiConditioning_dat;
    current_page = thisLNumber; 
    jsonName = "thaiConditioning_exer";  // ส่งชื่อตัวแปร json เพื่อจะได้เอาไปเก็บไว้ใน ฐานข้อมูล
//    jsonName = "goodGov_law_exer";  // ส่งชื่อตัวแปร json เพื่อจะได้เอาไปเก็บไว้ใน ฐานข้อมูล
    changePage(thisLNumber, false, thisJson);
    break;

// **********************************

// symblCon -> goodGov
case  "sntOrder":

// alert("lastQstnArr inside case=normal: " + lastQstnArr)

// แยกข้อมูลที่มาจาก Flutter เอาเฉพาะเมนู normal
// https://stackoverflow.com/questions/4556099/how-do-you-search-an-array-for-a-substring-match
var thisNumDat = lastQstnArr.find(element => element.includes("sntOrder"));


// alert("thisNumDat: " + thisNumDat);  // normal_cndtngxyz1

var thisLNumberArr = thisNumDat.split(":xyz:");
        thisLNumber = thisLNumberArr[1]; // ตัวที่ 2 คือ ข้อสุดท้าย
    //    alert("thisLNumber: " + thisLNumber);


// ทำให้ปุ่มจับเวลาทำงาน เพราะ disable ตอน อ่านวิธีทำ

	btn_pause.disabled = false;
	btn_reset.disabled = false;
	btn_start.disabled = false;
  	// clear input field
    // document.getElementById('myInput').value = '';
	document.getElementById('showAnswer').style.display ='none';
    //	shuffle(sectmented);

    // เรียงตาม id
    sntOrder_dat = sntOrder_dat.sort((a, b) => {
 //   goodGov_dat = goodGov_dat.sort((a, b) => {
        if (a.id < b.id) {
        return -1;
        }
    });

    thisJson = sntOrder_dat;
    current_page = thisLNumber;
    jsonName = "sntOrder_thai_exer";  // ส่งชื่อตัวแปร json เพื่อจะได้เอาไปเก็บไว้ใน ฐานข้อมูล
    changePage(thisLNumber, false, thisJson);
    break;



// ******************************




// allOfThemLaw -> thaiPassage
case  "thaiPassage":

// alert("lastQstnArr : " + lastQstnArr)

// แยกข้อมูลที่มาจาก Flutter เอาเฉพาะเมนู fraction
var thisNumDat = lastQstnArr.find(element => element.includes("thaiPassage"));
//  alert("thisNumDat: " + thisNumDat);  // min_max_cndtngxyz1

var thisLNumberArr = thisNumDat.split(":xyz:");
        thisLNumber = thisLNumberArr[1]; // ตัวที่ 2 คือ ข้อสุดท้าย
// alert("thisLNumber: " + thisLNumber);

  	    // clear input field
        // document.getElementById('myInput').value = '';
        	btn_pause.disabled = false;
        	btn_reset.disabled = false;
        	btn_start.disabled = false;
	    document.getElementById('showAnswer').style.display ='none';
 //       shuffle(accumulate);

      // เรียงตาม id
       thaiPassage_dat = thaiPassage_dat.sort((a, b) => {
           if (a.id < b.id) {
           return -1;
           }
       });

        thisJson = thaiPassage_dat;
        current_page = thisLNumber;
        jsonName = "thaiPassage_thai_exer";

        changePage(thisLNumber, false, thisJson);

    break;

// others -> remaining

case "remaining":


// getSymbolCndngExFromPref  // เอาข้อมูลแบบฝึกหัดที่เก็บไว้ใน sharePref

// แยกข้อมูลที่มาจาก Flutter เอาเฉพาะเมนู multi_connection
var thisNumDat = lastQstnArr.find(element => element.includes("remaining"));
// alert("thisNumDat: " + thisNumDat);  // mixed_cndtngxyz1

var thisLNumberArr = thisNumDat.split(":xyz:");
        thisLNumber = thisLNumberArr[1]; // ตัวที่ 2 คือ ข้อสุดท้าย

    // document.getElementById('myInput').value = '';  // ลบที่พิมพ์คำตอบก่อนหน้านี้ ในช่อง input
	document.getElementById('showAnswer').style.display ='none';  // ซ่อนเฉลยที่ปรากฎอยู่

      // เรียงตาม id
       remaining_dat = remaining_dat.sort((a, b) => {
           if (a.id < b.id) {
           return -1;
           }
       });


 thisJson = remaining_dat;


	current_page = 1;  // เริ่มที่หน้า 1
	jsonName = "remaining_law_exer";  // ส่งชื่อตัวแปร json เพื่อจะได้เอาไปเก็บไว้ใน ฐานข้อมูล
    current_page = thisLNumber;
//	alert("thisJson: " + thisJson.length);

  //  changePage(1, false, thisJson);  // ส่งข้อมูลไปแสดง หน้า, ยังไม่เริ่มจับเวลา(เพราะเพิ่งเข้ามา), ไฟล์ข้อมูลที่เลือก
    changePage(thisLNumber, false, thisJson);  // ส่งข้อมูลไปแสดง หน้า, ยังไม่เริ่มจับเวลา(เพราะเพิ่งเข้ามา), ไฟล์ข้อมูลที่เลือก


    break;


//case  "table":
//
//// แยกข้อมูลที่มาจาก Flutter เอาเฉพาะเมนู plus_minus
//var thisNumDat = lastQstnArr.find(element => element.includes("table"));
//
//var thisLNumberArr = thisNumDat.split(":xyz:");
//        thisLNumber = thisLNumberArr[1]; // ตัวที่ 2 คือ ข้อสุดท้าย
//
//	btn_pause.disabled = false;
//	btn_reset.disabled = false;
//	btn_start.disabled = false;
//	document.getElementById('showAnswer').style.display ='none';
//    shuffle(staticMultiply_incredmentPlus);
//    thisJson = table_dat;
//    current_page = thisLNumber;
//    jsonName = "table_math_exer";  // ส่งชื่อตัวแปร json เพื่อจะได้เอาไปเก็บไว้ใน ฐานข้อมูล
//
//    changePage(thisLNumber, false, thisJson);
//
//    break;


  	// clear input field
//    // document.getElementById('myInput').value = '';
	document.getElementById('showAnswer').style.display ='none';
	shuffle(objJsonSimple);
    thisJson =  objJsonSimple;
	current_page = 1;
    changePage(1, false, thisJson);
}
}

function changePage(page, isStartTiming, myJason)
{
    var btn_next = document.getElementById("btn_next");
    var btn_prev = document.getElementById("btn_prev");
	var btn_first = document.getElementById("go_first");
	var btn_last = document.getElementById("go_last");
    var listing_table = document.getElementById("listingTable");
    var page_span = document.getElementById("page");
	var itemNum = document.getElementById("item_num");
			itemNum.style.display= 'block';

//	var itm_number = document.getElementById("item_num");
//	if (itm_numbe.disabled = true)
//		{
//			itm.disabled = false;
//		}

	var btn_showAns = document.getElementById("showAnswer_btn");


	//alert("page inside changePage function: " + page);


	if (btn_showAns.disabled = true)
		{
			btn_showAns.disabled = false;
		}
//    alert("xxx buy already? " +  is_Bought + " page: " + page);

// เวลาจะใช้จริง ให้กำหนดเป็น 5 ก็พอ
 //if((is_Bought == "false") && (page >=200)){
 if((is_Bought == "false") && (page >=5)){
 // alert("xxxx");
  const ans_btn = document.getElementById('showAnswer_btn');
  ans_btn.disabled = true;
  var msgForNon = document.getElementById('msgForNon-buyers');
  msgForNon.style.display = 'block';

  }


console.log("isStartTiming inside changePage: " + isStartTiming);
if (isStartTiming == true)
{
// มีการตั้งเวลา 2 ที่ คือ ที่แรกตอนกดปุ่มเริ่มจับเวลา ซึ่งอยู่ในไฟล์ html
// และตรงนี้ จะทำงานเมื่อเปลี่ยนหน้า หรือเปลี่ยนข้อ จะเริ่มใหม่โดยอัตโนมัติ จะได้ ไม่ต้องกดจับเวลาใหม่ ทุกครั้งที่ขึ้นข้อใหม่
// ระวัง ต้องให้ การตั้งเวลาทั้งสองที่ ตรงกันด้วย
  countDown(0,01,48);  // ตั้งเวลา (ข้อละ) 1 นาที 48 วินาที  ไม่เอาดีกว่า ขึ้นข้อใหม่ ให้กดเริ่ม ไม่เอาอัตโนมัติ

  }
    // Validate page
if (page < 1) page = 1;
    if (page > numPages()) page = numPages();

    listing_table.innerHTML = "";

//    for (i = (page-1) * records_per_page; i < (page * records_per_page) && i < objJson.length; i++) {
//        listing_table.innerHTML += objJson[i].number  + "<br>";
//    }

	    for (i = (page-1) * records_per_page; i < (page * records_per_page) && i < thisJson.length; i++) {
        listing_table.innerHTML += thisJson[i].number  + "<br>";
    }
    page_span.innerHTML = page + "/" + numPages();

    if (page == 1) {
        btn_prev.disabled = true;
		btn_first.disabled = true;
    } else {
        btn_prev.disabled = false;
		btn_first.disabled = false;
    }

    if (page == numPages()) {
        btn_next.disabled = true;
		btn_last.disabled = true;
    } else {
        btn_next.disabled = false;
		btn_last.disabled = false;
    }
}

function numPages()
{
//    return Math.ceil(objJson.length / records_per_page);
	  return Math.ceil(thisJson.length / records_per_page);
}


function show_how_to(page, isStartTiming, myJason)
{
    var btn_next = document.getElementById("btn_next");
	btn_next.disabled = true;
    var btn_prev = document.getElementById("btn_prev");
	btn_prev.disabled = true;
	var btn_first = document.getElementById("go_first");
	btn_first.disabled = true;
	var btn_last = document.getElementById("go_last");
	btn_last.disabled = true;
	pauseCountDown();

	var btn_showAns = document.getElementById("showAnswer_btn");
	btn_showAns.disabled = true;

	var itemNum = document.getElementById("item_num");
			itemNum.style.display= 'none';

//	var item_number = document.getElementById("item_num");
 //      item_number.disabled = true;


    var listing_table = document.getElementById("listingTable");
    var page_span = document.getElementById("page");
//    alert("xxx buy already? " +  is_Bought + " page: " + page);


 listing_table.innerHTML = myJason;

// var txtFile = new XMLHttpRequest();
//    txtFile.onload = function(e) {
//      document.getElementById("listing_table").innerHTML = txtFile.responseText;
//    }
//    txtFile.open("GET", "file.txt", true);
//    txtFile.open("GET", "symbol_cndtng_explained.txt", true);

//    txtFile.send(null);

// เวลาจะใช้จริง ให้กำหนดเป็น 6 ก็พอ
 //if((is_Bought == "false") && (page >=200)){
 if((is_Bought == "false") && (page >=8)){
 // alert("xxxx");
  const ans_btn = document.getElementById('showAnswer_btn');
  ans_btn.disabled = true;
//  var msgForNon = document.getElementById('msgForNon-buyers');
//  msgForNon.style.display = 'block';

  }



//if (isStartTiming == true)
//{
//countDown(0,02,0)
//}
    // Validate page
//if (page < 1) page = 1;
 //   if (page > numPages()) page = numPages();

//    listing_table.innerHTML = "";

//	    for (i = (page-1) * records_per_page; i < (page * records_per_page) && i < thisJson.length; i++) {
//        listing_table.innerHTML += thisJson[i].number  + "<br>";
//    }
//    page_span.innerHTML = page + "/" + numPages();

 //   if (page == 1) {
//        btn_prev.disabled = true;
//		btn_first.disabled = true;
//    } else {
//        btn_prev.disabled = false;
//		btn_first.disabled = false;
//    }

//    if (page == numPages()) {
//        btn_next.disabled = true;
//		btn_last.disabled = true;
 //   } else {
 //       btn_next.disabled = false;
//		btn_last.disabled = false;
//    }

}  // end of function


function goToPage(whatPage){  //สำหรับ ไปหน้าแรก หน้าสุดท้าย หรือหน้าที่ระบุ
var pos;

//    // document.getElementById('myInput').value = '';  // ลบที่พิมพ์คำตอบก่อนหน้านี้ ในช่อง input
   document.getElementById('showAnswer').style.display ='none';  // ซ่อนเฉลยที่ปรากฎอยู่
  // thisJson =  good_govt;  // เอาไปใช้ สำหรับให้ฝึก
   if(whatPage == "start"){
   pos = 1;
   current_page = 1;
   }else if(whatPage == "end"){
   pos = thisJson.length;
   current_page = pos;
   }else if(whatPage == "specify"){
    var goPageNum = document.getElementById("itemToGo").value;
         if((goPageNum > thisJson.length-1)||(goPageNum < 1)){
   //         alert("ไม่พบเลขข้อที่ท่านระบุ");
    		return;
         }else{
            pos = goPageNum;
            current_page = pos;
            }
       }
  // alert("go Page: " + pos);
	//current_page = 1;  // เริ่มที่หน้า 1
    changePage(pos, false, thisJson);  // ส่งข้อมูลไปแสดง หน้า, ยังไม่เริ่มจับเวลา(เพราะเพิ่งเข้ามา), ไฟล์ข้อมูลที่เลือก
//    break;
}




/*for timer
var myVar = 0;*/
//var hour,min,sec;
var isPause=false;
var css_start = "display = inline; position: relative; top: 1px; font-size: 20px; font-weight: bold; min-width: 70px; min-height: 10px;";
var pause_btn = "display = inline; position: relative; top: 1px; font-size: 20px; font-weight: bold; color: red; min-width: 70px; min-height: 10px;";
var css_btns = "display = inline; position: relative; top: 1px; font-size: 20px; font-weight: bold; min-width: 70px; min-height: 10px;";
var css_disp_none = "display:none; position: relative; top: 1px; font-size: 20px; font-weight: bold; min-width: 70px; min-height: 10px;";
var css_row = "position: relative; top: 1px;";


function countDown(h, m, s){
// alert("[set time out] h: " + h + " m: " + m + " s: " + s);
document.getElementById("start").style.cssText = css_disp_none;
document.getElementById("pause").style.cssText = pause_btn;
document.getElementById("reset").style.cssText = css_btns;
// document.getElementById("row").style.cssText = css_row;

if (isPause==false)
{
	hour = 0;
	min=0;
	sec=1;
}

if (hour >= h && min >= m && sec >=0)
{
	hour = 0;
	min=0;
	sec=1;
}

myVar = setInterval(function(){

       document.getElementById("timer").innerHTML = hour +" : " + min +" : " + sec ;
       sec++;
       console.log("time out at: " + h  +" : " + m  +" : " + s );
       console.log("timer - time out: " + hour +" : " + min +" : " + sec);
		if(hour == h && min == m && sec == (s+1)){
			document.getElementById("start").style.cssText = css_start;
			document.getElementById("pause").style.cssText = css_disp_none;
			document.getElementById("reset").style.cssText = css_btns;
		//	document.getElementById("row").style.cssText = css_row;

			message = "<strong><font color=\"red\">หมดเวลา </font></strong><br>";
			// แสดง feedback ใน id myMessage ของไฟล์ html ที่เรียกใช้งาน
			document.getElementById("myMessage").innerHTML = message;
			modal.style.display = "block";


			// alert("time's up");

			clearInterval(myVar);
			return;
		}

       if(sec == 60)
       {
         min++;
         //sec = 60;
		 sec = 0;
         if (min == 60)
         {
			 hour++;
			 //min = 60;
			 min = 0;
			 if (hour == h)
			 {
				 hour = h;

			 }

         }
       }
      },1000);
    }

function shuffle(array) {
  let currentIndex = array.length,  randomIndex;
  // While there remain elements to shuffle.
  while (currentIndex != 0) {
    // Pick a remaining element.
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex--;
    // And swap it with the current element.
    [array[currentIndex], array[randomIndex]] = [
      array[randomIndex], array[currentIndex]];
  }
  return array;
}



	function resetCountDown(){

		document.getElementById("start").style.cssText = css_start;
		document.getElementById("pause").style.cssText = css_disp_none;
		document.getElementById("reset").style.cssText = css_btns;
		/* document.getElementById("row").style.cssText = css_row; */

		isPause=false;
		clearInterval(myVar);
		hour=0;
		min=0;
		sec=0;
		document.getElementById("timer").innerHTML = hour +" : " + min +" : " + sec ;
		return false;
}

	function pauseCountDown(){

		document.getElementById("start").style.cssText = css_start;
		document.getElementById("pause").style.cssText = css_disp_none;
		document.getElementById("reset").style.cssText = css_btns;
	//	document.getElementById("row").style.cssText = css_row;

		isPause=true;
		clearInterval(myVar);
		return false;
}


/*!
 * swiped-events.js - v@version@
 * Pure JavaScript swipe events
 * https://github.com/john-doherty/swiped-events
 * @inspiration https://stackoverflow.com/questions/16348031/disable-scrolling-when-touch-moving-certain-element
 * @author John Doherty <www.johndoherty.info>
 * @license MIT
 */
(function (window, document) {

    'use strict';

    // patch CustomEvent to allow constructor creation (IE/Chrome)
    if (typeof window.CustomEvent !== 'function') {

        window.CustomEvent = function (event, params) {

            params = params || { bubbles: false, cancelable: false, detail: undefined };

            var evt = document.createEvent('CustomEvent');
            evt.initCustomEvent(event, params.bubbles, params.cancelable, params.detail);
            return evt;
        };

        window.CustomEvent.prototype = window.Event.prototype;
    }

    document.addEventListener('touchstart', handleTouchStart, false);
    document.addEventListener('touchmove', handleTouchMove, false);
    document.addEventListener('touchend', handleTouchEnd, false);

    var xDown = null;
    var yDown = null;
    var xDiff = null;
    var yDiff = null;
    var timeDown = null;
    var startEl = null;

    /**
     * Fires swiped event if swipe detected on touchend
     * @param {object} e - browser event object
     * @returns {void}
     */
    function handleTouchEnd(e) {

        // if the user released on a different target, cancel!
        if (startEl !== e.target) return;

        var swipeThreshold = parseInt(getNearestAttribute(startEl, 'data-swipe-threshold', '20'), 10); // default 20px
        var swipeTimeout = parseInt(getNearestAttribute(startEl, 'data-swipe-timeout', '500'), 10);    // default 500ms
        var timeDiff = Date.now() - timeDown;
        var eventType = '';
        var changedTouches = e.changedTouches || e.touches || [];

        if (Math.abs(xDiff) > Math.abs(yDiff)) { // most significant
            if (Math.abs(xDiff) > swipeThreshold && timeDiff < swipeTimeout) {
                if (xDiff > 0) {
                    eventType = 'swiped-left';
                }
                else {
                    eventType = 'swiped-right';
                }
            }
        }
        else if (Math.abs(yDiff) > swipeThreshold && timeDiff < swipeTimeout) {
            if (yDiff > 0) {
                eventType = 'swiped-up';
            }
            else {
                eventType = 'swiped-down';
            }
        }

        if (eventType !== '') {

            var eventData = {
                dir: eventType.replace(/swiped-/, ''),
                touchType: (changedTouches[0] || {}).touchType || 'direct',
                xStart: parseInt(xDown, 10),
                xEnd: parseInt((changedTouches[0] || {}).clientX || -1, 10),
                yStart: parseInt(yDown, 10),
                yEnd: parseInt((changedTouches[0] || {}).clientY || -1, 10)
            };

            // fire `swiped` event event on the element that started the swipe
            startEl.dispatchEvent(new CustomEvent('swiped', { bubbles: true, cancelable: true, detail: eventData }));

            // fire `swiped-dir` event on the element that started the swipe
            startEl.dispatchEvent(new CustomEvent(eventType, { bubbles: true, cancelable: true, detail: eventData }));
        }

        // reset values
        xDown = null;
        yDown = null;
        timeDown = null;
    }

    /**
     * Records current location on touchstart event
     * @param {object} e - browser event object
     * @returns {void}
     */
    function handleTouchStart(e) {

        // if the element has data-swipe-ignore="true" we stop listening for swipe events
        if (e.target.getAttribute('data-swipe-ignore') === 'true') return;

        startEl = e.target;

        timeDown = Date.now();
        xDown = e.touches[0].clientX;
        yDown = e.touches[0].clientY;
        xDiff = 0;
        yDiff = 0;
    }

    /**
     * Records location diff in px on touchmove event
     * @param {object} e - browser event object
     * @returns {void}
     */
    function handleTouchMove(e) {

        if (!xDown || !yDown) return;

        var xUp = e.touches[0].clientX;
        var yUp = e.touches[0].clientY;

        xDiff = xDown - xUp;
        yDiff = yDown - yUp;
    }

    /**
     * Gets attribute off HTML element or nearest parent
     * @param {object} el - HTML element to retrieve attribute from
     * @param {string} attributeName - name of the attribute
     * @param {any} defaultValue - default value to return if no match found
     * @returns {any} attribute value or defaultValue
     */
    function getNearestAttribute(el, attributeName, defaultValue) {

        // walk up the dom tree looking for attributeName
        while (el && el !== document.documentElement) {

            var attributeValue = el.getAttribute(attributeName);

            if (attributeValue) {
                return attributeValue;
            }

            el = el.parentNode;
        }

        return defaultValue;
    }

}(window, document));

