const List<List<String>> general = [
  ["ตัวอย่างข้อสอบ ของ กพ.", "label_main_ocscSample", "10012", "1", "a1.0"],
  [
    "ข้อสอบ จากเว็บของ กพ",
    "1_ocsc_answer.xml",
    "1745575210",
    "1",
    "a1.00"
  ],
  ["การคิดวิเคราะห์เชิงภาษา", "label_main_langAnlysis", "1002", "1", "a1.03"],
  ["ภาษาไทย", "label_thai", "100", "1", "a1.1"],
  ["การเรียงประโยค (5 ข้อ)", "label_ordering_phrases", "1000", "1", "a1.12"],
  [
    "เทคนิคการทำข้อสอบเรียงประโยค",
    "sentence_order.html",
    "1622276201",
    "1",
    "a1.14"
  ],
  [
    "เรียงประโยค ชุดที่ 1",
    "2_th_3_word_order_1.xml",
    "1747390641",
    "1",
    "a1.15"
  ],
  [
    "เรียงประโยค  ชุดที่ 2",
    "2_th_3_word_order_2.xml",
    "1718100908",
    "1",
    "a1.16"
  ],
  [
    "เรียงประโยค  ชุดที่ 3",
    "2_th_3_word_order_3.xml",
    "1622276204",
    "1",
    "a1.17"
  ],
  [
    "การวิเคราะห์เหตุผลเชิงภาษา\n(เงื่อนไขภาษา)  (5 ข้อ)",
    "label_thai_rationale",
    "105",
    "1",
    "a1.18"
  ],
  [
    "การตัดสินข้อสรุป เงื่อนไขภาษา",
    "true_false_cannot_say.html",
    "1704707099",
    "1",
    "a1.181"
  ],
  [
    "เงื่อนไขภาษา ชุดที่ 1",
    "1_thai_conclusion_from_text_01.xml",
    "1670839961",
    "1",
    "a1.19"
  ],
  [
    "เงื่อนไขภาษา ชุดที่ 2",
    "1_thai_conclusion_from_text_02.xml",
    "1720236920",
    "1",
    "a1.20"
  ],
  [
    "เงื่อนไขภาษา ชุดที่ 3",
    "1_thai_conclusion_from_text_03.xml",
    "1622276212",
    "1",
    "a1.21"
  ],
  [
    "บทความสั้น\n(บทความสั้น-ยาว รวมกัน ประมาณ 10 ข้อ)",
    "label_short_passages",
    "100",
    "1",
    "a1.22"
  ],
  [
    "เทคนิคการทำข้อสอบ บทความสั้น",
    "how_to_shrt_pssge.html",
    "1622276214",
    "1",
    "a1.23"
  ],
  [
    "บทความสั้น ชุดที่ 1",
    "2_th_4_short_passage_04.xml",
    "1622276215",
    "1",
    "a1.24"
  ],
  [
    "บทความสั้น ชุดที่ 2",
    "2_th_4_short_passage_02.xml",
    "1622276216",
    "1",
    "a1.25"
  ],
  [
    "บทความสั้น ชุดที่ 3",
    "2_th_4_short_passage_01.xml",
    "1622276216",
    "1",
    "a1.251"
  ],
  [
    "บทความสั้น ชุดที่ 4",
    "2_th_4_short_passage_03.xml",
    "1622276216",
    "1",
    "a1.252"
  ],
  ["บทความยาว", "label_long_passages", "100", "1", "a1.259"],
  [
    "เทคนิคการทำข้อสอบ บทความยาว",
    "2_th_5_long_passage_00_tips.html",
    "1622276218",
    "1",
    "a1.26"
  ],
  [
    "บทความยาว ชุดที่ 1",
    "2_th_5_long_passage_01.html",
    "1653524970",
    "1",
    "a1.27"
  ],
  [
    "บทความยาว ชุดที่ 2",
    "2_th_5_long_passage_02.html",
    "1622276221",
    "1",
    "a1.28"
  ],
  [
    "บทความยาว ชุดที่ 3",
    "2_th_5_long_passage_03.html",
    "1622276222",
    "1",
    "a1.29"
  ],
  [
    "บทความยาว ชุดที่ 4",
    "2_th_5_long_passage_04.html",
    "1622276223",
    "1",
    "a1.30"
  ],
  [
    "บทความยาว ชุดที่ 5",
    "2_th_5_long_passage_05.html",
    "1622276234",
    "1",
    "a1.31"
  ],
  [
    "บทความยาว ชุดที่ 6 ",
    "2_th_5_long_passage_06.html",
    "1622276225",
    "1",
    "a1.32"
  ],
  ["บทความยาว", "label_long_passages", "100", "1", "a1.27"],
  [
    "เทคนิคการทำข้อสอบ บทความยาว",
    "2_th_5_long_passage_00_tips.html",
    "1622276218",
    "1",
    "a1.33"
  ],
  [
    "บทความยาว ชุดที่ 1",
    "2_th_5_long_passage_01.html",
    "1653524970",
    "1",
    "a1.34"
  ],
  [
    "บทความยาว ชุดที่ 2",
    "2_th_5_long_passage_02.html",
    "1622276221",
    "1",
    "a1.35"
  ],
  [
    "บทความยาว ชุดที่ 3",
    "2_th_5_long_passage_03.html",
    "1622276222",
    "1",
    "a1.36"
  ],
  [
    "บทความยาว ชุดที่ 4",
    "2_th_5_long_passage_04.html",
    "1622276223",
    "1",
    "a1.37"
  ],
  [
    "บทความยาว ชุดที่ 5",
    "2_th_5_long_passage_05.html",
    "1622276234",
    "1",
    "a1.38"
  ],
  [
    "บทความยาว ชุดที่ 6 ",
    "2_th_5_long_passage_06.html",
    "1622276225",
    "1",
    "a1.39"
  ],
  ["การคิดวิเคราะห์เชิงนามธรรม", "label_main_abstract", "100", "1", "a1.390"],
  [
    "การหาความสัมพันธ์ ของคำ\nข้อความ อุปมาอุปไมย  (5 ข้อ)",
    "label_metaphore",
    "10011",
    "1",
    "a1.40"
  ],
  [
    "หลักการทำข้อสอบ อุปมาอุปไมย",
    "1_metaphor_lang_00.html",
    "1622276232",
    "1",
    "a1.41"
  ],
  [
    "คำลักษณนาม ที่ควรรู้ ",
    "character_of_nouns.html",
    "1746747678",
    "1",
    "a1.42"
  ],
  [
    "คำอุปมาอุปไมย ที่ควรรู้ ",
    "1_metaphor_lang_01_with_search.html",
    "1622276233",
    "1",
    "a1.421"
  ],
  [
    "อุปมาอุปไมย ชุดที่ 1 ",
    "1_metaphor_lang_04.xml",
    "1746773195",
    "1",
    "a1.43"
  ],
  [
    "อุปมาอุปไมย ชุดที่ 2 ",
    "1_metaphor_lang_01.xml",
    "1622276235",
    "1",
    "a1.44"
  ],
  [
    "อุปมาอุปไมย ชุดที่ 3",
    "1_metaphor_lang_02.xml",
    "1622276236",
    "1",
    "a1.45"
  ],
  [
    "อุปมาอุปไมย ชุดที่ 4 ",
    "1_metaphor_lang_03.xml",
    "1622276237",
    "1",
    "a1.46"
  ],
  [
    "การคิดวิเคราะห์เชิงปริมาณ",
    "label_main_quantitative_analysis",
    "100",
    "1",
    "a1.49"
  ],
  ["อนุกรม (5 ข้อ)", "label_num_reasoning", "100", "1", "a1.492"],
  [
    "หลักการทำข้อสอบ อนุกรม",
    "1_num_reasng_00_tips.html",
    "1622276244",
    "1",
    "a1.50"
  ],
  [
    "แบบฝึกข้อสอบอนุกรม",
    "sequential_num_exercise.html",
    "1661142042",
    "1",
    "a1.501"
  ],
  ["อนุกรม ชุดที่ 1", "1_num_reasng_01.xml", "1747262051", "1", "a1.51"],
  ["อนุกรม ชุดที่ 2", "1_num_reasng_02.xml", "1654404665", "1", "a1.52"],
  ["อนุกรม ชุดที่ 3", "1_num_reasng_03.xml", "1622276247", "1", "a1.53"],
  ["อนุกรม ชุดที่ 4", "1_num_reasng_04.xml", "1622276248", "1", "a1.54"],
  ["อนุกรม ชุดที่ 5", "1_num_reasng_05.xml", "1622276249", "1", "a1.55"],
  ["อนุกรม ชุดที่ 6", "1_num_reasng_06.xml", "1622276250", "1", "a1.56"],
  ["อนุกรม ชุดที่ 7", "1_num_reasng_07.xml", "1654404665", "1", "a1.57"],
  ["เงื่อนไขสัญลักษณ์ (10 ข้อ)", "label_symbol", "100", "1", "a1.58"],
  [
    "หลักการทำข้อสอบ เงื่อนไขสัญลักษณ์ ",
    "1_symbol_cndtng_00.html",
    "1622276253",
    "1",
    "a1.59"
  ],
  [
    "แบบฝึกหัด เงื่อนไขสัญลักษณ์ ",
    "symbol_cndtng_exercise.html",
    "1681204126",
    "1",
    "a1.591"
  ],
  [
    "เงื่อนไขสัญลักษณ์  ชุดที่ 1 ",
    "1_symbol_cndtng_01.xml",
    "1747713165",
    "1",
    "a1.60"
  ],
  [
    "เงื่อนไขสัญลักษณ์  ชุดที่ 2 ",
    "1_symbol_cndtng_02.xml",
    "1654404665",
    "1",
    "a1.61"
  ],
  [
    "เงื่อนไขสัญลักษณ์  ชุดที่ 3  ",
    "1_symbol_cndtng_03.xml",
    "1622276255",
    "1",
    "a1.62"
  ],
  ["คณิตศาสตร์ทั่วไป  (5 ข้อ) ", "label_basic_math", "100", "1", "a1.621"],
  [
    "ร้อยละ-อัตราส่วน",
    "1_gen_math_04_percent_ratio.xml",
    "1622276276",
    "1",
    "a1.63"
  ],
  ["คิดลัด ร้อยละ", "1_percent_shortcut.html", "1641015648", "1", "a1.631"],
  [
    "ความเร็ว-เวลา-ระยะทาง",
    "1_gen_math_06_speed_time_distance.xml",
    "1622276277",
    "1",
    "a1.64"
  ],
  ["แบบฝึกเลขยกกำลัง", "exponent_exercise.html", "1666167001", "1", "a1.651"],
  ["แบบฝึกโอเปอเรชั่น", "operate_exercise.html", "1655796937", "1", "a1.652"],
  ["โอเปอเรชั่น", "1_gen_math_operate_01.xml", "1712817896", "1", "a1.66"],
  [
    "ตัวอย่างโจทย์และวิธีคิด กำไร ร้อยละ",
    "1_sales_problem_sample.html",
    "1653653059",
    "1",
    "a1.67"
  ],
  ["โจทย์สมการ", "1_gen_math_05_equation.xml", "1681252051", "1", "a1.671"],
  ["ค.ร.น./ห.ร.ม", "1_gen_math_01_lcm_gcd.xml", "1622276272", "1", "a1.672"],
  [
    "บัญญัติไตรยางค์",
    "1_gen_math_03_rule_of_three.xml",
    "1646718720",
    "1",
    "a1.673"
  ],
  [
    "โจทย์คละคณิตศาสตร์",
    "1_gen_math_02_misc_01.xml",
    "1747540860",
    "1",
    "a1.68"
  ],
  ["ตารางข้อมูล  (5 ข้อ)", "label_data_chart", "100", "1", "a1.69"],
  [
    "เทคนิคการทำข้อสอบ ตาราง",
    "solving_table_problems.html",
    "1660192837",
    "1",
    "a1.70"
  ],
  ["แบบฝึกตารางข้อมูล", "table_exercise.html", "1632538220", "1", "a1.701"],
  [
    "วิเคราะห์ข้อมูล-ตาราง ชุดที่ 1",
    "1_graph_chart_table_02.html",
    "1632538219",
    "1",
    "a1.702"
  ],
  [
    "วิเคราะห์ข้อมูล-ตาราง ชุดที่ 2",
    "1_graph_chart_table_03.html",
    "1683532682",
    "1",
    "a1.703"
  ],
  [
    "ฝึกข้อสอบเสมือนจริง จับเวลา",
    "label_main_mathAuthenticTestExercise",
    "100",
    "1",
    "a1.80"
  ],
  [
    "คณิตศาสตร์ \n8 ปี (2559-2566)",
    "realTest_math_exercise.html",
    "1712114055",
    "1",
    "a1.801"
  ],
  [
    "คณิตศาสตร์ ปี 2567-2568",
    "realTest_math_exercise_2.html",
    "1717667201",
    "1",
    "a1.8011"
  ],
  [
    "อุปมา-อุปไมย",
    "realTest_thai_metaphor_exercise.html",
    "1712114054",
    "1",
    "a1.802"
  ],
];

const List<List<String>> english = [
  ["แนวข้อสอบ บทสนทนา", "label_main_conversation", "100", "2", "a2.10"],
  ["บทสนทนา ชุดที่ 1", "3_en_convr_easy_01.xml", "1622276250", "2", "a2.11"],
  ["บทสนทนา ชุดที่ 2", "3_en_convr_easy_02.xml", "1622276246", "2", "a2.12"],
  ["บทสนทนา ชุดที่ 3", "3_en_convr_easy_001.xml", "1622276245", "2", "a2.13"],
  ["บทสนทนา ชุดที่ 4", "3_en_convr_easy_04.xml", "1622276246", "2", "a2.14"],
  [
    "บทสนทนา ชุดที่ 5",
    "3_en_convr_normal_01.xml",
    "1622276247",
    "2",
    "a2.15"
  ],
  ["บทสนทนา ชุดที่ 6", "3_en_long_cnvr_01.html", "1622276248", "2", "a2.16"],
  ["บทสนทนา ชุดที่ 7", "3_en_long_cnvr_02.html", "1622276249", "2", "a2.17"],
  ["บทสนทนา ชุดที่ 8", "3_en_long_cnvr_03.html", "1622276250", "2", "a2.18"],
  ["บทสนทนา ชุดที่ 9", "3_en_long_cnvr_04.html", "1622276251", "2", "a2.19"],
  ["บทสนทนา ชุดที่ 10", "3_en_long_cnvr_05.html", "1622276252", "2", "a2.20"],
  ["บทสนทนา ชุดที่ 11", "3_en_long_cnvr_06.html", "1622276253", "2", "a2.21"],
  [
    "บทสนทนา ชุดที่ 12 ",
    "3_en_long_cnvr_07.html",
    "1622276254",
    "2",
    "a2.22"
  ],
  [
    "บทสนทนา ชุดที่ 14 (ข้อสอบเสมือนจริง)",
    "3_en_long_cnvr_09.html",
    "1669530226",
    "2",
    "a2.221"
  ],
  ["บทสนทนา แนวข้อสอบจริง 2568 ชุดที่ 1", "3_en_long_cnvr_realTest_like_1.html", "1745114937", "2", "a2.222"],
  ["บทสนทนา แนวข้อสอบจริง 2568 ชุดที่ 2", "3_en_long_cnvr_realTest_like_2.html", "1745114937", "2", "a2.223"],
  ["คำศัพท์", "label_main_eng_vocab", "100", "2", "a2.23"],
  [
    "คำศัพท์ภาษาอังกฤษที่ควรรู้จัก",
    "vocab_study.html",
    "1619737502",
    "2",
    "a2.231"
  ],
  [
    "คำภาษาอังกฤษที่มักใช้ผิด",
    "commonly_confused_words_with_search.html",
    "1668749358",
    "2",
    "a2.232"
  ],
  [
    "กริยาวลี (Phrasal Verbs)",
    "3_en_phrasal_verbs.html",
    "1622276256",
    "2",
    "a2.24"
  ],
  ["คำศัพท์ ชุดที่ 1", "3_en_vocab_01.xml", "1746490140", "2", "a2.25"],
  ["คำศัพท์ ชุดที่ 2", "3_en_vocab_02.xml", "1622276258", "2", "a2.26"],
  ["คำศัพท์ ชุดที่ 3", "3_en_vocab_03.xml", "1622276259", "2", "a2.27"],
  [
    "คำศัพท์ ชุดที่ 4: Odd One Out",
    "3_en_vocab_04.xml",
    "1622276260",
    "2",
    "a2.28"
  ],
  [
    "คำศัพท์ ชุดที่ 5: Phrasal Verbs",
    "3_en_phrasal_verbs_01.xml",
    "1622276261",
    "2",
    "a2.29"
  ],
  ["สรุป/ทบทวน Grammar", "label_main_eng_grammar", "100", "2", "a2.30"],
  [
    "Parts of Speech",
    "3_en_parts_of_speech.html",
    "1622276263",
    "2",
    "a2.31"
  ],
  ["Tenses", "3_en_tense_review.html", "1622276264", "2", "a2.32"],
  ["If Clause", "3_en_con_if_review.html", "1622276265", "2", "a2.33"],
  [
    "Active/Passive Voice",
    "3_en_passive_voice_review.html",
    "1622276266",
    "2",
    "a2.34"
  ],
  [
    "การใช้ Infinitive และ Gerund",
    "3_en_infinitive_gerund.html",
    "1622276267",
    "2",
    "a2.35"
  ],
  [
    "แบบฝึกหัด Infinitive และ Gerund",
    "3_en_infinitive_gerund_exercise.html",
    "1622276268",
    "2",
    "a2.36"
  ],
  [
    "การใช้ a, an และ the",
    "3_en_article_review.html",
    "1622276269",
    "2",
    "a2.37"
  ],
  ["แนวข้อสอบ Grammar", "label_main_eng__grammar_tests", "100", "2", "a2.38"],
  ["แนวข้อสอบ Grammar 01", "3_en_grmmr_01.xml", "1622276271", "2", "a2.39"],
  ["แนวข้อสอบ Grammar 02", "3_en_grmmr_02.xml", "1622276272", "2", "a2.40"],
  [
    "แนวข้อสอบ Tense_ชุดที่_1",
    "3_en_tense_01.xml",
    "1622276273",
    "2",
    "a2.41"
  ],
  [
    "แนวข้อสอบ Tense_ชุดที่_2",
    "3_en_tense_02.xml",
    "1667696787",
    "2",
    "a2.42"
  ],
  [
    "แนวข้อสอบ Infinitive vs Gerund_1",
    "3_en_infinitive_01.xml",
    "1622276275",
    "2",
    "a2.43"
  ],
  [
    "แนวข้อสอบ Infinitive vs Gerund_2",
    "3_en_infinitive_02.xml",
    "1622276276",
    "2",
    "a2.44"
  ],
  ["จดหมาย", "label_main_eng_letters", "100", "2", "a2.45"],
  ["จดหมาย 1: letter of complaint", "3_en_lttr_06.html", "1744861887", "2", "a2.451"],
  ["จดหมาย 2: บันทึกข้อความเชิญประชุม", "3_en_memo_review_project.html", "1622276278", "2", "a2.452"],
  ["จดหมาย 3", "3_en_lttr_01.html", "1622276278", "2", "a2.46"],
  ["จดหมาย 4", "3_en_lttr_02.html", "1622276279", "2", "a2.47"],
  ["จดหมาย 5", "3_en_lttr_03.html", "1622276280", "2", "a2.48"],
  ["จดหมาย 6", "3_en_lttr_04.html", "1622276281", "2", "a2.49"],
  ["จดหมาย 7", "3_en_lttr_05.html", "1622276282", "2", "a2.50"],
  ["จดหมาย 8: จดหมายเลื่อนตำแหน่ง", "3_en_promotion_lettrs.html", "1622276283", "2", "a2.501"],
  ["แนวข้อสอบ Reading", "label_main_eng_reading", "100", "2", "a2.51"],
  [
    "ข้อสอบ Reading: Healthy Food",
    "3_en_shrt_healthy_food.html",
    "1742107002",
    "2",
    "a2.51001"
  ],
  [
    "ข้อสอบ Reading: Earthquakes",
    "3_en_lng_earthquake.html",
    "1745148052",
    "2",
    "a2.510011"
  ],
  [
    "ข้อสอบ Reading: Screen Time",
    "3_en_lng_screen_time_b1.html",
    "1742107002",
    "2",
    "a2.5101"
  ],
  [
    "ข้อสอบ Reading: Screen Time (ศัพท์ยากขึ้น)",
    "3_en_lng_screen_time_b2.html",
    "1742107002",
    "2",
    "a2.5102"
  ],
  [
    "ข้อสอบ Reading ชุดที่ 1: Artificial Intelligence",
    "3_en_long_pssge_07.html",
    "1742107002",
    "2",
    "a2.511"
  ],
  [
    "ข้อสอบ Reading ชุดที่ 2: COVID-19",
    "3_en_long_pssge_03.html",
    "1622276284",
    "2",
    "a2.52"
  ],
  [
    "ข้อสอบ Reading ชุดที่ 3",
    "3_en_long_pssge_04.html",
    "1622276285",
    "2",
    "a2.53"
  ],
  [
    "ข้อสอบ Reading ชุดที่ 4",
    "3_en_long_pssge_01.html",
    "1622276286",
    "2",
    "a2.54"
  ],
  [
    "ข้อสอบ Reading ชุดที่ 5",
    "3_en_long_pssge_02.html",
    "1622276287",
    "2",
    "a2.55"
  ],
  [
    "ข้อสอบ Reading ชุดที่ 6",
    "3_en_long_pssge_05.html",
    "1622276288",
    "2",
    "a2.56"
  ],
  [
    "ข้อสอบ Reading ชุดที่ 7",
    "3_en_long_pssge_06.html",
    "1622276289",
    "2",
    "a2.57"
  ],
  [
    "ข้อสอบ Reading ชุดที่ 8 AI: A Double-Edged Sword",
    "3_en_long_pssge_08.html",
    "1742114839",
    "2",
    "a2.58"
  ],
];

const List<List<String>> law = [
  ["ระเบียบบริหารราชการแผ่นดิน", "label_main_governance", "100", "3", "a3.10"],
  [
    "พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน พ.ศ. ๒๕๓๔ (แก้ไขเพิ่มเติม ถึง ปัจจุบัน)",
    "5_1_1_state_admin_regulation.html",
    "1622276292",
    "3",
    "a3.11"
  ],
  [
    "ถาม-ตอบ พ.ร.บ. ระเบียบบริหารราชการแผ่นดิน",
    "q-and-a_good_govt_exercise.html",
    "1622276292",
    "3",
    "a3.111"
  ],
  [
    "แนวข้อสอบ ระเบียบบริหารราชการแผ่นดิน",
    "label_governance_questions",
    "100",
    "3",
    "a3.12"
  ],
  [
    "แนวข้อสอบระเบียบบริหารราชการแผ่นดิน ชุดที่ 1",
    "5_1_2_state_admin_reg_1.xml",
    "1747540659",
    "3",
    "a3.13"
  ],
  [
    "แนวข้อสอบระเบียบบริหารราชการแผ่นดิน ชุดที่ 2",
    "5_1_3_state_admin_reg_2.xml",
    "1622276296",
    "3",
    "a3.14"
  ],
  [
    "หลักการบริหารกิจการบ้านเมืองที่ดี",
    "label_main_good_governance",
    "100",
    "3",
    "a3.15"
  ],
  [
    "พระราชกฤษฎีกา ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี พ.ศ. ๒๕๔๖",
    "5_2_1_good_governance.html",
    "1622276296",
    "3",
    "a3.16"
  ],
  [
    "พระราชกฤษฎีกา ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี (ฉบับที่ ๒) พ.ศ. ๒๕๖๒",
    "5_2_1_(2)_good_governance.html",
    "1622276296",
    "3",
    "a3.161"
  ],
  [
    "สรุป พ.ร.ฎ. หลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี",
    "goodGvnce_gist.html",
    "1689929515",
    "3",
    "a3.1611"
  ],
  [
    "ถาม-ตอบ พ.ร.ฎ. ว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี ",
    "q-and-a_good_govt_principles_exercise.html",
    "1657263383",
    "3",
    "a3.162"
  ],
  [
    "แนวข้อสอบ หลักการบริหารกิจการบ้านเมืองที่ดี",
    "label_good_governance_questions",
    "100",
    "3",
    "a3.17"
  ],
  [
    "แนวข้อสอบหลักการบริหาร ฯ  ชุดที่ 1",
    "5_2_2_good_governance_1.xml",
    "1653770277",
    "3",
    "a3.18"
  ],
  [
    "แนวข้อสอบหลักการบริหาร ฯ ชุดที่ 2",
    "5_2_3_good_governance_2.xml",
    "1622276296",
    "3",
    "a3.19"
  ],
  [
    "วิธีปฏิบัติราชการทางปกครอง",
    "label_main_practical_rules",
    "100",
    "3",
    "a3.20"
  ],
  [
    "พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง พ.ศ. ๒๕๓๙ และที่แก้ไขเพิ่มเติม",
    "5_3_1_administrative_procedure.html",
    "1622276296",
    "3",
    "a3.21"
  ],
  [
    "กฎกระทรวง กําหนดกรณีอื่นที่เจ้าหน้าที่จะทําการพิจารณาทางปกครองไม่ได้ พ.ศ. ๒๕๖๖",
    "5_3_1_administrative_procedure_2566.html",
    "1687169108",
    "3",
    "a3.210"
  ],
  [
    "สรุป สาระสำคัญ พระราชบัญญัติ วิธีปฏิบัติราชการทางปกครอง",
    "guideline_for_issuing_official_order_act.html",
    "1658975827",
    "3",
    "a3.211"
  ],
  [
    "ตัวอย่างคำสั่งทางปกครอง",
    "adminstrative-order-explained.html",
    "1727038495",
    "3",
    "a3.2111"
  ],
  [
    "ถาม-ตอบ พ.ร.บ. วิธีปฏิบัติราชการทางปกครอง",
    "q-and-a_practice_law_exercise.html",
    "1662528452",
    "3",
    "a3.212"
  ],
  [
    "แนวข้อสอบ วิธีปฏิบัติราชการทางปกครอง",
    "label_practical_rules_questions",
    "100",
    "3",
    "a3.22"
  ],
  [
    "แนวข้อสอบ วิธีปฏิบัติราชการทางปกครอง ชุดที่ 1",
    "5_3_2_administrative_procedure_1.xml",
    "1683351672",
    "3",
    "a3.221"
  ],
  [
    "แนวข้อสอบ วิธีปฏิบัติราชการทางปกครอง ชุดที่ 2",
    "5_3_3_administrative_procedure_2.xml",
    "1622276296",
    "3",
    "a3.23"
  ],
  [
    "หน้าที่และความรับผิดในการปฏิบัติหน้าที่ราชการ",
    "label_main_responsibility",
    "100",
    "3",
    "a3.26"
  ],
  [
    "พระราชบัญญัติ ความรับผิดทางละเมิดของเจ้าหน้าที่ พ.ศ. ๒๕๓๙",
    "5_4_1_violation_penalty.html",
    "1622276296",
    "3",
    "a3.28"
  ],
  [
    "สาระสำคัญของ พ.ร.บ. ความรับผิดทางละเมิดของเจ้าหน้าที่",
    "5_4_2_violation_penalty_gist.html",
    "1622276296",
    "3",
    "a3.29"
  ],
  [
    "ระเบียบสำนักนายกรัฐมนตรีว่าด้วยหลักเกณฑ์การปฏิบัติเกี่ยวกับความรับผิดทางละเมิดของเจ้าหน้าที่ พ.ศ. 2539 และที่แก้ไขเพิ่มเติม",
    "5_4_3_violation_penalty_regulations.html",
    "1622276296",
    "3",
    "a3.30"
  ],
  [
    "แนวข้อสอบ ความรับผิดทางละเมิด",
    "label_violation_penalty",
    "100",
    "3",
    "a3.32"
  ],
  [
    "แนวข้อสอบ ความรับผิดต่อตำแหน่งหน้าที่ราชการ",
    "5_6_1_criminal_law_1.xml",
    "1622276296",
    "3",
    "a3.33"
  ],
  [
    "แนวข้อสอบ ความรับผิดทางละเมิดของเจ้าหน้าที",
    "5_4_5_violation_penalty_1.xml",
    "1670573255",
    "3",
    "a3.34"
  ],
  [
    "เจตคติและจริยธรรม สําหรับข้าราชการ",
    "label_main_ethics",
    "100",
    "3",
    "a3.39"
  ],
  [
    "พระราชบัญญัติมาตรฐานทางจริยธรรม พ.ศ. ๒๕๖๒",
    "5_5_1_ethics_acts_2562.html",
    "1622276296",
    "3",
    "a3.40"
  ],
  [
    "สรุปสาระสำคัญ พ.ร.บ.มาตรฐานทางจริยธรรม",
    "5_5_2_ethics_acts_essence_of.html",
    "1622276296",
    "3",
    "a3.42"
  ],
  [
    "ตัวอย่างพฤติกรรม ตาม พ.ร.บ.มาตรฐานทางจริยธรรม (Infographics ของ ก.พ.)",
    "ocsc_ethics.pdf",
    "1705906849",
    "3",
    "a3.44"
  ],
  [
    "คำอธิบายและตัวอย่างพฤติกรรม ตามมาตรฐานทางจริยธรรม (เอกสารของ ก.พ.)",
    "etics_behaviors_explained.pdf",
    "1705906849",
    "3",
    "a3.441"
  ],
  ["จริยธรรมข้าราชการ", "label_official_ethics", "100", "3", "a3.44"],
  [
    "แนวข้อสอบ จริยธรรมข้าราชการ",
    "5_5_3_ethics_1.xml",
    "1670568518",
    "3",
    "a3.45"
  ],
  [
    "กฎหมายอาญา ที่เกี่ยวข้อง",
    "label_main_criminal_law_act",
    "100",
    "3",
    "a3.46"
  ],
  [
    "ความผิดต่อตำแหน่งหน้าที่ราชการ (มาตรา ๑๔๗-๑๖๖)",
    "5_6_1_criminal_law.html",
    "1670568518",
    "3",
    "a3.47"
  ],
  [
    "คดีตัวอย่างการกระทำความผิดต่อหน้าที่ ของเจ้าพนักงาน",
    "ocsc_criminal_law.pdf",
    "1670568518",
    "3",
    "a3.4701"
  ],
  [
    "แนวข้อสอบ ความผิดต่อตำแหน่งหน้าที่ราชการ",
    "5_5_4_criminal_law_1.xml",
    "100",
    "3",
    "a3.471"
  ],
  [
    "ข้อสอบเสมือนจริง(กฎหมาย)",
    "label_main_electornics_act",
    "100",
    "3",
    "a3.48"
  ],
  [
    "ข้อสอบเสมือนจริง 2567-2568",
    "ocsc_law_2567_paper-pencil-eExam.xml",
    "1747993354",
    "3",
    "a3.481"
  ],
  [
    "ข้อสอบเสมือนจริง - จับเวลา\n(2563-2566) ",
    "realTest_law_exercise.html",
    "1695800108",
    "3",
    "a3.49"
  ],
];

const List<List<String>> practice = [
  [
    "ความสามารถทั่วไป/ภาษาไทย/ข้าราชการที่ดี",
    "4_full_exam_ocsc_gen_th.html",
    "1622276295",
    "4",
    "a4.11"
  ],
  ["ภาษาอังกฤษ ", "4_full_exam_ocsc_eng.html", "1622276297", "4", "a4.12"],
  ["ฝึกทำข้อสอบ ชุดเต็ม", "label_main_full_test", "100", "4", "a4.121"],
  [
    "ข้อสอบชุดเต็ม ชุดที่ 1\nเวลา 3 ชั่วโมง",
    "4_full_exam_all_01.html",
    "1698123701",
    "4",
    "a4.122"
  ],
  [
    "เฉลยข้อสอบชุดเต็ม ชุดที่ 1",
    "4_full_exam_all_01_ans.html",
    "1698123701",
    "4",
    "a4.123"
  ],
  [
    "ข้อสอบชุดเต็ม ชุดที่ 2\nเวลา 3 ชั่วโมง",
    "4_full_exam_all_02.html",
    "1698123701",
    "4",
    "a4.124"
  ],
  [
    "เฉลยข้อสอบชุดเต็ม ชุดที่ 2",
    "4_full_exam_all_02_answer.html",
    "1698123701",
    "4",
    "a4.125"
  ],
  [
    "ข้อสอบชุดเต็ม ชุดที่ 3\nเวลา 3 ชั่วโมง",
    "4_full_exam_all_03.html",
    "1704696527",
    "4",
    "a4.126"
  ],
  [
    "เฉลยข้อสอบชุดเต็ม ชุดที่ 3",
    "4_full_exam_all_03_answer.html",
    "1704696527",
    "4",
    "a4.127"
  ],
  [
    "ข้อสอบชุดเต็ม ชุดที่ 4\nเวลา 3 ชั่วโมง",
    "4_full_exam_all_04.html",
    "1704696527",
    "4",
    "a4.128"
  ],
  [
    "เฉลยข้อสอบชุดเต็ม ชุดที่ 4",
    "4_full_exam_all_04_answer.html",
    "1704696527",
    "4",
    "a4.1281"
  ],
  [
    "ข้อสอบชุดเต็ม ชุดที่ 5\nเวลา 3 ชั่วโมง",
    "4_full_exam_all_05.html",
    "1704696527",
    "4",
    "a4.129"
  ],
  [
    "เฉลยข้อสอบชุดเต็ม ชุดที่ 5",
    "4_full_exam_all_05_answer.html",
    "1704696527",
    "4",
    "a4.1291"
  ],
  [
    "ข้อสอบชุดเต็ม ชุดที่ 6\nเวลา 3 ชั่วโมง",
    "4_full_exam_all_06.html",
    "1722420833",
    "4",
    "a4.1292"
  ],
  [
    "เฉลยข้อสอบชุดเต็ม ชุดที่ 6",
    "4_full_exam_all_06_answer.html",
    "1722420834",
    "4",
    "a4.1293"
  ],
  [
    "ความสามารถททางการคิดวิเคราะห์",
    "label_main_analysis",
    "100",
    "4",
    "a4.13"
  ],
  [
    "ความสามารถในการคิดวิเคราะห์ ชุดที่ 1",
    "4_full_exam_gen_01.html",
    "1622276296",
    "4",
    "a4.14"
  ],
  [
    "ความสามารถในการคิดวิเคราะห์ ชุดที่ 2 ",
    "4_full_exam_gen_02.html",
    "1622276296",
    "4",
    "a4.15"
  ],
  [
    "ความสามารถในการคิดวิเคราะห์ ชุดที่ 3 ",
    "4_full_exam_gen_03.html",
    "1622276296",
    "4",
    "a4.16"
  ],
  [
    "ความสามารถในการคิดวิเคราะห์ ชุดที่ 4 ",
    "4_full_exam_gen_04.html",
    "1622276296",
    "4",
    "a4.17"
  ],
  [
    "ความสามารถในการคิดวิเคราะห์ ชุดที่ 5 ",
    "4_full_exam_gen_05.html",
    "1622276296",
    "4",
    "a4.18"
  ],
  [
    "ความสามารถในการคิดวิเคราะห์ ชุดที่ 6 ",
    "4_full_exam_gen_06.html",
    "1622276296",
    "4",
    "a4.19"
  ],
  [
    "ความสามารถในการคิดวิเคราะห์ ชุดที่ 7 ",
    "4_full_exam_gen_07.html",
    "1622276296",
    "4",
    "a4.20"
  ],
  [
    "ความสามารถในการคิดวิเคราะห์ ชุดที่ 8 ",
    "4_full_exam_gen_08.html",
    "1622276296",
    "4",
    "a4.21"
  ],
  [
    "ความสามารถในการคิดวิเคราะห์ ชุดที่ 9 ",
    "4_full_exam_gen_09.html",
    "1622276296",
    "4",
    "a4.22"
  ],
  [
    "ความสามารถในการคิดวิเคราะห์ ชุดที่ 10 ",
    "4_full_exam_gen_10.html",
    "1622276296",
    "4",
    "a4.23"
  ],
  ["ภาษาอังกฤษ", "label_main_english_tests", "100", "4", "a4.24"],
  [
    "ภาษาอังกฤษ ชุดที่ 1 ",
    "4_full_exam_en_01.html",
    "1622276296",
    "4",
    "a4.25"
  ],
  [
    "ภาษาอังกฤษ ชุดที่ 2 ",
    "4_full_exam_en_02.html",
    "1622276296",
    "4",
    "a4.26"
  ],
  [
    "ภาษาอังกฤษ ชุดที่ 3 ",
    "4_full_exam_en_03.html",
    "1622276296",
    "4",
    "a4.27"
  ],
  [
    "ภาษาอังกฤษ ชุดที่ 4 ",
    "4_full_exam_en_04.html",
    "1622276296",
    "4",
    "a4.28"
  ],
  [
    "ภาษาอังกฤษ ชุดที่ 5 ",
    "4_full_exam_en_05.html",
    "1622276296",
    "4",
    "a4.29"
  ],
  [
    "ภาษาอังกฤษ ชุดที่ 6 ",
    "4_full_exam_en_06.html",
    "1622276296",
    "4",
    "a4.30"
  ],
  [
    "ภาษาอังกฤษ ชุดที่ 7 ",
    "4_full_exam_en_07.html",
    "1622276296",
    "4",
    "a4.31"
  ],
  [
    "ภาษาอังกฤษ ชุดที่ 8 ",
    "4_full_exam_en_08.html",
    "1622276296",
    "4",
    "a4.32"
  ],
  [
    "ภาษาอังกฤษ ชุดที่ 9 ",
    "4_full_exam_en_09.html",
    "1622276296",
    "4",
    "a4.33"
  ],
  [
    "ภาษาอังกฤษ ชุดที่ 10 ",
    "4_full_exam_en_10.html",
    "1622276296",
    "4",
    "a4.34"
  ],
  [
    "การเป็นข้าราชการที่ดี",
    "label_main_being_good_civl_servants",
    "100",
    "4",
    "a4.35"
  ],
  [
    "การเป็นข้าราชการที่ดี ชุดที่ 1 ",
    "5_full_exam_good_cv_01.html",
    "1622276296",
    "4",
    "a4.36"
  ],
  [
    "การเป็นข้าราชการที่ดี ชุดที่ 2 ",
    "5_full_exam_good_cv_02.html",
    "1622276296",
    "4",
    "a4.37"
  ],
];
